<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch01.html" title="&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;"><link rel="prev" href="intro.naturalformal.html" title="2.&#xA0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x548C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;"><link rel="next" href="intro.helloworld.html" title="4.&#xA0;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="intro.naturalformal.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="intro.helloworld.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2704937"></a>3.&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;</h2></div></div></div><p>&#x7F16;&#x7A0B;&#x662F;&#x4E00;&#x4EF6;&#x590D;&#x6742;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x4EBA;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x96BE;&#x514D;&#x7ECF;&#x5E38;&#x51FA;&#x9519;&#x3002;&#x636E;&#x8BF4;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5178;&#x6545;&#xFF1A;&#x65E9;&#x671F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x79EF;&#x90FD;&#x5F88;&#x5927;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x627E;&#x4E86;&#x534A;&#x5929;&#x539F;&#x56E0;&#x6700;&#x540E;&#x53D1;&#x73B0;&#x662F;&#x4E00;&#x53EA;&#x81ED;&#x866B;&#x94BB;&#x8FDB;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x9020;&#x6210;&#x7684;&#x3002;&#x4ECE;&#x6B64;&#x4EE5;&#x540E;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x88AB;&#x53EB;&#x505A;&#x81ED;&#x866B;&#xFF08;Bug&#xFF09;<a id="id2704957" class="indexterm"></a>&#xFF0C;&#x800C;&#x627E;&#x5230;&#x8FD9;&#x4E9B;Bug&#x5E76;&#x52A0;&#x4EE5;&#x7EA0;&#x6B63;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x53EB;&#x505A;&#x8C03;&#x8BD5;&#xFF08;Debug&#xFF09;<a id="id2704965" class="indexterm"></a>&#x3002;&#x6709;&#x65F6;&#x5019;&#x8C03;&#x8BD5;&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8981;&#x6C42;&#x7A0B;&#x5E8F;&#x5458;&#x6982;&#x5FF5;&#x660E;&#x786E;&#x3001;&#x903B;&#x8F91;&#x6E05;&#x6670;&#x3001;&#x6027;&#x683C;&#x6C89;&#x7A33;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x70B9;&#x8FD0;&#x6C14;&#x3002;&#x8C03;&#x8BD5;&#x7684;&#x6280;&#x80FD;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x7EED;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x6162;&#x6162;&#x57F9;&#x517B;&#xFF0C;&#x4F46;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x533A;&#x5206;&#x6E05;&#x695A;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;Bug&#x5206;&#x4E3A;&#x54EA;&#x51E0;&#x7C7B;&#x3002;</p><div class="variablelist"><dl><dt><span class="term">&#x7F16;&#x8BD1;&#x65F6;&#x9519;&#x8BEF;</span></dt><dd><p>&#x7F16;&#x8BD1;&#x5668;&#x53EA;&#x80FD;&#x7FFB;&#x8BD1;&#x8BED;&#x6CD5;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5BFC;&#x81F4;&#x7F16;&#x8BD1;&#x5931;&#x8D25;&#xFF0C;&#x65E0;&#x6CD5;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;&#x5BF9;&#x4E8E;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x70B9;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x4E0D;&#x662F;&#x5F88;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8BFB;&#x61C2;&#x53E5;&#x5B50;&#x3002;&#x800C;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x6CA1;&#x90A3;&#x4E48;&#x5BBD;&#x5BB9;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x54EA;&#x6015;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x6761;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x7136;&#x540E;&#x7F62;&#x5DE5;&#xFF0C;&#x4F60;&#x5C31;&#x5F97;&#x4E0D;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x867D;&#x7136;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7F16;&#x8BD1;&#x5668;&#x7ED9;&#x51FA;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x4F60;&#x51FA;&#x9519;&#x7684;&#x4EE3;&#x7801;&#x884C;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x4E2A;&#x522B;&#x65F6;&#x5019;&#x7F16;&#x8BD1;&#x5668;&#x7ED9;&#x51FA;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x5E2E;&#x52A9;&#x4E0D;&#x5927;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x8BEF;&#x5BFC;&#x4F60;&#x3002;&#x5728;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7684;&#x524D;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x82B1;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x7EA0;&#x6B63;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;&#x7B49;&#x5230;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x72AF;&#x8FD9;&#x6837;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F1A;&#x5C11;&#x5F97;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x80FD;&#x66F4;&#x5FEB;&#x5730;&#x53D1;&#x73B0;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x3002;&#x7B49;&#x5230;&#x7ECF;&#x9A8C;&#x66F4;&#x4E30;&#x5BCC;&#x4E4B;&#x540E;&#x4F60;&#x5C31;&#x4F1A;&#x89C9;&#x5F97;&#xFF0C;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x662F;&#x6700;&#x7B80;&#x5355;&#x6700;&#x4F4E;&#x7EA7;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x4E5F;&#x5C31;&#x90A3;&#x4E48;&#x51E0;&#x79CD;&#xFF0C;&#x5373;&#x4F7F;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x662F;&#x6709;&#x8BEF;&#x5BFC;&#x7684;&#x4E5F;&#x80FD;&#x591F;&#x7ACB;&#x523B;&#x627E;&#x51FA;&#x771F;&#x6B63;&#x7684;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x76F8;&#x6BD4;&#x4E0B;&#x9762;&#x4E24;&#x79CD;&#x9519;&#x8BEF;&#xFF0C;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x89E3;&#x51B3;&#x8D77;&#x6765;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;</p></dd><dt><span class="term">&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;</span></dt><dd><p>&#x7F16;&#x8BD1;&#x5668;&#x68C0;&#x67E5;&#x4E0D;&#x51FA;&#x8FD9;&#x7C7B;&#x9519;&#x8BEF;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x4F1A;&#x51FA;&#x9519;&#x800C;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x7AE0;&#x5C06;&#x7F16;&#x5199;&#x7684;&#x7B80;&#x5355;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x5F88;&#x5C11;&#x89C1;&#xFF0C;&#x5230;&#x4E86;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4F60;&#x4F1A;&#x9047;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x3002;&#x8BFB;&#x8005;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x8981;&#x65F6;&#x523B;<span class="emphasis"><em>&#x6CE8;&#x610F;&#x533A;&#x5206;&#x7F16;&#x8BD1;&#x65F6;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#xFF08;Run-time&#xFF09;<a id="id2705032" class="indexterm"></a>&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;</em></span>&#xFF0C;&#x4E0D;&#x4EC5;&#x5728;&#x8C03;&#x8BD5;&#x65F6;&#x9700;&#x8981;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5728;&#x5B66;&#x4E60;C&#x8BED;&#x8A00;&#x7684;&#x5F88;&#x591A;&#x8BED;&#x6CD5;&#x65F6;&#x90FD;&#x9700;&#x8981;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x505A;&#xFF0C;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x5219;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x505A;&#x3002;</p></dd><dt><span class="term">&#x903B;&#x8F91;&#x9519;&#x8BEF;&#x548C;&#x8BED;&#x4E49;&#x9519;&#x8BEF;</span></dt><dd><p>&#x7B2C;&#x4E09;&#x7C7B;&#x9519;&#x8BEF;&#x662F;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#x548C;&#x8BED;&#x4E49;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x91CC;&#x6709;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#xFF0C;&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#x90FD;&#x4F1A;&#x5F88;&#x987A;&#x5229;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x4E5F;&#x4E0D;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x5E72;&#x5B83;&#x8BE5;&#x5E72;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x662F;&#x5E72;&#x4E86;&#x522B;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5F53;&#x7136;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53EA;&#x4F1A;&#x6309;&#x4F60;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x53BB;&#x505A;&#xFF0C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x4F60;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x662F;&#x4F60;&#x771F;&#x6B63;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7A0B;&#x5E8F;&#x7684;&#x610F;&#x601D;&#xFF08;&#x5373;&#x8BED;&#x4E49;&#xFF09;&#x662F;&#x9519;&#x7684;&#x3002;&#x627E;&#x5230;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#x5728;&#x54EA;&#x9700;&#x8981;&#x5341;&#x5206;&#x6E05;&#x9192;&#x7684;&#x5934;&#x8111;&#xFF0C;&#x8981;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x5224;&#x65AD;&#x5B83;&#x5230;&#x5E95;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x3002;</p></dd></dl></div><p>&#x901A;&#x8FC7;&#x672C;&#x4E66;&#x4F60;&#x5C06;&#x638C;&#x63E1;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6280;&#x5DE7;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x8C03;&#x8BD5;&#x3002;&#x8C03;&#x8BD5;&#x7684;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x611F;&#x5230;&#x4E00;&#x4E9B;&#x6CAE;&#x4E27;&#xFF0C;&#x4F46;&#x8C03;&#x8BD5;&#x4E5F;&#x662F;&#x7F16;&#x7A0B;&#x4E2D;&#x6700;&#x9700;&#x8981;&#x52A8;&#x8111;&#x7684;&#x3001;&#x6700;&#x6709;&#x6311;&#x6218;&#x548C;&#x4E50;&#x8DA3;&#x7684;&#x90E8;&#x5206;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x89D2;&#x5EA6;&#x770B;&#x8C03;&#x8BD5;&#x5C31;&#x50CF;&#x4FA6;&#x63A2;&#x5DE5;&#x4F5C;&#xFF0C;&#x6839;&#x636E;&#x638C;&#x63E1;&#x7684;&#x7EBF;&#x7D22;&#x6765;&#x63A8;&#x65AD;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x548C;&#x8FC7;&#x7A0B;&#x5BFC;&#x81F4;&#x4E86;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8C03;&#x8BD5;&#x4E5F;&#x50CF;&#x662F;&#x4E00;&#x95E8;&#x5B9E;&#x9A8C;&#x79D1;&#x5B66;&#xFF0C;&#x6BCF;&#x6B21;&#x60F3;&#x5230;&#x54EA;&#x91CC;&#x53EF;&#x80FD;&#x6709;&#x9519;&#xFF0C;&#x5C31;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#x7136;&#x540E;&#x518D;&#x8BD5;&#x4E00;&#x6B21;&#x3002;&#x5982;&#x679C;&#x5047;&#x8BBE;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x9884;&#x671F;&#x7684;&#x6B63;&#x786E;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x63A5;&#x7740;&#x8C03;&#x8BD5;&#x4E0B;&#x4E00;&#x4E2A;Bug&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x903C;&#x8FD1;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#xFF1B;&#x5982;&#x679C;&#x5047;&#x8BBE;&#x9519;&#x8BEF;&#xFF0C;&#x53EA;&#x597D;&#x53E6;&#x5916;&#x518D;&#x627E;&#x601D;&#x8DEF;&#x518D;&#x505A;&#x5047;&#x8BBE;&#x3002;&#x201C;<span class="quote">&#x5F53;&#x4F60;&#x628A;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x5168;&#x90E8;&#x5254;&#x9664;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x2014;&#x2014;&#x5373;&#x4F7F;&#x770B;&#x8D77;&#x6765;&#x518D;&#x600E;&#x4E48;&#x4E0D;&#x53EF;&#x80FD;&#x2014;&#x2014;&#x5C31;&#x4E00;&#x5B9A;&#x662F;&#x4E8B;&#x5B9E;&#x3002;</span>&#x201D;&#xFF08;&#x5373;&#x4F7F;&#x4F60;&#x6CA1;&#x770B;&#x8FC7;&#x798F;&#x5C14;&#x6469;&#x65AF;&#x4E5F;&#x8BE5;&#x770B;&#x8FC7;&#x67EF;&#x5357;&#x5427;&#xFF09;&#x3002;</p><p>&#x4E5F;&#x6709;&#x4E00;&#x79CD;&#x89C2;&#x70B9;&#x8BA4;&#x4E3A;&#xFF0C;&#x7F16;&#x7A0B;&#x548C;&#x8C03;&#x8BD5;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x7F16;&#x7A0B;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x9010;&#x6B65;&#x8C03;&#x8BD5;&#x76F4;&#x5230;&#x83B7;&#x5F97;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#x4E3A;&#x6B62;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x80FD;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x7684;&#x5C0F;&#x89C4;&#x6A21;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x505A;&#x4E00;&#x6B65;&#x5C0F;&#x7684;&#x6539;&#x52A8;&#x5C31;&#x7ACB;&#x523B;&#x8FDB;&#x884C;&#x8C03;&#x8BD5;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x5904;&#x662F;&#x603B;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#x505A;&#x53C2;&#x8003;&#xFF1A;&#x5982;&#x679C;&#x6B63;&#x786E;&#x5C31;&#x7EE7;&#x7EED;&#x7F16;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5B9A;&#x662F;&#x521A;&#x624D;&#x7684;&#x5C0F;&#x6539;&#x52A8;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Linux&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5305;&#x542B;&#x4E86;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x89C4;&#x5212;&#x597D;&#x4E86;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x3001;&#x8BBE;&#x5907;&#x7BA1;&#x7406;&#x3001;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x7B49;&#x7B49;&#x5927;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x5B83;&#x4EC5;&#x4EC5;&#x662F;Linus Torvalds&#x7528;&#x6765;&#x7422;&#x78E8;Intel 80386&#x82AF;&#x7247;&#x800C;&#x5199;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x3002;&#x636E;Larry Greenfield &#x8BF4;&#xFF0C;&#x201C;<span class="quote">Linus&#x7684;&#x65E9;&#x671F;&#x5DE5;&#x7A0B;&#x4E4B;&#x4E00;&#x662F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x4EA4;&#x66FF;&#x6253;&#x5370;AAAA&#x548C;BBBB&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x73A9;&#x610F;&#x513F;&#x540E;&#x6765;&#x8FDB;&#x5316;&#x6210;&#x4E86;Linux&#x3002;</span>&#x201D;&#xFF08;&#x5F15;&#x81EA;The Linux User&apos;s Guide Beta1&#x7248;&#xFF09;&#x5728;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x4F1A;&#x7ED9;&#x51FA;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x8C03;&#x8BD5;&#x548C;&#x7F16;&#x7A0B;&#x5B9E;&#x8DF5;&#x7684;&#x5EFA;&#x8BAE;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="intro.naturalformal.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="intro.helloworld.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x548C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;4.&#xA0;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;</td></tr></tbody></table></div>
</body></html>