<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;&#x8D4B;&#x503C;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch02.html" title="&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;"><link rel="prev" href="expr.variable.html" title="3.&#xA0;&#x53D8;&#x91CF;"><link rel="next" href="expr.expression.html" title="5.&#xA0;&#x8868;&#x8FBE;&#x5F0F;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;&#x8D4B;&#x503C;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="expr.variable.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="expr.expression.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2708536"></a>4.&#xA0;&#x8D4B;&#x503C;</h2></div></div></div><p>&#x5B9A;&#x4E49;&#x4E86;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x503C;&#x5B58;&#x5230;&#x5B83;&#x4EEC;&#x6240;&#x8868;&#x793A;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x91CC;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x8D4B;&#x503C;&#xFF08;Assignment&#xFF09;<a id="id2708544" class="indexterm"></a>&#x8BED;&#x53E5;&#x5B9E;&#x73B0;&#xFF1A;</p><pre class="programlisting">char firstletter;
int hour, minute;
firstletter = &apos;a&apos;;   /* give firstletter the value &apos;a&apos; */
hour = 11;           /* assign the value 11 to hour */
minute = 59;         /* set minute to 59 */</pre><p>&#x6CE8;&#x610F;&#x53D8;&#x91CF;&#x4E00;&#x5B9A;&#x8981;&#x5148;&#x58F0;&#x660E;&#x540E;&#x4F7F;&#x7528;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5FC5;&#x987B;&#x5148;&#x770B;&#x5230;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#xFF0C;&#x624D;&#x77E5;&#x9053;<code class="literal">firstletter</code>&#x3001;<code class="literal">hour</code>&#x548C;<code class="literal">minute</code>&#x662F;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x5404;&#x81EA;&#x4EE3;&#x8868;&#x4E00;&#x5757;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x8868;&#x660E;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4EE3;&#x8868;&#x591A;&#x5927;&#x7684;&#x4E00;&#x5757;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x6837;&#x7F16;&#x8BD1;&#x5668;&#x624D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x8BFB;&#x5199;&#x8FD9;&#x5757;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x7B49;&#x53F7;&#x4E0D;&#x8868;&#x793A;&#x6570;&#x5B66;&#x91CC;&#x7684;&#x76F8;&#x7B49;&#x5173;&#x7CFB;&#xFF0C;&#x548C;1+1=2&#x7684;&#x7B49;&#x53F7;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x7B49;&#x53F7;&#x8868;&#x793A;&#x8D4B;&#x503C;&#x3002;&#x5728;&#x6570;&#x5B66;&#x4E0A;&#x4E0D;&#x4F1A;&#x6709;<code class="literal">i=i+1</code>&#x8FD9;&#x79CD;&#x7B49;&#x5F0F;&#x6210;&#x7ACB;&#xFF0C;&#x800C;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x8868;&#x793A;&#x628A;&#x53D8;&#x91CF;<code class="literal">i</code>&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x503C;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;1&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x518D;&#x5B58;&#x56DE;<code class="literal">i</code>&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x6570;&#x5B66;&#x4E0A;<code class="literal">a=7</code>&#x548C;<code class="literal">7=a</code>&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x800C;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x540E;&#x8005;&#x662F;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#x3002;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x5206;&#x914D;&#x4E00;&#x5757;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5E76;&#x7ED9;&#x5B83;&#x547D;&#x540D;&#xFF1B;&#x7ED9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x4E00;&#x4E2A;&#x503C;&#x4FDD;&#x5B58;&#x5230;&#x8FD9;&#x5757;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x8D4B;&#x503C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E00;&#x6B65;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x59CB;&#x5316;&#xFF08;Initialization&#xFF09;<a id="id2707008" class="indexterm"></a>&#xFF0C;&#x4F8B;&#x5982;&#x8981;&#x8FBE;&#x5230;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x7684;&#x6548;&#x679C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p><pre class="programlisting">char firstletter = &apos;a&apos;;
int hour = 11, minute = 59;</pre><p>&#x5728;&#x521D;&#x59CB;&#x5316;&#x8BED;&#x53E5;&#x4E2D;&#xFF0C;&#x7B49;&#x53F7;&#x53F3;&#x8FB9;&#x7684;&#x503C;&#x53EB;&#x505A;Initializer<a id="id2707025" class="indexterm"></a>&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;<code class="literal">&apos;a&apos;</code>&#x3001;11&#x548C;59&#x3002;&#x6CE8;&#x610F;&#xFF0C;<span class="emphasis"><em>&#x521D;&#x59CB;&#x5316;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x58F0;&#x660E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x8D4B;&#x503C;&#x8BED;&#x53E5;</em></span>&#x3002;&#x5C31;&#x76EE;&#x524D;&#x6765;&#x770B;&#xFF0C;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x518D;&#x7ED9;&#x5B83;&#x8D4B;&#x503C;&#x548C;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x540C;&#x65F6;&#x7ED9;&#x5B83;&#x521D;&#x59CB;&#x5316;&#x6240;&#x8FBE;&#x5230;&#x7684;&#x6548;&#x679C;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;C&#x8BED;&#x8A00;&#x7684;&#x5F88;&#x591A;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x65E2;&#x9002;&#x7528;&#x4E8E;&#x8D4B;&#x503C;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4F46;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x4F60;&#x4E5F;&#x4F1A;&#x4E86;&#x89E3;&#x5230;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x8BF7;&#x5728;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#x6CE8;&#x610F;&#x603B;&#x7ED3;&#x8D4B;&#x503C;&#x548C;&#x521D;&#x59CB;&#x5316;&#x7684;&#x76F8;&#x540C;&#x548C;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x3002;</p><p>&#x5982;&#x679C;&#x5728;&#x7EB8;&#x4E0A;&#x201C;<span class="quote">&#x8DD1;</span>&#x201D;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF08;&#x6BCF;&#x4E2A;&#x521D;&#x5B66;&#x7F16;&#x7A0B;&#x7684;&#x4EBA;&#x90FD;&#x8981;&#x7EC3;&#x8FD9;&#x9879;&#x57FA;&#x672C;&#x529F;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x6846;&#x8868;&#x793A;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x6846;&#x7684;&#x5916;&#x8FB9;&#x6807;&#x4E0A;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x5728;&#x6846;&#x91CC;&#x8BB0;&#x4E0A;&#x5B83;&#x7684;&#x503C;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2707065"></a><p class="title"><b>&#x56FE;&#xA0;2.1.&#xA0;&#x5728;&#x7EB8;&#x4E0A;&#x8868;&#x793A;&#x53D8;&#x91CF;</b></p><div class="figure-contents"><div><img src="images/expr.variable.png" alt="&#x5728;&#x7EB8;&#x4E0A;&#x8868;&#x793A;&#x53D8;&#x91CF;"></div></div></div><br class="figure-break"><p>&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x5F62;&#x72B6;&#x7684;&#x6846;&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x63D0;&#x9192;&#x4F60;&#x7ED9;&#x53D8;&#x91CF;&#x8D4B;&#x7684;&#x503C;&#x5FC5;&#x987B;&#x7B26;&#x5408;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x6240;&#x8D4B;&#x7684;&#x503C;&#x548C;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x7B26;&#x4F1A;&#x5BFC;&#x81F4;&#x7F16;&#x8BD1;&#x5668;&#x62A5;&#x8B66;&#x544A;&#x6216;&#x62A5;&#x9519;&#xFF08;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x8BED;&#x4E49;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int hour, minute;
hour = &quot;Hello.&quot;;       /* WRONG ! */
minute = &quot;59&quot;;         /* WRONG !! */</pre><p>&#x6CE8;&#x610F;&#x7B2C;3&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x628A;<code class="literal">&quot;59&quot;</code>&#x8D4B;&#x7ED9;<code class="literal">minute</code>&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7C7B;&#x578B;&#x4E0D;&#x5BF9;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x4E0D;&#x80FD;&#x8D4B;&#x7ED9;&#x6574;&#x578B;&#x53D8;&#x91CF;&#x3002;</p><p>&#x65E2;&#x7136;&#x53EF;&#x4EE5;&#x4E3A;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x8D4B;&#x503C;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x628A;&#x503C;&#x53D6;&#x51FA;&#x6765;&#x7528;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53D6;&#x51FA;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x7528;<code class="literal">printf</code>&#x6253;&#x5370;&#xFF1A;</p><pre class="programlisting">printf(&quot;Current time is %d:%d&quot;, hour, minute);</pre><p>&#x53D8;&#x91CF;&#x540D;&#x7528;&#x5728;&#x7B49;&#x53F7;&#x5DE6;&#x8FB9;&#x8868;&#x793A;&#x8D4B;&#x503C;&#xFF0C;&#x800C;&#x7528;&#x5728;<code class="literal">printf</code>&#x4E2D;&#x8868;&#x793A;&#x628A;&#x5B83;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x503C;&#x53D6;&#x51FA;&#x6765;&#x66FF;&#x6362;&#x5728;&#x90A3;&#x91CC;&#x3002;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x6240;&#x5360;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x6570;&#x636E;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x6700;&#x5C0F;&#x5B58;&#x50A8;&#x5355;&#x4F4D;&#x662F;&#x5B57;&#x8282;&#xFF08;Byte&#xFF09;<a id="id2708898" class="indexterm"></a>&#xFF0C;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;<code class="literal">char</code>&#x578B;&#x53D8;&#x91CF;&#x5360;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x5360;&#x591A;&#x5C11;&#x5B57;&#x8282;&#x5728;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x4E0A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x89C4;&#x5B9A;&#xFF0C;&#x5C06;&#x5728;<a class="xref" href="ch15.html#type">&#x7B2C;&#xA0;15&#xA0;&#x7AE0; <i>&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;</i></a>&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="expr.variable.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch02.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="expr.expression.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;&#x53D8;&#x91CF;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;5.&#xA0;&#x8868;&#x8FBE;&#x5F0F;</td></tr></tbody></table></div>
</body></html>