<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x4F5C;&#x7528;&#x57DF;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch03.html" title="&#x7B2C;&#xA0;3&#xA0;&#x7AE0;&#xA0;&#x7B80;&#x5355;&#x51FD;&#x6570;"><link rel="prev" href="ch03s03.html" title="3.&#xA0;&#x5F62;&#x53C2;&#x548C;&#x5B9E;&#x53C2;"><link rel="next" href="ch04.html" title="&#x7B2C;&#xA0;4&#xA0;&#x7AE0;&#xA0;&#x5206;&#x652F;&#x8BED;&#x53E5;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x4F5C;&#x7528;&#x57DF;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch03s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;3&#xA0;&#x7AE0;&#xA0;&#x7B80;&#x5355;&#x51FD;&#x6570;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2714471"></a>4.&#xA0;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x4F5C;&#x7528;&#x57DF;</h2></div></div></div><p>&#x6211;&#x4EEC;&#x628A;&#x51FD;&#x6570;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x79F0;&#x4E3A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF08;Local Variable&#xFF09;<a id="id2714481" class="indexterm"></a>&#xFF0C;&#x7531;&#x4E8E;&#x5F62;&#x53C2;&#x76F8;&#x5F53;&#x4E8E;&#x51FD;&#x6570;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x5F62;&#x53C2;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x201C;<span class="quote">&#x5C40;&#x90E8;</span>&#x201D;&#x6709;&#x4E24;&#x5C42;&#x542B;&#x4E49;&#xFF1A;</p><p>1&#x3001;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x4E0D;&#x80FD;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x3002;&#x4F8B;&#x5982;<code class="literal">print_time</code>&#x4E2D;&#x7684;<code class="literal">hour</code>&#x548C;<code class="literal">minute</code>&#x5728;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#xFF0C;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#xFF0C;&#x540C;&#x6837;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E5F;&#x4E0D;&#x80FD;&#x88AB;<code class="literal">print_time</code>&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#xFF1A;</p><pre class="programlisting">void print_time(int hour, int minute)
{
	printf(&quot;%d:%d\n&quot;, hour, minute);
}

int main(void)
{
	int hour = 23, minute = 59;
	print_time(hour, minute);
	return 0;
}</pre><p><code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x5C40;&#x90E8;&#x53D8;&#x91CF;<code class="literal">hour</code>&#xFF0C;<code class="literal">print_time</code>&#x51FD;&#x6570;&#x4E2D;&#x4E5F;&#x6709;&#x53C2;&#x6570;<code class="literal">hour</code>&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x4EEC;&#x540D;&#x79F0;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4EE3;&#x8868;&#x4E0D;&#x540C;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x3002;<code class="literal">main</code>&#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;<code class="literal">minute</code>&#x548C;<code class="literal">print_time</code>&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;<code class="literal">minute</code>&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</p><p>2&#x3001;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x90FD;&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x91CA;&#x653E;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4F8B;&#x5982;&#x8C03;&#x7528;<code class="literal">print_time(23, 59)</code>&#x65F6;&#x5206;&#x914D;<code class="literal">hour</code>&#x548C;<code class="literal">minute</code>&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x5206;&#x522B;&#x5B58;&#x4E0A;23&#x548C;59&#xFF0C;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x91CA;&#x653E;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4E0B;&#x6B21;&#x518D;&#x8C03;&#x7528;<code class="literal">print_time(12, 20)</code>&#x65F6;&#x53C8;&#x5206;&#x914D;<code class="literal">hour</code>&#x548C;<code class="literal">minute</code>&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x5206;&#x522B;&#x5B58;&#x4E0A;12&#x548C;20&#x3002;</p><p>&#x4E0E;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x6982;&#x5FF5;&#x76F8;&#x5BF9;&#x7684;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF08;Global Variable&#xFF09;<a id="id2714634" class="indexterm"></a>&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x5728;&#x6240;&#x6709;&#x7684;&#x51FD;&#x6570;&#x4F53;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x65F6;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x7ED3;&#x675F;&#x65F6;&#x91CA;&#x653E;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><div class="example"><a id="id2714644"></a><p class="title"><b>&#x4F8B;&#xA0;3.5.&#xA0;&#x5168;&#x5C40;&#x53D8;&#x91CF;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

int hour = 23, minute = 59;

void print_time(void)
{
	printf(&quot;%d:%d in print_time\n&quot;, hour, minute);
}

int main(void)
{
	print_time();
	printf(&quot;%d:%d in main\n&quot;, hour, minute);
	return 0;
}</pre></div></div><br class="example-break"><p>&#x6B63;&#x56E0;&#x4E3A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5728;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x88AB;&#x8BFB;&#x5199;&#x7684;&#x987A;&#x5E8F;&#x4ECE;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x662F;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x4E66;&#x5199;&#x987A;&#x5E8F;&#x5E76;&#x4E0D;&#x80FD;&#x53CD;&#x6620;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x987A;&#x5E8F;&#x3002;&#x7A0B;&#x5E8F;&#x51FA;&#x73B0;&#x4E86;Bug&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x67D0;&#x4E2A;&#x4E0D;&#x8D77;&#x773C;&#x7684;&#x5730;&#x65B9;&#x5BF9;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x5199;&#x987A;&#x5E8F;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x89C4;&#x6A21;&#x5F88;&#x5927;&#xFF0C;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x662F;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x7684;&#x3002;&#x800C;&#x5BF9;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x4E0D;&#x4EC5;&#x5C40;&#x9650;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;&#x800C;&#x4E14;&#x5C40;&#x9650;&#x5728;&#x4E00;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E4B;&#x4E2D;&#xFF0C;&#x4ECE;&#x51FD;&#x6570;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x5F88;&#x5BB9;&#x6613;&#x770B;&#x51FA;&#x8BBF;&#x95EE;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x627E;&#x5230;Bug&#x3002;&#x56E0;&#x6B64;&#xFF0C;<span class="emphasis"><em>&#x867D;&#x7136;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7528;&#x8D77;&#x6765;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x4E00;&#x5B9A;&#x8981;&#x614E;&#x7528;&#xFF0C;&#x80FD;&#x7528;&#x51FD;&#x6570;&#x4F20;&#x53C2;&#x4EE3;&#x66FF;&#x7684;&#x5C31;&#x4E0D;&#x8981;&#x7528;&#x5168;&#x5C40;&#x53D8;&#x91CF;</em></span>&#x3002;</p><p>&#x5982;&#x679C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x91CD;&#x540D;&#x4E86;&#x4F1A;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6539;&#x4E3A;&#xFF1A;</p><div class="example"><a id="id2714690"></a><p class="title"><b>&#x4F8B;&#xA0;3.6.&#xA0;&#x4F5C;&#x7528;&#x57DF;</b></p><div class="example-contents"><div><img src="images/func.scope.png"></div></div></div><br class="example-break"><p>&#x5219;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;<code class="literal">print_time</code>&#x6253;&#x5370;&#x7684;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x76F4;&#x63A5;&#x8C03;&#x7528;<code class="literal">printf</code>&#x6253;&#x5370;&#x7684;&#x5219;&#x662F;<code class="literal">main</code>&#x51FD;&#x6570;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x3002;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x6BCF;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x90FD;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x662F;&#x5B9A;&#x4E49;&#x5728;&#x6240;&#x6709;&#x51FD;&#x6570;&#x4F53;&#x4E4B;&#x5916;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4ECE;&#x5B9A;&#x4E49;&#x7684;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x76F4;&#x5230;&#x6E90;&#x6587;&#x4EF6;&#x7ED3;&#x675F;&#xFF0C;&#x800C;<code class="literal">main</code>&#x51FD;&#x6570;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4EC5;&#x9650;&#x4E8E;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E4B;&#x4E2D;&#x3002;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x8BBE;&#x60F3;&#x6574;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x5F20;&#x5927;&#x7EB8;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x800C;<code class="literal">main</code>&#x51FD;&#x6570;&#x662F;&#x76D6;&#x5728;&#x8FD9;&#x5F20;&#x5927;&#x7EB8;&#x4E0A;&#x7684;&#x4E00;&#x5F20;&#x5C0F;&#x7EB8;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<code class="literal">main</code>&#x51FD;&#x6570;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x5728;&#x5C0F;&#x7EB8;&#x4E0A;&#x7528;&#x5230;&#x6807;&#x8BC6;&#x7B26;<code class="literal">hour</code>&#x548C;<code class="literal">minute</code>&#x65F6;&#x5E94;&#x8BE5;&#x53C2;&#x8003;&#x5C0F;&#x7EB8;&#x4E0A;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x7EB8;&#xFF08;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF09;&#x88AB;&#x76D6;&#x4F4F;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5C0F;&#x7EB8;&#x4E0A;&#x7528;&#x5230;&#x67D0;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x5374;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x90A3;&#x4E48;&#x518D;&#x53BB;&#x7FFB;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x5927;&#x7EB8;&#x4E0A;&#x6709;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;&#x7684;&#x53D8;&#x91CF;<code class="literal">x</code>&#x3002;</p><p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x5728;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#x90FD;&#x662F;&#x7528;&#x5E38;&#x91CF;&#x505A;Initializer&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x505A;Initializer&#xFF0C;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF1A;<span class="emphasis"><em>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x7528;&#x7C7B;&#x578B;&#x76F8;&#x7B26;&#x7684;&#x4EFB;&#x610F;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x800C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x7528;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;Constant Expression&#xFF09;<a id="id2714780" class="indexterm"></a>&#x521D;&#x59CB;&#x5316;</em></span>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;<code class="literal">pi</code>&#x8FD9;&#x6837;&#x521D;&#x59CB;&#x5316;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF1A;</p><pre class="programlisting">double pi = 3.14 + 0.0016;</pre><p>&#x4F46;&#x8FD9;&#x6837;&#x521D;&#x59CB;&#x5316;&#x662F;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#xFF1A;</p><pre class="programlisting">double pi = acos(-1.0);</pre><p>&#x7136;&#x800C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8FD9;&#x6837;&#x521D;&#x59CB;&#x5316;&#x5374;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x65F6;&#x8981;&#x7528;&#x9002;&#x5F53;&#x7684;&#x503C;&#x6765;&#x521D;&#x59CB;&#x5316;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x521D;&#x59CB;&#x503C;&#x5FC5;&#x987B;&#x4FDD;&#x5B58;&#x5728;&#x7F16;&#x8BD1;&#x751F;&#x6210;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x521D;&#x59CB;&#x503C;&#x5728;<span class="emphasis"><em>&#x7F16;&#x8BD1;&#x65F6;</em></span>&#x5C31;&#x8981;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x800C;&#x4E0A;&#x9762;&#x7B2C;&#x4E8C;&#x79CD;Initializer&#x7684;&#x503C;&#x5FC5;&#x987B;&#x5728;&#x7A0B;&#x5E8F;<span class="emphasis"><em>&#x8FD0;&#x884C;&#x65F6;</em></span>&#x8C03;&#x7528;<code class="literal">acos</code>&#x51FD;&#x6570;&#x624D;&#x80FD;&#x5F97;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x521D;&#x59CB;&#x5316;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#x533A;&#x5206;&#x7F16;&#x8BD1;&#x65F6;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;C&#x8BED;&#x8A00;&#x4ECE;&#x8BED;&#x6CD5;&#x4E0A;&#x89C4;&#x5B9A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x7528;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x56E0;&#x6B64;&#x4E0B;&#x9762;&#x8FD9;&#x79CD;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x521D;&#x59CB;&#x5316;&#x662F;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#xFF1A;</p><pre class="programlisting">int minute = 360;
int hour = minute / 60;</pre><p>&#x867D;&#x7136;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x8BA1;&#x7B97;&#x51FA;<code class="literal">hour</code>&#x7684;&#x521D;&#x59CB;&#x503C;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x662F;<code class="literal">minute / 60</code>&#x4E0D;&#x662F;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x8BED;&#x6CD5;&#x89C4;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x5FC5;&#x60F3;&#x529E;&#x6CD5;&#x53BB;&#x7B97;&#x8FD9;&#x4E2A;&#x521D;&#x59CB;&#x503C;&#x3002;</p><p>&#x5982;&#x679C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x4E0D;&#x521D;&#x59CB;&#x5316;&#x5219;&#x521D;&#x59CB;&#x503C;&#x662F;0&#xFF0C;&#x5982;&#x679C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x4E0D;&#x521D;&#x59CB;&#x5316;&#x5219;&#x521D;&#x59CB;&#x503C;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;<span class="emphasis"><em>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x4E00;&#x5B9A;&#x8981;&#x5148;&#x8D4B;&#x503C;</em></span>&#xFF0C;&#x5982;&#x679C;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x503C;&#x505A;&#x540E;&#x7EED;&#x8BA1;&#x7B97;&#x80AF;&#x5B9A;&#x4F1A;&#x5F15;&#x5165;Bug&#x3002;</p><p>&#x5982;&#x4F55;&#x8BC1;&#x660E;&#x201C;<span class="quote">&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5728;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x5206;&#x914D;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x91CA;&#x653E;</span>&#x201D;&#xFF1F;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x786E;&#x8BA4;&#x67D0;&#x4E9B;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x67E5;&#x6559;&#x6750;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x67E5;C99&#xFF0C;&#x4F46;&#x6700;&#x5FEB;&#x6377;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x7F16;&#x4E2A;&#x5C0F;&#x7A0B;&#x5E8F;&#x9A8C;&#x8BC1;&#x4E00;&#x4E0B;&#xFF1A;</p><div class="example"><a id="id2714872"></a><p class="title"><b>&#x4F8B;&#xA0;3.7.&#xA0;&#x9A8C;&#x8BC1;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

void foo(void)
{
	int i;
	printf(&quot;%d\n&quot;, i);
	i = 777;
}

int main(void)
{
	foo();
	foo();
	return 0;
}</pre></div></div><br class="example-break"><p>&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;<code class="literal">foo</code>&#x51FD;&#x6570;&#xFF0C;&#x5206;&#x914D;&#x53D8;&#x91CF;<code class="literal">i</code>&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x6253;&#x5370;<code class="literal">i</code>&#x7684;&#x503C;&#xFF0C;&#x7531;&#x4E8E;<code class="literal">i</code>&#x672A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x6253;&#x5370;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x628A;<code class="literal">i</code>&#x8D4B;&#x503C;&#x4E3A;777&#xFF0C;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#xFF0C;&#x91CA;&#x653E;<code class="literal">i</code>&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;<code class="literal">foo</code>&#x51FD;&#x6570;&#xFF0C;&#x5206;&#x914D;&#x53D8;&#x91CF;<code class="literal">i</code>&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x6253;&#x5370;<code class="literal">i</code>&#x7684;&#x503C;&#xFF0C;&#x7531;&#x4E8E;<code class="literal">i</code>&#x672A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x6253;&#x5370;&#x7684;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x5C31;&#x8BC1;&#x660E;&#x4E86;&#x201C;<span class="quote">&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5728;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x5206;&#x914D;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x91CA;&#x653E;</span>&#x201D;&#x3002;&#x5206;&#x6790;&#x5B8C;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x50CF;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x7684;&#x8FD9;&#x6837;&#xFF1A;</p><pre class="screen">134518128
777</pre><p>&#x7ED3;&#x679C;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;&#x6253;&#x5370;&#x7684;<code class="literal">i</code>&#x503C;&#x6B63;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;&#x672B;&#x5C3E;&#x8D4B;&#x7ED9;<code class="literal">i</code>&#x7684;&#x503C;777&#x3002;&#x6709;&#x4E00;&#x79CD;&#x521D;&#x5B66;&#x8005;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x539F;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x628A;&#x8FD9;&#x6761;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x8BB0;&#x7262;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8BB0;&#x5FC6;&#x529B;&#x6CA1;&#x4FE1;&#x5FC3;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x60F3;&#xFF1A;&#x54E6;&#x90A3;&#x80AF;&#x5B9A;&#x662F;&#x6211;&#x8BB0;&#x9519;&#x4E86;&#xFF0C;&#x6539;&#x8FC7;&#x6765;&#x8BB0;&#x5427;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x201C;<span class="quote">&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5177;&#x6709;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x7684;&#x56FA;&#x5B9A;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x8FD4;&#x56DE;&#x65F6;&#x4E5F;&#x4E0D;&#x91CA;&#x653E;&#xFF0C;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x5B83;&#x5E94;&#x8BE5;&#x8FD8;&#x80FD;&#x4FDD;&#x6301;&#x4E0A;&#x6B21;&#x7684;&#x503C;</span>&#x201D;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x521D;&#x5B66;&#x8005;&#x662F;&#x6000;&#x7591;&#x8BBA;&#x8005;&#x6216;&#x4E0D;&#x53EF;&#x77E5;&#x8BBA;&#x8005;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x60F3;&#xFF1A;&#x6559;&#x6750;&#x4E0A;&#x660E;&#x660E;&#x8BF4;&#x201C;<span class="quote">&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5728;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x5206;&#x914D;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x91CA;&#x653E;</span>&#x201D;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x6559;&#x6750;&#x5199;&#x9519;&#x4E86;&#xFF0C;&#x6559;&#x6750;&#x4E5F;&#x662F;&#x4EBA;&#x5199;&#x7684;&#xFF0C;&#x662F;&#x4EBA;&#x5199;&#x7684;&#x5C31;&#x96BE;&#x514D;&#x51FA;&#x9519;&#xFF0C;&#x54E6;&#xFF0C;&#x8FDE;C99&#x4E5F;&#x8FD9;&#x4E48;&#x5199;&#x7684;&#x554A;&#xFF0C;C99&#x4E5F;&#x662F;&#x4EBA;&#x5199;&#x7684;&#xFF0C;&#x4E5F;&#x96BE;&#x514D;&#x51FA;&#x9519;&#xFF0C;&#x6216;&#x8005;C99&#x4E5F;&#x8BB8;&#x6CA1;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x53CD;&#x6B63;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x9519;&#x4E86;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x4E1C;&#x897F;&#x771F;&#x9760;&#x4E0D;&#x4F4F;&#xFF0C;&#x592A;&#x5BB9;&#x6613;&#x53D7;&#x7535;&#x78C1;&#x5E72;&#x6270;&#x548C;&#x5B87;&#x5B99;&#x5C04;&#x7EBF;&#x5F71;&#x54CD;&#x4E86;&#xFF0C;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x5199;&#x5F97;&#x518D;&#x6B63;&#x786E;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x5E72;&#x6270;&#x5F97;&#x4E0D;&#x80FD;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x3002;</p><p>&#x8FD9;&#x662F;&#x521D;&#x5B66;&#x8005;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4E24;&#x79CD;&#x5FC3;&#x6001;&#x3002;&#x4E0D;&#x4ECE;&#x5BA2;&#x89C2;&#x4E8B;&#x5B9E;&#x548C;&#x903B;&#x8F91;&#x63A8;&#x7406;&#x51FA;&#x53D1;&#x5206;&#x6790;&#x95EE;&#x9898;&#x7684;&#x771F;&#x6B63;&#x539F;&#x56E0;&#xFF0C;&#x800C;&#x4EC5;&#x51ED;&#x4E3B;&#x89C2;&#x81C6;&#x65AD;&#x80E1;&#x4E71;&#x7ED9;&#x95EE;&#x9898;&#x5B9A;&#x6027;&#xFF0C;&#x201C;<span class="quote">&#x8BF4;&#x4F60;&#x6709;&#x7F6A;&#x4F60;&#x5C31;&#x6709;&#x7F6A;</span>&#x201D;&#x3002;&#x5148;&#x4E0D;&#x8981;&#x80E1;&#x4E71;&#x6000;&#x7591;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x505A;&#x4E00;&#x6B21;&#x5B9E;&#x9A8C;&#xFF0C;&#x5728;&#x4E24;&#x6B21;<code class="literal">foo</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E4B;&#x95F4;&#x63D2;&#x4E00;&#x4E2A;&#x522B;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x5927;&#x4E0D;&#x76F8;&#x540C;&#x4E86;&#xFF1A;</p><pre class="programlisting">int main(void)
{
	foo();
	printf(&quot;hello\n&quot;);
	foo();
	return 0;
}</pre><p>&#x7ED3;&#x679C;&#x662F;&#xFF1A;</p><pre class="screen">134518200
hello
0</pre><p>&#x8FD9;&#x4E00;&#x56DE;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;<code class="literal">foo</code>&#x6253;&#x5370;&#x7684;<code class="literal">i</code>&#x503C;&#x53C8;&#x4E0D;&#x662F;777&#x4E86;&#x800C;&#x662F;0&#xFF0C;&#x201C;<span class="quote">&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5728;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x5206;&#x914D;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x91CA;&#x653E;</span>&#x201D;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#x4F3C;&#x4E4E;&#x5BF9;&#x4E86;&#xFF0C;&#x4F46;&#x53E6;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#x53C8;&#x4E0D;&#x5BF9;&#x4E86;&#xFF1A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E0D;&#x521D;&#x59CB;&#x5316;&#x624D;&#x662F;0&#x554A;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x201C;<span class="quote">&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E0D;&#x521D;&#x59CB;&#x5316;&#x5219;&#x521D;&#x503C;&#x4E0D;&#x786E;&#x5B9A;</span>&#x201D;&#x5417;&#xFF1F;</p><p>&#x5173;&#x952E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6211;&#x8BF4;&#x201C;<span class="quote">&#x521D;&#x503C;&#x4E0D;&#x786E;&#x5B9A;</span>&#x201D;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x503C;&#x4E0D;&#x80FD;&#x662F;0&#xFF1F;&#x6709;&#x6CA1;&#x6709;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x503C;&#x4E0D;&#x80FD;&#x662F;&#x4E0A;&#x6B21;&#x8C03;&#x7528;&#x8D4B;&#x7684;&#x503C;&#xFF1F;&#x5728;&#x8FD9;&#x91CC;&#x201C;<span class="quote">&#x4E0D;&#x786E;&#x5B9A;</span>&#x201D;&#x7684;&#x51C6;&#x786E;&#x542B;&#x4E49;&#x662F;&#xFF1A;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x65F6;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x503C;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E0D;&#x540C;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x6B21;&#x5E8F;&#x4E0D;&#x540C;&#xFF0C;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x503C;&#x3002;&#x5728;&#x8FD0;&#x7528;&#x903B;&#x8F91;&#x63A8;&#x7406;&#x65F6;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#xFF0C;<span class="emphasis"><em>&#x4E0D;&#x8981;&#x628A;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF08;Necessary Condition&#xFF09;<a id="id2715069" class="indexterm"></a>&#x5F53;&#x5145;&#x5206;&#x6761;&#x4EF6;&#xFF08;Sufficient Condition&#xFF09;<a id="id2715076" class="indexterm"></a></em></span>&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5728;Debug&#x65F6;&#x5C24;&#x5176;&#x91CD;&#x8981;&#xFF0C;&#x770B;&#x5230;&#x9519;&#x8BEF;&#x73B0;&#x8C61;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x65AD;&#x5B9A;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8003;&#x8651;&#x518D;&#x4E09;&#xFF0C;&#x627E;&#x51FA;&#x5B83;&#x7684;&#x771F;&#x6B63;&#x539F;&#x56E0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x8981;&#x770B;&#x5230;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;&#x6253;&#x5370;777&#x5C31;&#x4E0B;&#x7ED3;&#x8BBA;&#x201C;<span class="quote">&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5177;&#x6709;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x7684;&#x56FA;&#x5B9A;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x8FD4;&#x56DE;&#x65F6;&#x4E5F;&#x4E0D;&#x91CA;&#x653E;&#xFF0C;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x5B83;&#x5E94;&#x8BE5;&#x8FD8;&#x80FD;&#x4FDD;&#x6301;&#x4E0A;&#x6B21;&#x7684;&#x503C;</span>&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#x5012;&#x662F;&#x80FD;&#x63A8;&#x51FA;777&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x53CD;&#x8FC7;&#x6765;&#x7531;777&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x5374;&#x4E0D;&#x80FD;&#x63A8;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x8BBA;&#x3002;&#x6240;&#x4EE5;&#x8BF4;777&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x662F;&#x8BE5;&#x7ED3;&#x8BBA;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5145;&#x5206;&#x6761;&#x4EF6;&#x3002;&#x4E5F;&#x4E0D;&#x8981;&#x770B;&#x5230;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;&#x6253;&#x5370;0&#x5C31;&#x65AD;&#x5B9A;&#x201C;<span class="quote">&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x672A;&#x521D;&#x59CB;&#x5316;&#x5219;&#x521D;&#x503C;&#x4E3A;0</span>&#x201D;&#xFF0C;0&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x662F;&#x8BE5;&#x7ED3;&#x8BBA;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x5145;&#x5206;&#x6761;&#x4EF6;&#x3002;&#x81F3;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x8FD9;&#x4E9B;&#x73B0;&#x8C61;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x503C;&#x521A;&#x597D;&#x662F;777&#xFF0C;&#x6216;&#x8005;&#x521A;&#x597D;&#x662F;0&#xFF0C;&#x7B49;&#x5B66;&#x5230;<a class="xref" href="ch19s01.html#asmc.func">&#x4F8B;&#xA0;19.1 &#x201C;&#x7814;&#x7A76;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x201D;</a>&#x5C31;&#x80FD;&#x89E3;&#x91CA;&#x8FD9;&#x4E9B;&#x73B0;&#x8C61;&#x4E86;&#x3002;</p><p>&#x4ECE;<a class="xref" href="ch03s02.html#func.ourfirstfunc">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x201D;</a>&#x4ECB;&#x7ECD;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x975E;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x5728;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int main(void)
{
	void print_time(int, int);
	print_time(23, 59);
	return 0;
}</pre><p>&#x8FD9;&#x6837;&#x58F0;&#x660E;&#x7684;&#x6807;&#x8BC6;&#x7B26;<code class="literal">print_time</code>&#x5177;&#x6709;&#x5C40;&#x90E8;&#x4F5C;&#x57DF;&#xFF0C;&#x53EA;&#x5728;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x662F;&#x6709;&#x6548;&#x7684;&#x51FD;&#x6570;&#x540D;&#xFF0C;&#x51FA;&#x4E86;<code class="literal">main</code>&#x51FD;&#x6570;&#x5C31;&#x4E0D;&#x5B58;&#x5728;<code class="literal">print_time</code>&#x8FD9;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x4E86;&#x3002;</p><p>&#x5199;&#x975E;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x65F6;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x53EA;&#x5199;&#x7C7B;&#x578B;&#x800C;&#x4E0D;&#x8D77;&#x540D;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#x7684;<code class="literal">void print_time(int, int);</code>&#xFF0C;&#x53EA;&#x8981;&#x544A;&#x8BC9;&#x7F16;&#x8BD1;&#x5668;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x80FD;&#x4E3A;<code class="literal">print_time(23, 59)</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x751F;&#x6210;&#x6B63;&#x786E;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x53E6;&#x5916;&#x6CE8;&#x610F;&#xFF0C;&#x867D;&#x7136;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5B9A;&#x4E49;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;C&#x8BED;&#x8A00;&#x4E0D;&#x5141;&#x8BB8;&#x5D4C;&#x5957;&#x5B9A;&#x4E49;&#x51FD;&#x6570;<sup>[<a id="id2715167" href="#ftn.id2715167" class="footnote">5</a>]</sup>&#x3002;</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2715167" href="#id2715167" class="para">5</a>] </sup>&#x4F46;<code class="literal">gcc</code>&#x7684;&#x6269;&#x5C55;&#x7279;&#x6027;&#x5141;&#x8BB8;&#x5D4C;&#x5957;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xFF0C;&#x672C;&#x4E66;&#x4E0D;&#x505A;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch03s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch03.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;&#x5F62;&#x53C2;&#x548C;&#x5B9E;&#x53C2;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;4&#xA0;&#x7AE0;&#xA0;&#x5206;&#x652F;&#x8BED;&#x53E5;</td></tr></tbody></table></div>
</body></html>