<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x5F62;&#x53C2;&#x548C;&#x5B9E;&#x53C2;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch03.html" title="&#x7B2C;&#xA0;3&#xA0;&#x7AE0;&#xA0;&#x7B80;&#x5355;&#x51FD;&#x6570;"><link rel="prev" href="ch03s02.html" title="2.&#xA0;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;"><link rel="next" href="ch03s04.html" title="4.&#xA0;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x4F5C;&#x7528;&#x57DF;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x5F62;&#x53C2;&#x548C;&#x5B9E;&#x53C2;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch03s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;3&#xA0;&#x7AE0;&#xA0;&#x7B80;&#x5355;&#x51FD;&#x6570;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch03s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2713785"></a>3.&#xA0;&#x5F62;&#x53C2;&#x548C;&#x5B9E;&#x53C2;</h2></div></div></div><p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5E26;&#x53C2;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x6307;&#x660E;&#x53C2;&#x6570;&#x7684;&#x4E2A;&#x6570;&#x548C;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5B9A;&#x4E49;&#x53C2;&#x6570;&#x5C31;&#x50CF;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x4E00;&#x6837;&#xFF0C;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x660E;&#x7C7B;&#x578B;&#xFF0C;&#x53C2;&#x6570;&#x7684;&#x547D;&#x540D;&#x4E5F;&#x8981;&#x9075;&#x5FAA;&#x6807;&#x8BC6;&#x7B26;&#x547D;&#x540D;&#x89C4;&#x5219;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><div class="example"><a id="id2713799"></a><p class="title"><b>&#x4F8B;&#xA0;3.4.&#xA0;&#x5E26;&#x53C2;&#x6570;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

void print_time(int hour, int minute)
{
	printf(&quot;%d:%d\n&quot;, hour, minute);
}

int main(void)
{
	print_time(23, 59);
	return 0;
}</pre></div></div><br class="example-break"><p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x65F6;&#x53EF;&#x4EE5;&#x628A;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x5217;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x800C;&#x5B9A;&#x4E49;&#x53C2;&#x6570;&#x5374;&#x4E0D;&#x53EF;&#x4EE5;&#xFF0C;&#x4F8B;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x9519;&#x7684;&#xFF1A;</p><pre class="programlisting">void print_time(int hour, minute)
{
	printf(&quot;%d:%d\n&quot;, hour, minute);
}</pre><p>&#x5B66;&#x4E60;C&#x8BED;&#x8A00;&#x7684;&#x4EBA;&#x80AF;&#x5B9A;&#x90FD;&#x4E50;&#x610F;&#x770B;&#x5230;&#x8FD9;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;<span class="quote">&#x53D8;&#x91CF;&#x662F;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x53C2;&#x6570;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x4E00;&#x6A21;&#x4E00;&#x6837;</span>&#x201D;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x7528;&#x4E13;&#x95E8;&#x53BB;&#x8BB0;&#x4F4F;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5B9A;&#x4E49;&#x4E86;&#x3002;&#x8C01;&#x4E5F;&#x4E0D;&#x613F;&#x610F;&#x770B;&#x5230;&#x8FD9;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;<span class="quote">&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#xFF0C;&#x800C;&#x5B9A;&#x4E49;&#x53C2;&#x6570;&#x5374;&#x4E0D;&#x53EF;&#x4EE5;</span>&#x201D;&#x3002;C&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x4E5F;&#x4E0D;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x8BBE;&#x8BA1;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x91CC;&#x5230;&#x5904;&#x90FD;&#x662F;&#x4F8B;&#x5916;&#xFF0C;&#x4E00;&#x4E2A;&#x5BB9;&#x6613;&#x88AB;&#x7528;&#x6237;&#x63A5;&#x53D7;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x9075;&#x5FAA;&#x6700;&#x5C11;&#x4F8B;&#x5916;&#x539F;&#x5219;&#xFF08;Rule of Least Surprise&#xFF09;<a id="id2713837" class="indexterm"></a>&#x3002;&#x5176;&#x5B9E;&#x5173;&#x4E8E;&#x53C2;&#x6570;&#x7684;&#x8FD9;&#x6761;&#x89C4;&#x5B9A;&#x4E5F;&#x4E0D;&#x7B97;&#x5341;&#x5206;&#x4F8B;&#x5916;&#xFF0C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x8BF7;&#x8BFB;&#x8005;&#x60F3;&#x60F3;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E48;&#x89C4;&#x5B9A;&#x3002;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0D;&#x5E94;&#x8BE5;&#x6B7B;&#x8BB0;&#x5404;&#x79CD;&#x8BED;&#x6CD5;&#x89C4;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x591F;&#x60F3;&#x6E05;&#x695A;&#x8BBE;&#x8BA1;&#x8005;&#x8FD9;&#x4E48;&#x89C4;&#x5B9A;&#x7684;&#x539F;&#x56E0;&#xFF08;Rationale&#xFF09;<a id="id2713847" class="indexterm"></a>&#xFF0C;&#x4E0D;&#x4EC5;&#x6709;&#x52A9;&#x4E8E;&#x8BB0;&#x5FC6;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x6536;&#x83B7;&#x3002;&#x672C;&#x4E66;&#x5728;&#x5FC5;&#x8981;&#x7684;&#x5730;&#x65B9;&#x4F1A;&#x89E3;&#x91CA;&#x4E00;&#x4E9B;Rationale&#xFF0C;&#x6216;&#x8005;&#x542F;&#x53D1;&#x8BFB;&#x8005;&#x81EA;&#x5DF1;&#x53BB;&#x601D;&#x8003;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x4E00;&#x8282;&#x5728;&#x811A;&#x6CE8;&#x4E2D;&#x89E3;&#x91CA;&#x4E86;<code class="literal">void</code>&#x5173;&#x952E;&#x5B57;&#x7684;Rationale&#x3002;<a class="xref" href="bi01.html#bibli.rationale" title="Rationale for International Standard &#xFF0D; Programming Languages &#xFF0D; C">[<abbr class="abbrev">C99 Rationale</abbr>]</a>&#x662F;&#x968F;C99&#x6807;&#x51C6;&#x4E00;&#x8D77;&#x53D1;&#x5E03;&#x7684;&#xFF0C;&#x503C;&#x5F97;&#x53C2;&#x8003;&#x3002;</p><p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;C&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x975E;&#x5E38;&#x4F18;&#x7F8E;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x7406;&#x89E3;&#x4E86;&#x5C11;&#x6570;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x57FA;&#x672C;&#x539F;&#x5219;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7EC4;&#x5408;&#x89C4;&#x5219;&#x5199;&#x51FA;&#x4EFB;&#x610F;&#x590D;&#x6742;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x4F8B;&#x5916;&#x7684;&#x89C4;&#x5B9A;&#x8BF4;&#x8FD9;&#x6837;&#x7EC4;&#x5408;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x90A3;&#x6837;&#x7C7B;&#x63A8;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;C++&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x5145;&#x6EE1;&#x4E86;&#x4F8B;&#x5916;&#xFF0C;&#x5168;&#x4E16;&#x754C;&#x6CA1;&#x51E0;&#x4E2A;&#x4EBA;&#x80FD;&#x628A;C++&#x7684;&#x6240;&#x6709;&#x89C4;&#x5219;&#x90FD;&#x7262;&#x8BB0;&#x4E8E;&#x5FC3;&#xFF0C;&#x56E0;&#x800C;C++&#x7684;&#x8BBE;&#x8BA1;&#x4E00;&#x76F4;&#x9971;&#x53D7;&#x4E89;&#x8BAE;&#xFF0C;&#x8FD9;&#x4E2A;&#x89C2;&#x70B9;&#x5728;<a class="xref" href="bi01.html#bibli.taoup" title="The Art of UNIX Programming">[<abbr class="abbrev">UNIX&#x7F16;&#x7A0B;&#x827A;&#x672F;</abbr>]</a>&#x4E2D;&#x6709;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x3002;</p><p>&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x51E1;&#x662F;&#x63D0;&#x9192;&#x8BFB;&#x8005;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x662F;&#x591A;&#x5C11;&#x6709;&#x4E9B;Surprise&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x521D;&#x5B66;&#x8005;&#x5982;&#x679C;&#x6309;&#x5E38;&#x7406;&#x6765;&#x60F3;&#x5F88;&#x53EF;&#x80FD;&#x8981;&#x60F3;&#x9519;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x7279;&#x522B;&#x63D0;&#x9192;&#x4E00;&#x4E0B;&#x3002;&#x800C;&#x521D;&#x5B66;&#x8005;&#x5BB9;&#x6613;&#x72AF;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#xFF0C;&#x5B8C;&#x5168;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x638C;&#x63E1;&#x597D;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x57FA;&#x672C;&#x539F;&#x7406;&#xFF0C;&#x6216;&#x8005;&#x6839;&#x672C;&#x65E0;&#x89C6;&#x7EC4;&#x5408;&#x89C4;&#x5219;&#x800C;&#x5168;&#x51ED;&#x81EA;&#x5DF1;&#x4E3B;&#x89C2;&#x81C6;&#x65AD;&#x6240;&#x81F4;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x672C;&#x4E66;&#x4E0D;&#x4F1A;&#x505A;&#x7279;&#x522B;&#x7684;&#x63D0;&#x9192;&#xFF0C;&#x4F8B;&#x5982;&#x6709;&#x7684;&#x521D;&#x5B66;&#x8005;&#x770B;&#x5B8C;<a class="xref" href="ch02.html#expr">&#x7B2C;&#xA0;2&#xA0;&#x7AE0; <i>&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;</i></a>&#x4E4B;&#x540E;&#x4F1A;&#x8FD9;&#x6837;&#x6253;&#x5370;&#x3C0;&#x7684;&#x503C;&#xFF1A;</p><pre class="programlisting">double pi=3.1416;
printf(&quot;pi\n&quot;);</pre><p>&#x4E4B;&#x6240;&#x4EE5;&#x4F1A;&#x72AF;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#xFF0C;&#x4E00;&#x662F;&#x4E0D;&#x7406;&#x89E3;Literal&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x4E8C;&#x662F;&#x81EA;&#x5DF1;&#x60F3;&#x5F53;&#x7136;&#x5730;&#x628A;&#x53D8;&#x91CF;&#x540D;&#x7EC4;&#x5408;&#x5230;&#x5B57;&#x7B26;&#x4E32;&#x91CC;&#x53BB;&#xFF0C;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x8FD9;&#x6761;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x8FD9;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x90FD;&#x9700;&#x8981;&#x5728;&#x4E66;&#x4E0A;&#x4E13;&#x95E8;&#x63D0;&#x9192;&#xFF0C;&#x5C31;&#x597D;&#x6BD4;&#x63D0;&#x9192;&#x5C0F;&#x5B69;&#x5403;&#x996D;&#x4E00;&#x5B9A;&#x8981;&#x5403;&#x5230;&#x5634;&#x91CC;&#xFF0C;&#x4E0D;&#x8981;&#x5403;&#x5230;&#x9F3B;&#x5B50;&#x91CC;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x5403;&#x5230;&#x8033;&#x6735;&#x91CC;&#x4E00;&#x6837;&#x3002;</p><p>&#x56DE;&#x5230;&#x6B63;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x8C03;&#x7528;<code class="literal">print_time(23, 59)</code>&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x53C2;&#x6570;<code class="literal">hour</code>&#x5C31;&#x4EE3;&#x8868;<code class="literal">23</code>&#xFF0C;&#x53C2;&#x6570;<code class="literal">minute</code>&#x5C31;&#x4EE3;&#x8868;<code class="literal">59</code>&#x3002;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x51FD;&#x6570;&#x4E2D;&#x7684;<code class="literal">hour</code>&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x201C;<span class="quote">&#x53C2;&#x6570;</span>&#x201D;&#x662F;&#x6307;&#x5F62;&#x53C2;&#xFF08;Parameter&#xFF09;<a id="id2713967" class="indexterm"></a>&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4F20;&#x4E00;&#x4E2A;&#x53C2;&#x6570;<code class="literal">23</code>&#x7ED9;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x201C;<span class="quote">&#x53C2;&#x6570;</span>&#x201D;&#x662F;&#x6307;&#x5B9E;&#x53C2;&#xFF08;Argument&#xFF09;<a id="id2713984" class="indexterm"></a>&#xFF0C;&#x4F46;&#x6211;&#x4E60;&#x60EF;&#x90FD;&#x53EB;&#x53C2;&#x6570;&#x800C;&#x4E0D;&#x4E60;&#x60EF;&#x603B;&#x628A;&#x5F62;&#x53C2;&#x3001;&#x5B9E;&#x53C2;&#x8FD9;&#x4E24;&#x4E2A;&#x6587;&#x7EC9;&#x7EC9;&#x7684;&#x8BCD;&#x6302;&#x5728;&#x5634;&#x8FB9;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x4E0D;&#x4E60;&#x60EF;&#xFF09;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4E0A;&#x4E0B;&#x6587;&#x5224;&#x65AD;&#x6211;&#x8BF4;&#x7684;&#x5230;&#x5E95;&#x662F;&#x5F62;&#x53C2;&#x8FD8;&#x662F;&#x5B9E;&#x53C2;&#x3002;&#x8BB0;&#x4F4F;&#x8FD9;&#x6761;&#x57FA;&#x672C;&#x539F;&#x7406;&#xFF1A;<span class="emphasis"><em>&#x5F62;&#x53C2;&#x76F8;&#x5F53;&#x4E8E;&#x51FD;&#x6570;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x7684;&#x8FC7;&#x7A0B;&#x76F8;&#x5F53;&#x4E8E;&#x5B9A;&#x4E49;&#x5F62;&#x53C2;&#x53D8;&#x91CF;&#x5E76;&#x4E14;&#x7528;&#x5B9E;&#x53C2;&#x7684;&#x503C;&#x6765;&#x521D;&#x59CB;&#x5316;</em></span>&#x3002;&#x4F8B;&#x5982;&#x8FD9;&#x6837;&#x8C03;&#x7528;&#xFF1A;</p><pre class="programlisting">void print_time(int hour, int minute)
{
	printf(&quot;%d:%d\n&quot;, hour, minute);
}

int main(void)
{
	int h = 23, m = 59;
	print_time(h, m);
	return 0;
}</pre><p>&#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x51FD;&#x6570;<code class="literal">print_time</code>&#x4E2D;&#x6267;&#x884C;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E9B;&#x8BED;&#x53E5;&#xFF1A;</p><pre class="programlisting">int hour = h;
int minute = m;
printf(&quot;%d:%d\n&quot;, hour, minute);</pre><p><code class="literal">main</code>&#x51FD;&#x6570;&#x7684;&#x53D8;&#x91CF;<code class="literal">h</code>&#x548C;<code class="literal">print_time</code>&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;<code class="literal">hour</code>&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E2D;&#x90FD;&#x4FDD;&#x5B58;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x503C;23&#xFF0C;&#x56E0;&#x4E3A;&#x53D8;&#x91CF;<code class="literal">h</code>&#x7684;&#x503C;&#x8D4B;&#x7ED9;&#x4E86;&#x53C2;&#x6570;<code class="literal">hour</code>&#x3002;&#x540C;&#x7406;&#xFF0C;&#x53D8;&#x91CF;<code class="literal">m</code>&#x7684;&#x503C;&#x8D4B;&#x7ED9;&#x4E86;&#x53C2;&#x6570;<code class="literal">minute</code>&#x3002;C&#x8BED;&#x8A00;&#x7684;&#x8FD9;&#x79CD;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;Call by Value<a id="id2714067" class="indexterm"></a>&#x3002;&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x90FD;&#x9700;&#x8981;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x6709;&#x51E0;&#x4E2A;&#x5F62;&#x53C2;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x65F6;&#x5C31;&#x8981;&#x4F20;&#x51E0;&#x4E2A;&#x5B9E;&#x53C2;&#xFF0C;&#x4E0D;&#x80FD;&#x591A;&#x4E5F;&#x4E0D;&#x80FD;&#x5C11;&#xFF0C;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x5FC5;&#x987B;&#x5BF9;&#x5E94;&#x4E0A;&#x3002;</p><p>&#x80AF;&#x5B9A;&#x6709;&#x8BFB;&#x8005;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x8C03;&#x7528;<code class="literal">printf</code>&#x4F20;&#x7684;&#x5B9E;&#x53C2;&#x4E2A;&#x6570;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;C&#x8BED;&#x8A00;&#x89C4;&#x5B9A;&#x4E86;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x683C;&#x5F0F;&#xFF0C;&#x7528;&#x547D;&#x4EE4;<code class="literal">man 3 printf</code>&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5230;<code class="literal">printf</code>&#x51FD;&#x6570;&#x7684;&#x539F;&#x578B;&#xFF1A;</p><pre class="programlisting">int printf(const char *format, ...);</pre><p>&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;<code class="literal">const char *</code>&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x7684;...&#x53EF;&#x4EE5;&#x4EE3;&#x8868;0&#x4E2A;&#x6216;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x53EF;&#x53D8;&#x53C2;&#x6570;&#xFF08;Variable Argument&#xFF09;<a id="id2714114" class="indexterm"></a>&#xFF0C;<a class="xref" href="ch24s06.html#interface.va">&#x7B2C;&#xA0;6&#xA0;&#x8282; &#x201C;&#x53EF;&#x53D8;&#x53C2;&#x6570;&#x201D;</a>&#x5C06;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x539F;&#x578B;&#x90FD;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x4E86;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x4E2A;&#x6570;&#xFF0C;&#x5373;&#x4F7F;&#x50CF;<code class="literal">printf</code>&#x8FD9;&#x6837;&#x89C4;&#x5B9A;&#x4E3A;&#x201C;<span class="quote">&#x4E0D;&#x786E;&#x5B9A;</span>&#x201D;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x660E;&#x786E;&#x7684;&#x89C4;&#x5B9A;&#xFF0C;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x8981;&#x4E25;&#x683C;&#x9075;&#x5B88;&#x8FD9;&#x4E9B;&#x89C4;&#x5B9A;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x628A;&#x51FD;&#x6570;&#x53EB;&#x505A;&#x63A5;&#x53E3;&#xFF08;Interface&#xFF09;<a id="id2714138" class="indexterm"></a>&#xFF0C;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x7684;&#x524D;&#x63D0;&#x662F;&#x5FC5;&#x987B;&#x548C;&#x63A5;&#x53E3;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Man Page</h3><p>Man Page&#x662F;Linux&#x5F00;&#x53D1;&#x6700;&#x5E38;&#x7528;&#x7684;&#x53C2;&#x8003;&#x624B;&#x518C;&#xFF0C;&#x7531;&#x5F88;&#x591A;&#x9875;&#x9762;&#x7EC4;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x9875;&#x9762;&#x88AB;&#x7EC4;&#x7EC7;&#x6210;&#x82E5;&#x5E72;&#x4E2A;Section&#x3002;FHS&#xFF08;Filesystem Hierarchy Standard&#xFF09;<a id="id2714160" class="indexterm"></a>&#x6807;&#x51C6;&#x89C4;&#x5B9A;&#x4E86;Man Page&#x5404;Section&#x7684;&#x542B;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p><div class="table"><a id="id2714168"></a><p class="title"><b>&#x8868;&#xA0;3.1.&#xA0;Man Page&#x7684;Section</b></p><div class="table-contents"><table summary="Man Page&#x7684;Section" border="1"><colgroup><col><col></colgroup><thead><tr><th>Section</th><th>&#x63CF;&#x8FF0;</th></tr></thead><tbody><tr><td>1</td><td>&#x7528;&#x6237;&#x547D;&#x4EE4;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">ls(1)</code></td></tr><tr><td>2</td><td>&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">_exit(2)</code></td></tr><tr><td>3</td><td>&#x5E93;&#x51FD;&#x6570;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">printf(3)</code></td></tr><tr><td>4</td><td>&#x7279;&#x6B8A;&#x6587;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">null(4)</code>&#x63CF;&#x8FF0;&#x4E86;&#x8BBE;&#x5907;&#x6587;&#x4EF6;<code class="literal">/dev/null</code>&#x3001;<code class="literal">/dev/zero</code>&#x7684;&#x4F5C;&#x7528;</td></tr><tr><td>5</td><td>&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">passwd(5)</code>&#x63CF;&#x8FF0;&#x4E86;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x6587;&#x4EF6;<code class="literal">/etc/passwd</code>&#x7684;&#x683C;&#x5F0F;</td></tr><tr><td>6</td><td>&#x6E38;&#x620F;</td></tr><tr><td>7</td><td>&#x5176;&#x5B83;&#x6742;&#x9879;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">bash-builtins(7)</code>&#x63CF;&#x8FF0;&#x4E86;<code class="literal">bash</code>&#x7684;&#x5404;&#x79CD;&#x5185;&#x5EFA;&#x547D;&#x4EE4;</td></tr><tr><td>8</td><td>&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">ifconfig(8)</code></td></tr></tbody></table></div></div><br class="table-break"><p>&#x6CE8;&#x610F;&#x533A;&#x5206;&#x7528;&#x6237;&#x547D;&#x4EE4;&#x548C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#xFF0C;&#x7528;&#x6237;&#x547D;&#x4EE4;&#x901A;&#x5E38;&#x4F4D;&#x4E8E;<code class="literal">/bin</code>&#x548C;<code class="literal">/usr/bin</code>&#x76EE;&#x5F55;&#xFF0C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#x901A;&#x5E38;&#x4F4D;&#x4E8E;<code class="literal">/sbin</code>&#x548C;<code class="literal">/usr/sbin</code>&#x76EE;&#x5F55;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7528;&#x6237;&#x547D;&#x4EE4;&#xFF0C;&#x800C;&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#x7ECF;&#x5E38;&#x9700;&#x8981;<code class="literal">root</code>&#x6743;&#x9650;&#x3002;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x548C;&#x5E93;&#x51FD;&#x6570;&#x7684;&#x533A;&#x522B;&#x5C06;&#x5728;<a class="xref" href="ch19s02.html#asmc.main">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;<code class="literal">main</code>&#x51FD;&#x6570;&#x548C;&#x542F;&#x52A8;&#x4F8B;&#x7A0B;&#x201D;</a>&#x8BF4;&#x660E;&#x3002;</p><p>Man Page&#x4E2D;&#x6709;&#x4E9B;&#x9875;&#x9762;&#x6709;&#x91CD;&#x540D;&#xFF0C;&#x6BD4;&#x5982;&#x6572;<code class="literal">man printf</code>&#x547D;&#x4EE4;&#x770B;&#x5230;&#x7684;&#x5E76;&#x4E0D;&#x662F;C&#x51FD;&#x6570;<code class="literal">printf</code>&#xFF0C;&#x800C;&#x662F;&#x4F4D;&#x4E8E;&#x7B2C;1&#x4E2A;Section&#x7684;&#x7CFB;&#x7EDF;&#x547D;&#x4EE4;<code class="literal">printf</code>&#xFF0C;&#x8981;&#x67E5;&#x770B;&#x4F4D;&#x4E8E;&#x7B2C;3&#x4E2A;Section&#x7684;<code class="literal">printf</code>&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x6572;<code class="literal">man 3 printf</code>&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6572;<code class="literal">man -k printf</code>&#x547D;&#x4EE4;&#x641C;&#x7D22;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x7684;&#x4E3B;&#x9898;&#x5305;&#x542B;<code class="literal">printf</code>&#x5173;&#x952E;&#x5B57;&#x3002;&#x672C;&#x4E66;&#x4F1A;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x7C7B;&#x4F3C;<code class="literal">printf(3)</code>&#x8FD9;&#x6837;&#x7684;&#x5199;&#x6CD5;&#xFF0C;&#x62EC;&#x53F7;&#x4E2D;&#x7684;3&#x8868;&#x793A;Man Page&#x7684;&#x7B2C;3&#x4E2A;Section&#xFF0C;&#x6216;&#x8005;&#x8868;&#x793A;&#x201C;<span class="quote">&#x6211;&#x8FD9;&#x91CC;&#x60F3;&#x8BF4;&#x7684;&#x662F;<code class="literal">printf</code>&#x5E93;&#x51FD;&#x6570;&#x800C;&#x4E0D;&#x662F;<code class="literal">printf</code>&#x547D;&#x4EE4;</span>&#x201D;&#x3002;</p></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2714399"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code class="literal">increment</code>&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x628A;&#x4F20;&#x8FDB;&#x6765;&#x7684;&#x53C2;&#x6570;&#x52A0;1&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">void increment(int x)
{
	x = x + 1;
}

int main(void)
{
	int i = 1, j = 2;
	increment(i); /* i now becomes 2 */
	increment(j); /* j now becomes 3 */
	return 0;
}</pre><p>&#x6211;&#x4EEC;&#x5728;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x8C03;&#x7528;<code class="literal">increment</code>&#x589E;&#x52A0;&#x53D8;&#x91CF;<code class="literal">i</code>&#x548C;<code class="literal">j</code>&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x594F;&#x6548;&#x5417;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p><p>2&#x3001;&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x8C03;&#x7528;&#x4E86;<code class="literal">printf</code>&#x51FD;&#x6570;&#x5374;&#x4E0D;&#x5305;&#x542B;&#x5934;&#x6587;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">int main(void) { printf(&quot;\n&quot;); }</code>&#xFF0C;&#x7F16;&#x8BD1;&#x65F6;&#x4F1A;&#x62A5;&#x8B66;&#x544A;&#xFF1A;<code class="literal">warning: incompatible implicit declaration of built-in function &#x2018;printf&#x2019;</code>&#x3002;&#x8BF7;&#x5206;&#x6790;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch03s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch03.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch03s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;4.&#xA0;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x4F5C;&#x7528;&#x57DF;</td></tr></tbody></table></div>
</body></html>