<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;return&#x8BED;&#x53E5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch05.html" title="&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;"><link rel="prev" href="ch05.html" title="&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;"><link rel="next" href="ch05s02.html" title="2.&#xA0;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;return&#x8BED;&#x53E5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch05.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch05s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2721598"></a>1.&#xA0;return&#x8BED;&#x53E5;</h2></div></div></div><p>&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x4F7F;&#x7528;<code class="literal">return</code>&#x8BED;&#x53E5;&#xFF0C;&#x73B0;&#x5728;&#x662F;&#x65F6;&#x5019;&#x5168;&#x9762;&#x6DF1;&#x5165;&#x5730;&#x5B66;&#x4E60;&#x4E00;&#x4E0B;&#x4E86;&#x3002;&#x5728;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;<code class="literal">return</code>&#x8BED;&#x53E5;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x63D0;&#x4F9B;&#x6574;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x5E76;&#x7ED3;&#x675F;&#x5F53;&#x524D;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x5230;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code class="literal">return</code>&#x8BED;&#x53E5;&#xFF0C;&#x4F8B;&#x5982;&#x5F53;&#x68C0;&#x67E5;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x65F6;&#x63D0;&#x524D;&#x7ED3;&#x675F;&#x5F53;&#x524D;&#x51FD;&#x6570;&#x7684;&#x6267;&#x884C;&#x5E76;&#x8FD4;&#x56DE;&#xFF1A;</p><pre class="programlisting">#include &lt;math.h&gt;

void print_logarithm(double x)
{
	if (x &lt;= 0.0) {
		printf(&quot;Positive numbers only, please.\n&quot;);
		return;
	}
	printf(&quot;The log of x is %f&quot;, log(x));
}</pre><p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x53C2;&#x6570;<code class="literal">x</code>&#x662F;&#x5426;&#x5927;&#x4E8E;0&#xFF0C;&#x5982;&#x679C;<code class="literal">x</code>&#x4E0D;&#x5927;&#x4E8E;0&#x5C31;&#x6253;&#x5370;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x524D;&#x7ED3;&#x675F;&#x51FD;&#x6570;&#x7684;&#x6267;&#x884C;&#x8FD4;&#x56DE;&#x5230;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x53EA;&#x6709;&#x5F53;<code class="literal">x</code>&#x5927;&#x4E8E;0&#x65F6;&#x624D;&#x80FD;&#x6C42;&#x5BF9;&#x6570;&#xFF0C;&#x5728;&#x6253;&#x5370;&#x4E86;&#x5BF9;&#x6570;&#x7ED3;&#x679C;&#x4E4B;&#x540E;&#x5230;&#x8FBE;&#x51FD;&#x6570;&#x4F53;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x81EA;&#x7136;&#x5730;&#x7ED3;&#x675F;&#x6267;&#x884C;&#x5E76;&#x8FD4;&#x56DE;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x5B66;&#x51FD;&#x6570;<code class="literal">log</code>&#x9700;&#x8981;&#x5305;&#x542B;&#x5934;&#x6587;&#x4EF6;<code class="literal">math.h</code>&#xFF0C;&#x7531;&#x4E8E;<code class="literal">x</code>&#x662F;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0E;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x505A;&#x6BD4;&#x8F83;&#xFF0C;&#x6240;&#x4EE5;&#x5199;&#x6210;0.0&#x3002;</p><p>&#x5728;<a class="xref" href="ch04s02.html#cond.ifelse">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;if/else&#x8BED;&#x53E5;&#x201D;</a>&#x4E2D;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x5947;&#x5076;&#x6027;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5947;&#x6570;&#x5C31;&#x6253;&#x5370;<code class="literal">x is odd.</code>&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5076;&#x6570;&#x5C31;&#x6253;&#x5370;<code class="literal">x is even.</code>&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5E76;&#x4E0D;&#x5341;&#x5206;&#x597D;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x5947;&#x5076;&#x6027;&#x7684;&#x51FD;&#x6570;&#x5F80;&#x5F80;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x6253;&#x5370;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5C31;&#x5B8C;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x6839;&#x636E;&#x5947;&#x5076;&#x6027;&#x7684;&#x4E0D;&#x540C;&#x5206;&#x522B;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x540E;&#x7EED;&#x52A8;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x6539;&#x6210;&#x4E00;&#x4E2A;&#x8FD4;&#x56DE;&#x5E03;&#x5C14;&#x503C;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p><pre class="programlisting">int is_even(int x)
{
	if (x % 2 == 0)
		return 1;
	else
		return 0;
}</pre><p>&#x6709;&#x4E9B;&#x4EBA;&#x559C;&#x6B22;&#x5199;&#x6210;<code class="literal">return(1);</code>&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x5916;&#x9762;&#x5957;&#x62EC;&#x53F7;&#x8868;&#x793A;&#x6539;&#x53D8;&#x8FD0;&#x7B97;&#x7B26;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4E0D;&#x8D77;&#x4EFB;&#x4F55;&#x4F5C;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF1A;</p><pre class="programlisting">int i = 19;
if (is_even(i)) {
	/* do something */
} else {
	/* do some other thing */
}</pre><p>&#x8FD4;&#x56DE;&#x5E03;&#x5C14;&#x503C;&#x7684;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x7C7B;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x901A;&#x5E38;&#x5145;&#x5F53;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x51FD;&#x6570;&#x540D;&#x901A;&#x5E38;&#x5E26;&#x6709;<code class="literal">is</code>&#x6216;<code class="literal">if</code>&#x7B49;&#x8868;&#x793A;&#x5224;&#x65AD;&#x7684;&#x8BCD;&#xFF0C;&#x8FD9;&#x7C7B;&#x51FD;&#x6570;&#x4E5F;&#x53EB;&#x505A;&#x8C13;&#x8BCD;&#xFF08;Predicate&#xFF09;<a id="id2721727" class="indexterm"></a>&#x3002;<code class="literal">is_even</code>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5199;&#x5F97;&#x6709;&#x70B9;&#x5570;&#x55E6;&#xFF0C;<code class="literal">x % 2</code>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x672C;&#x6765;&#x5C31;&#x6709;0&#x503C;&#x6216;&#x975E;0&#x503C;&#xFF0C;&#x76F4;&#x63A5;&#x628A;&#x8FD9;&#x4E2A;&#x503C;&#x5F53;&#x4F5C;&#x5E03;&#x5C14;&#x503C;&#x8FD4;&#x56DE;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF1A;</p><pre class="programlisting">int is_even(int x)
{
	return !(x % 2);
}</pre><p>&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x5E94;&#x8BE5;&#x8FD9;&#x6837;&#x7406;&#x89E3;&#xFF1A;<span class="emphasis"><em>&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x503C;&#x76F8;&#x5F53;&#x4E8E;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x7684;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x5E76;&#x7528;<code class="literal">return</code>&#x540E;&#x9762;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x521D;&#x59CB;&#x5316;</em></span>&#x3002;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x76F8;&#x5F53;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p><pre class="programlisting">int &#x4E34;&#x65F6;&#x53D8;&#x91CF; = !(x % 2);
&#x51FD;&#x6570;&#x9000;&#x51FA;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;x&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x91CA;&#x653E;;
if (&#x4E34;&#x65F6;&#x53D8;&#x91CF;) { /* &#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x7528;&#x5B8C;&#x5C31;&#x91CA;&#x653E; */
	/* do something */
} else {
	/* do some other thing */
}</pre><p>&#x5F53;<code class="literal">if</code>&#x8BED;&#x53E5;&#x5BF9;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x505A;&#x5224;&#x65AD;&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x5DF2;&#x7ECF;&#x9000;&#x51FA;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;<code class="literal">x</code>&#x5DF2;&#x7ECF;&#x91CA;&#x653E;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x8FD9;&#x65F6;&#x5019;&#x624D;&#x8BA1;&#x7B97;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">!(x % 2)</code>&#x7684;&#x503C;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x5FC5;&#x7136;&#x662F;&#x4E8B;&#x5148;&#x8BA1;&#x7B97;&#x597D;&#x4E86;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x91CC;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x51FD;&#x6570;&#x9000;&#x51FA;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x91CA;&#x653E;&#xFF0C;<code class="literal">if</code>&#x8BED;&#x53E5;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x505A;&#x5224;&#x65AD;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x867D;&#x7136;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x8BFB;&#x4E00;&#x4E0B;&#x5B83;&#x7684;&#x503C;&#xFF0C;&#x8BFB;&#x5B8C;&#x503C;&#x5C31;&#x91CA;&#x653E;&#x5B83;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x5F80;&#x5B83;&#x91CC;&#x9762;&#x5B58;&#x65B0;&#x7684;&#x503C;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;<span class="emphasis"><em>&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x662F;&#x5DE6;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x80FD;&#x505A;&#x5DE6;&#x503C;</em></span>&#xFF0C;&#x56E0;&#x6B64;&#x4E0B;&#x9762;&#x7684;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#x662F;&#x975E;&#x6CD5;&#x7684;&#xFF1A;</p><pre class="programlisting">is_even(20) = 1;</pre><p>&#x5728;<a class="xref" href="ch03s03.html#func.paraarg">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x5F62;&#x53C2;&#x548C;&#x5B9E;&#x53C2;&#x201D;</a>&#x4E2D;&#x8BB2;&#x8FC7;&#xFF0C;C&#x8BED;&#x8A00;&#x7684;&#x4F20;&#x53C2;&#x89C4;&#x5219;&#x662F;Call by Value&#xFF0C;&#x6309;&#x503C;&#x4F20;&#x9012;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8FD4;&#x56DE;&#x503C;&#x4E5F;&#x662F;&#x6309;&#x503C;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x5373;&#x4FBF;&#x8FD4;&#x56DE;&#x8BED;&#x53E5;&#x5199;&#x6210;<code class="literal">return x;</code>&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x4E5F;&#x662F;&#x53D8;&#x91CF;<code class="literal">x</code>&#x7684;&#x503C;&#xFF0C;&#x800C;&#x975E;&#x53D8;&#x91CF;<code class="literal">x</code>&#x672C;&#x8EAB;&#xFF0C;&#x56E0;&#x4E3A;&#x53D8;&#x91CF;<code class="literal">x</code>&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x88AB;&#x91CA;&#x653E;&#x4E86;&#x3002;</p><p>&#x5728;&#x5199;&#x5E26;&#x6709;<code class="literal">return</code>&#x8BED;&#x53E5;&#x7684;&#x51FD;&#x6570;&#x65F6;&#x8981;&#x5C0F;&#x5FC3;&#x68C0;&#x67E5;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x8DEF;&#x5F84;&#xFF08;Code Path&#xFF09;<a id="id2721866" class="indexterm"></a>&#x3002;&#x6709;&#x4E9B;&#x4EE3;&#x7801;&#x8DEF;&#x5F84;&#x5728;&#x4EFB;&#x4F55;&#x6761;&#x4EF6;&#x4E0B;&#x90FD;&#x6267;&#x884C;&#x4E0D;&#x5230;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;Dead Code<a id="id2721874" class="indexterm"></a>&#xFF0C;&#x4F8B;&#x5982;&#x628A;&amp;&amp;&#x548C;||&#x8FD0;&#x7B97;&#x7B26;&#x8BB0;&#x6DF7;&#x4E86;&#xFF08;&#x636E;&#x6211;&#x4E86;&#x89E3;&#x521D;&#x5B66;&#x8005;&#x72AF;&#x8FD9;&#x4E2A;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#x7684;&#x4E0D;&#x5728;&#x5C11;&#x6570;&#xFF09;&#xFF0C;&#x5199;&#x51FA;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p><pre class="programlisting">void foo(int x, int y)
{
	if (x &gt;= 0 || y &gt;= 0) {
		printf(&quot;both x and y are positive.\n&quot;);
		return;
	} else if (x &lt; 0 || y &lt; 0) {
		printf(&quot;both x and y are negetive.\n&quot;);
		return;
	}
	printf(&quot;x has a different sign from y.\n&quot;);
}</pre><p>&#x6700;&#x540E;&#x4E00;&#x884C;<code class="literal">printf</code>&#x6C38;&#x8FDC;&#x90FD;&#x6CA1;&#x673A;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#x5230;&#xFF0C;&#x662F;&#x4E00;&#x884C;Dead Code&#x3002;&#x6709;Dead Code&#x5C31;&#x4E00;&#x5B9A;&#x6709;Bug&#xFF0C;&#x4F60;&#x5199;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x60F3;&#x8BA9;&#x7A0B;&#x5E8F;&#x5728;&#x67D0;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53BB;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x6545;&#x610F;&#x5199;&#x51FA;&#x4E00;&#x884C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4E0D;&#x4F1A;&#x53BB;&#x6267;&#x884C;&#x5B83;&#xFF0C;&#x8BF4;&#x660E;&#x8DDF;&#x4F60;&#x9884;&#x60F3;&#x7684;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4F60;&#x5BF9;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x5206;&#x6790;&#x5F97;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x50CF;&#x4E0A;&#x4F8B;&#x8FD9;&#x6837;&#x7684;&#x7B14;&#x8BEF;&#xFF0C;&#x8BED;&#x4E49;&#x9519;&#x8BEF;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x7A0B;&#x5E8F;&#x4E2D;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x5206;&#x6790;&#x5F97;&#x4E0D;&#x591F;&#x5168;&#x9762;&#x5C06;&#x5BFC;&#x81F4;&#x6F0F;&#x6389;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x8DEF;&#x5F84;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int absolute_value(int x)
{
	if (x &lt; 0) {
		return -x;
	} else if (x &gt; 0) {
		return x;
	}
}</pre><p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x8FD4;&#x56DE;<code class="literal">int</code>&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x8FD4;&#x56DE;<code class="literal">int</code>&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5728;<code class="literal">x==0</code>&#x65F6;&#x5B89;&#x9759;&#x5730;&#x9000;&#x51FA;&#x51FD;&#x6570;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x8FD4;&#x56DE;&#xFF0C;C&#x8BED;&#x8A00;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4F1A;&#x8FD4;&#x56DE;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x901A;&#x5E38;&#x8FD4;&#x56DE;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x7B49;&#x5B66;&#x5230;<a class="xref" href="ch19s01.html#asmc.funccall">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x201D;</a>&#x4F60;&#x5C31;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x4E86;&#x3002;&#x53E6;&#x5916;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x628A;-&#x53F7;&#x5F53;&#x8D1F;&#x53F7;&#x7528;&#x800C;&#x4E0D;&#x662F;&#x5F53;&#x51CF;&#x53F7;&#x7528;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;+&#x53F7;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x7528;&#x3002;&#x6B63;&#x8D1F;&#x53F7;&#x662F;&#x5355;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x800C;&#x52A0;&#x51CF;&#x53F7;&#x662F;&#x53CC;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x6B63;&#x8D1F;&#x53F7;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x548C;&#x903B;&#x8F91;&#x975E;&#x8FD0;&#x7B97;&#x7B26;&#x76F8;&#x540C;&#xFF0C;&#x6BD4;&#x52A0;&#x51CF;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x8981;&#x9AD8;&#x3002;</p><p>&#x4EE5;&#x4E0A;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x90FD;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x7F16;&#x8BD1;&#x9519;&#x8BEF;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EA;&#x505A;&#x8BED;&#x6CD5;&#x68C0;&#x67E5;&#x548C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x8BED;&#x4E49;&#x68C0;&#x67E5;&#xFF0C;&#x800C;&#x4E0D;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#x7684;&#x903B;&#x8F91;<sup>[<a id="id2721968" href="#ftn.id2721968" class="footnote">7</a>]</sup>&#x3002;&#x867D;&#x7136;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#x4F60;&#x89C1;&#x5230;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x5DF2;&#x7ECF;&#x5341;&#x5206;&#x8BA8;&#x538C;&#x7F16;&#x8BD1;&#x5668;&#x62A5;&#x9519;&#x4E86;&#xFF0C;&#x4F46;&#x5F88;&#x5FEB;&#x4F60;&#x5C31;&#x4F1A;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x9519;&#x8BEF;&#x7F16;&#x8BD1;&#x5668;&#x8FD8;&#x4E0D;&#x62A5;&#x9519;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x6BD4;&#x62A5;&#x9519;&#x66F4;&#x7CDF;&#x7CD5;&#x3002;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x4F60;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x8FD0;&#x884C;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x6D4B;&#x5230;<code class="literal">x==0</code>&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x8BB8;&#x521A;&#x597D;&#x5728;&#x4F60;&#x7684;&#x73AF;&#x5883;&#x4E2D;<code class="literal">x==0</code>&#x65F6;&#x8FD4;&#x56DE;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x503C;&#x5C31;&#x662F;0&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x653E;&#x5FC3;&#x5730;&#x628A;&#x5B83;&#x96C6;&#x6210;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x4E07;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x4E4B;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x4F60;&#x628A;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4EA4;&#x7ED9;&#x7528;&#x6237;&#xFF0C;&#x8D77;&#x521D;&#x7684;&#x51E0;&#x5929;&#x91CC;&#x76F8;&#x5B89;&#x65E0;&#x4E8B;&#xFF0C;&#x4E4B;&#x540E;&#x6BCF;&#x8FC7;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x6709;&#x7528;&#x6237;&#x62A5;&#x544A;&#x8BF4;&#x7A0B;&#x5E8F;&#x51FA;&#x9519;&#xFF0C;&#x4F46;&#x6BCF;&#x6B21;&#x51FA;&#x9519;&#x7684;&#x73B0;&#x8C61;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x5F88;&#x96BE;&#x590D;&#x73B0;&#xFF0C;&#x4F60;&#x60F3;&#x8BA9;&#x5B83;&#x51FA;&#x73B0;&#x65F6;&#x5B83;&#x5C31;&#x4E0D;&#x51FA;&#x73B0;&#xFF0C;&#x5728;&#x4F60;&#x6BEB;&#x65E0;&#x9632;&#x5907;&#x65F6;&#x5B83;&#x53C8;&#x7A81;&#x7136;&#x5192;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x7136;&#x540E;&#x4F60;&#x82B1;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x6570;&#x4E07;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x6392;&#x67E5;&#x54EA;&#x91CC;&#x9519;&#x4E86;&#xFF0C;&#x51E0;&#x5929;&#x4E4B;&#x540E;&#x7EC8;&#x4E8E;&#x5E78;&#x8FD0;&#x5730;&#x627E;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;Bug&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x4F1A;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x521D;&#x7F16;&#x8BD1;&#x5668;&#x80FD;&#x62A5;&#x4E2A;&#x9519;&#x591A;&#x597D;&#x554A;&#xFF01;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x7F16;&#x8BD1;&#x5668;&#x62A5;&#x9519;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x8D23;&#x602A;&#x7F16;&#x8BD1;&#x5668;&#x592A;&#x8FC7;&#x4E8E;&#x6311;&#x5254;&#xFF0C;&#x5B83;&#x5E2E;&#x4F60;&#x8282;&#x7701;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x8C03;&#x8BD5;&#x65F6;&#x95F4;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;<code class="literal">math.h</code>&#x4E2D;&#x6709;&#x4E00;&#x4E2A;<code class="literal">fabs</code>&#x51FD;&#x6570;&#x5C31;&#x662F;&#x6C42;&#x7EDD;&#x5BF9;&#x503C;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x5FC5;&#x81EA;&#x5DF1;&#x5199;&#x7EDD;&#x5BF9;&#x503C;&#x51FD;&#x6570;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2721483"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x51FD;&#x6570;<code class="literal">int is_leap_year(int year)</code>&#xFF0C;&#x5224;&#x65AD;&#x53C2;&#x6570;<code class="literal">year</code>&#x662F;&#x4E0D;&#x662F;&#x95F0;&#x5E74;&#x3002;&#x5982;&#x679C;&#x67D0;&#x5E74;&#x4EFD;&#x80FD;&#x88AB;4&#x6574;&#x9664;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x88AB;100&#x6574;&#x9664;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E00;&#x5E74;&#x5C31;&#x662F;&#x95F0;&#x5E74;&#xFF0C;&#x6B64;&#x5916;&#xFF0C;&#x80FD;&#x88AB;400&#x6574;&#x9664;&#x7684;&#x5E74;&#x4EFD;&#x4E5F;&#x662F;&#x95F0;&#x5E74;&#x3002;</p><p>2&#x3001;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;<code class="literal">double myround(double x)</code>&#xFF0C;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x5C0F;&#x6570;&#xFF0C;&#x5C06;&#x5B83;&#x56DB;&#x820D;&#x4E94;&#x5165;&#x3002;&#x4F8B;&#x5982;<code class="literal">myround(-3.51)</code>&#x7684;&#x503C;&#x662F;-4.0&#xFF0C;<code class="literal">myround(4.49)</code>&#x7684;&#x503C;&#x662F;4.0&#x3002;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code class="literal">math.h</code>&#x4E2D;&#x7684;&#x5E93;&#x51FD;&#x6570;<code class="literal">ceil</code>&#x548C;<code class="literal">floor</code>&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2721968" href="#id2721968" class="para">7</a>] </sup>&#x6709;&#x7684;&#x4EE3;&#x7801;&#x8DEF;&#x5F84;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x95EE;&#x9898;&#x7F16;&#x8BD1;&#x5668;&#x662F;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x7F16;&#x8BD1;&#x65F6;&#x52A0;<code class="literal">-Wall</code>&#x9009;&#x9879;&#x4F1A;&#x62A5;&#x8B66;&#x544A;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch05.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch05.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch05s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;</td></tr></tbody></table></div>
</body></html>