<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>2.&#xA0;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch05.html" title="&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;"><link rel="prev" href="ch05s01.html" title="1.&#xA0;return&#x8BED;&#x53E5;"><link rel="next" href="ch05s03.html" title="3.&#xA0;&#x9012;&#x5F52;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">2.&#xA0;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch05s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch05s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2721551"></a>2.&#xA0;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;</h2></div></div></div><p>&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x5728;&#x5B83;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x6539;&#x52A8;&#x5E76;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x5DE9;&#x56FA;&#x6240;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x89E3;&#x51B3;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5E94;&#x8BE5;&#x6309;&#x4EC0;&#x4E48;&#x6B65;&#x9AA4;&#x6765;&#x5199;&#x5462;&#xFF1F;&#x672C;&#x8282;&#x63D0;&#x51FA;&#x4E00;&#x79CD;&#x589E;&#x91CF;&#x5F0F;&#xFF08;Incremental&#xFF09;<a id="id2721566" class="indexterm"></a>&#x5F00;&#x53D1;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x5F88;&#x9002;&#x5408;&#x521D;&#x5B66;&#x8005;&#x3002;</p><p>&#x73B0;&#x5728;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF1A;&#x6211;&#x4EEC;&#x8981;&#x7F16;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6C42;&#x5706;&#x7684;&#x9762;&#x79EF;&#xFF0C;&#x5706;&#x7684;&#x534A;&#x5F84;&#x4EE5;&#x4E24;&#x4E2A;&#x7AEF;&#x70B9;&#x7684;&#x5EA7;&#x6807;(x<sub>1</sub>, y<sub>1</sub>)&#x548C;(x<sub>2</sub>, y<sub>2</sub>)&#x7ED9;&#x51FA;&#x3002;&#x9996;&#x5148;&#x5206;&#x6790;&#x548C;&#x5206;&#x89E3;&#x95EE;&#x9898;&#xFF0C;&#x628A;&#x5927;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x6210;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x518D;&#x5BF9;&#x5C0F;&#x95EE;&#x9898;&#x5206;&#x522B;&#x6C42;&#x89E3;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x5206;&#x4E3A;&#x4E24;&#x6B65;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x7531;&#x4E24;&#x4E2A;&#x7AEF;&#x70B9;&#x5EA7;&#x6807;&#x6C42;&#x534A;&#x5F84;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5E73;&#x9762;&#x4E0A;&#x4E24;&#x70B9;&#x95F4;&#x8DDD;&#x79BB;&#x7684;&#x516C;&#x5F0F;&#x662F;&#xFF1A;</p><div class="literallayout"><p>distance&#xA0;=&#xA0;&#x221A;((x<sub>2</sub>-x<sub>1</sub>)<sup>2</sup>+(y<sub>2</sub>-y<sub>1</sub>)<sup>2</sup>)</p></div><p>&#x62EC;&#x53F7;&#x91CC;&#x7684;&#x90E8;&#x5206;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x6211;&#x4EEC;&#x5B66;&#x8FC7;&#x7684;C&#x8BED;&#x8A00;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x6C42;&#x5E73;&#x65B9;&#x6839;&#x53EF;&#x4EE5;&#x7528;<code class="literal">math.h</code>&#x4E2D;&#x7684;<code class="literal">sqrt</code>&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x5C0F;&#x95EE;&#x9898;&#x5168;&#x90E8;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x6211;&#x4EEC;&#x5B66;&#x8FC7;&#x7684;&#x77E5;&#x8BC6;&#x89E3;&#x51B3;&#x3002;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6210;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x53C2;&#x6570;&#x662F;&#x4E24;&#x70B9;&#x7684;&#x5EA7;&#x6807;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x662F;<code class="literal">distance</code>&#x3002;</p></li><li><p>&#x4E0A;&#x4E00;&#x6B65;&#x7B97;&#x51FA;&#x7684;&#x8DDD;&#x79BB;&#x662F;&#x5706;&#x7684;&#x534A;&#x5F84;&#xFF0C;&#x5DF2;&#x77E5;&#x5706;&#x7684;&#x534A;&#x5F84;&#x4E4B;&#x540E;&#x6C42;&#x9762;&#x79EF;&#x7684;&#x516C;&#x5F0F;&#x662F;&#xFF1A;</p><div class="literallayout"><p>area&#xA0;=&#xA0;&#x3C0;&#xB7;radius<sup>2</sup></p></div><p>&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6211;&#x4EEC;&#x5B66;&#x8FC7;&#x7684;C&#x8BED;&#x8A00;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6210;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x53C2;&#x6570;&#x662F;<code class="literal">radius</code>&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x662F;<code class="literal">area</code>&#x3002;</p></li></ol></div><p>&#x9996;&#x5148;&#x7F16;&#x5199;<code class="literal">distance</code>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x660E;&#x786E;&#x4E86;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4E24;&#x70B9;&#x7684;&#x5EA7;&#x6807;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x4E24;&#x70B9;&#x95F4;&#x8DDD;&#x79BB;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x5199;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF1A;</p><pre class="programlisting">double distance(double x1, double y1, double x2, double y2)
{
	return 0.0;
}</pre><p>&#x521D;&#x5B66;&#x8005;&#x5199;&#x5230;&#x8FD9;&#x91CC;&#x5C31;&#x5DF2;&#x7ECF;&#x4E0D;&#x592A;&#x81EA;&#x4FE1;&#x4E86;&#xFF1A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x5199;&#x5F97;&#x5BF9;&#x5417;&#xFF1F;&#x867D;&#x7136;&#x6211;&#x662F;&#x6309;&#x6211;&#x7406;&#x89E3;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x5199;&#x7684;&#xFF0C;&#x4F46;&#x4E66;&#x4E0A;&#x6CA1;&#x6709;&#x548C;&#x8FD9;&#x4E2A;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E07;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x9057;&#x6F0F;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x65E2;&#x7136;&#x4E0D;&#x81EA;&#x4FE1;&#x5C31;&#x4E0D;&#x8981;&#x518D;&#x5F80;&#x4E0B;&#x5199;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5E73;&#x7A33;&#x7684;&#x5FC3;&#x6001;&#x6765;&#x5199;&#x7A0B;&#x5E8F;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x5165;Bug&#x3002;&#x6240;&#x4EE5;&#x5728;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x63D2;&#x4E00;&#x4E2A;<code class="literal">return 0.0</code>&#x7ACB;&#x523B;&#x7ED3;&#x675F;&#x6389;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x7ACB;&#x523B;&#x6D4B;&#x8BD5;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x5F97;&#x6709;&#x6CA1;&#x6709;&#x9519;&#xFF1A;</p><pre class="programlisting">int main(void)
{
	printf(&quot;distance is %f\n&quot;, distance(1.0, 2.0, 4.0, 6.0));
	return 0;
}</pre><p>&#x7F16;&#x8BD1;&#xFF0C;&#x8FD0;&#x884C;&#xFF0C;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#x3002;&#x8FD9;&#x65F6;&#x4F60;&#x5C31;&#x4F1A;&#x5EFA;&#x7ACB;&#x8D77;&#x4FE1;&#x5FC3;&#x4E86;&#xFF1A;&#x65E2;&#x7136;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x7BA1;&#x5B83;&#x4E86;&#xFF0C;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x5199;&#x3002;&#x5728;&#x6D4B;&#x8BD5;&#x65F6;&#x7ED9;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x662F;(1.0, 2.0)&#x548C;(4.0, 6.0)&#xFF0C;&#x4E24;&#x70B9;&#x7684;<code class="literal">x</code>&#x5EA7;&#x6807;&#x8DDD;&#x79BB;&#x662F;3.0&#xFF0C;<code class="literal">y</code>&#x5EA7;&#x6807;&#x8DDD;&#x79BB;&#x662F;4.0&#xFF0C;&#x56E0;&#x6B64;&#x4E24;&#x70B9;&#x95F4;&#x8DDD;&#x79BB;&#x5E94;&#x8BE5;&#x662F;5.0&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x6B63;&#x786E;&#x7B54;&#x6848;&#x662F;5.0&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x624D;&#x80FD;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#x8BA1;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#x5BF9;&#x4E0D;&#x5BF9;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x73B0;&#x5728;&#x51FD;&#x6570;&#x8FD8;&#x6CA1;&#x5B9E;&#x73B0;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x518D;&#x5F80;&#x51FD;&#x6570;&#x91CC;&#x6DFB;&#x4E00;&#x70B9;&#x4EE3;&#x7801;&#xFF1A;</p><pre class="programlisting">double distance(double x1, double y1, double x2, double y2)
{
	double dx = x2 - x1;
	double dy = y2 - y1;
	printf(&quot;dx is %f\ndy is %f\n&quot;, dx, dy);

	return 0.0;
}</pre><p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x786E;&#x5B9A;<code class="literal">dx</code>&#x548C;<code class="literal">dy</code>&#x8FD9;&#x6837;&#x521D;&#x59CB;&#x5316;&#x884C;&#x4E0D;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6B64;&#x6253;&#x4F4F;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x91CC;&#x63D2;&#x4E00;&#x6761;&#x6253;&#x5370;&#x8BED;&#x53E5;&#x628A;<code class="literal">dx</code>&#x548C;<code class="literal">dy</code>&#x7684;&#x503C;&#x6253;&#x51FA;&#x6765;&#x770B;&#x770B;&#x3002;&#x628A;&#x5B83;&#x548C;&#x4E0A;&#x9762;&#x7684;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E00;&#x8D77;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x5E94;&#x8BE5;&#x662F;3.0&#x548C;4.0&#xFF0C;&#x56E0;&#x6B64;&#x80FD;&#x591F;&#x9A8C;&#x8BC1;&#x7A0B;&#x5E8F;&#x7B97;&#x5F97;&#x5BF9;&#x4E0D;&#x5BF9;&#x3002;&#x4E00;&#x65E6;&#x9A8C;&#x8BC1;&#x65E0;&#x8BEF;&#xFF0C;&#x51FD;&#x6570;&#x91CC;&#x7684;&#x8FD9;&#x53E5;&#x6253;&#x5370;&#x5C31;&#x53EF;&#x4EE5;&#x64A4;&#x6389;&#x4E86;&#xFF0C;&#x50CF;&#x8FD9;&#x79CD;&#x6253;&#x5370;&#x8BED;&#x53E5;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x7528;&#x6765;&#x6D4B;&#x8BD5;&#x7684;<code class="literal">main</code>&#x51FD;&#x6570;&#xFF0C;&#x90FD;&#x8D77;&#x5230;&#x4E86;&#x7C7B;&#x4F3C;&#x811A;&#x624B;&#x67B6;&#xFF08;Scaffold&#xFF09;<a id="id2722506" class="indexterm"></a>&#x7684;&#x4F5C;&#x7528;&#xFF1A;&#x5728;&#x76D6;&#x623F;&#x5B50;&#x65F6;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x662F;&#x623F;&#x5B50;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x623F;&#x5B50;&#x76D6;&#x597D;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x62C6;&#x6389;&#x4E86;&#x3002;&#x623F;&#x5B50;&#x76D6;&#x597D;&#x4E4B;&#x540E;&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x7EF4;&#x4FEE;&#x3001;&#x52A0;&#x76D6;&#x3001;&#x7FFB;&#x65B0;&#xFF0C;&#x53C8;&#x8981;&#x518D;&#x52A0;&#x4E0A;&#x811A;&#x624B;&#x67B6;&#xFF0C;&#x8FD9;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x8981;&#x662F;&#x5F53;&#x521D;&#x4E0D;&#x7528;&#x62C6;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x62C6;&#x4E0D;&#x884C;&#xFF0C;&#x4E0D;&#x62C6;&#x591A;&#x96BE;&#x770B;&#x554A;&#x3002;&#x5199;&#x4EE3;&#x7801;&#x5374;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x660E;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1A;&#x628A;Scaffolding&#x7684;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x6389;&#x3002;</p><pre class="programlisting">double distance(double x1, double y1, double x2, double y2)
{
	double dx = x2 - x1;
	double dy = y2 - y1;
	/* printf(&quot;dx is %f\ndy is %f\n&quot;, dx, dy); */
	return 0.0;
}</pre><p>&#x8FD9;&#x6837;&#x5982;&#x679C;&#x4EE5;&#x540E;&#x51FA;&#x4E86;&#x65B0;&#x7684;Bug&#x53C8;&#x9700;&#x8981;&#x8DDF;&#x8E2A;&#x8C03;&#x8BD5;&#x65F6;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x53E5;&#x91CD;&#x65B0;&#x52A0;&#x8FDB;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x3002;&#x4E24;&#x70B9;&#x7684;x&#x5EA7;&#x6807;&#x8DDD;&#x79BB;&#x548C;y&#x5EA7;&#x6807;&#x8DDD;&#x79BB;&#x90FD;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x6C42;&#x5B83;&#x4EEC;&#x7684;&#x5E73;&#x65B9;&#x548C;&#xFF1A;</p><pre class="programlisting">double distance(double x1, double y1, double x2, double y2)
{
	double dx = x2 - x1;
	double dy = y2 - y1;
	double dsquared = dx * dx + dy * dy;
	printf(&quot;dsquared is %f\n&quot;, dsquared);

	return 0.0;
}</pre><p>&#x7136;&#x540E;&#x518D;&#x7F16;&#x8BD1;&#x3001;&#x8FD0;&#x884C;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x5F97;25.0&#x3002;&#x8FD9;&#x6837;&#x7684;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;&#x975E;&#x5E38;&#x9002;&#x5408;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x6BCF;&#x5199;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#xFF0C;&#x786E;&#x4FDD;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#x518D;&#x5199;&#x4E00;&#x4E0B;&#x884C;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x66F4;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x65B9;&#x4FBF;&#x4E86;&#x8C03;&#x8BD5;&#xFF1A;&#x603B;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5148;&#x524D;&#x7684;&#x6B63;&#x786E;&#x7248;&#x672C;&#x505A;&#x53C2;&#x7167;&#xFF0C;&#x6539;&#x52A8;&#x4E4B;&#x540E;&#x5982;&#x679C;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x5C31;&#x662F;&#x521A;&#x624D;&#x6539;&#x7684;&#x90A3;&#x884C;&#x4EE3;&#x7801;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x907F;&#x514D;&#x4E86;&#x5FC5;&#x987B;&#x4ECE;&#x5F88;&#x591A;&#x884C;&#x4EE3;&#x7801;&#x4E2D;&#x67E5;&#x627E;&#x5206;&#x6790;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x4E00;&#x884C;&#x51FA;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;<code class="literal">printf</code>&#x529F;&#x4E0D;&#x53EF;&#x6CA1;&#xFF0C;&#x4F60;&#x6000;&#x7591;&#x54EA;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x63D2;&#x4E00;&#x4E2A;<code class="literal">printf</code>&#x8FDB;&#x53BB;&#x770B;&#x770B;&#x4E2D;&#x95F4;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x529E;&#x6CD5;&#x627E;&#x51FA;&#x6765;&#x3002;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x4ECB;&#x7ECD;&#x7A0B;&#x5E8F;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;<code class="literal">gdb</code>&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x8C03;&#x8BD5;&#x529F;&#x80FD;&#x5E2E;&#x4F60;&#x5206;&#x6790;&#x66F4;&#x9690;&#x853D;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x4F46;&#x5373;&#x4F7F;&#x6709;&#x4E86;<code class="literal">gdb</code>&#xFF0C;<code class="literal">printf</code>&#x8FD9;&#x4E2A;&#x6700;&#x539F;&#x59CB;&#x7684;&#x529E;&#x6CD5;&#x4ECD;&#x7136;&#x662F;&#x6700;&#x76F4;&#x63A5;&#x3001;&#x6700;&#x6709;&#x6548;&#x7684;&#x3002;&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF1A;</p><div class="example"><a id="id2722600"></a><p class="title"><b>&#x4F8B;&#xA0;5.1.&#xA0;distance&#x51FD;&#x6570;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;math.h&gt;
#include &lt;stdio.h&gt;

double distance(double x1, double y1, double x2, double y2)
{
	double dx = x2 - x1;
	double dy = y2 - y1;
	double dsquared = dx * dx + dy * dy;
	double result = sqrt(dsquared);

	return result;
}

int main(void)
{
	printf(&quot;distance is %f\n&quot;, distance(1.0, 2.0, 4.0, 6.0));
	return 0;
}</pre></div></div><br class="example-break"><p>&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x5F97;5.0&#x3002;&#x968F;&#x7740;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x8D8A;&#x6765;&#x8D8A;&#x4E30;&#x5BCC;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6BCF;&#x6B21;&#x5199;&#x82E5;&#x5E72;&#x884C;&#x4EE3;&#x7801;&#x518D;&#x4E00;&#x8D77;&#x6D4B;&#x8BD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x73B0;&#x5728;&#x8FD9;&#x6837;&#x6BCF;&#x5199;&#x4E00;&#x884C;&#x5C31;&#x6D4B;&#x8BD5;&#x4E00;&#x6B21;&#xFF0C;&#x4F46;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x8282;&#x7701;&#x5927;&#x91CF;&#x7684;&#x8C03;&#x8BD5;&#x65F6;&#x95F4;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x6709;&#x591A;&#x5F3A;&#xFF0C;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x4E00;&#x53E3;&#x6C14;&#x5199;&#x5B8C;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x518D;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#xFF0C;&#x90A3;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;Bug&#x7684;&#xFF0C;&#x5230;&#x90A3;&#x65F6;&#x5019;&#x518D;&#x627E;Bug&#x5C31;&#x96BE;&#x4E86;&#x3002;</p><p>&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x5F15;&#x5165;&#x4E86;&#x5F88;&#x591A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#xFF1A;<code class="literal">dx</code>&#x3001;<code class="literal">dy</code>&#x3001;<code class="literal">dsquared</code>&#x3001;<code class="literal">result</code>&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4FE1;&#x5FC3;&#x628A;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E00;&#x6B21;&#x6027;&#x5199;&#x597D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#xFF1A;</p><pre class="programlisting">double distance(double x1, double y1, double x2, double y2)
{
	return sqrt((x2-x1) * (x2-x1) + (y2-y1) * (y2-y1));
}</pre><p>&#x8FD9;&#x6837;&#x5199;&#x7B80;&#x6D01;&#x5F97;&#x591A;&#x4E86;&#x3002;&#x4F46;&#x5982;&#x679C;&#x5199;&#x9519;&#x4E86;&#x5462;&#xFF1F;&#x53EA;&#x77E5;&#x9053;&#x662F;&#x8FD9;&#x4E00;&#x957F;&#x4E32;&#x8868;&#x8FBE;&#x5F0F;&#x6709;&#x9519;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x9519;&#x5728;&#x54EA;&#xFF0C;&#x800C;&#x4E14;&#x6574;&#x4E2A;&#x51FD;&#x6570;&#x5C31;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x63D2;<code class="literal">printf</code>&#x90FD;&#x6CA1;&#x5730;&#x65B9;&#x63D2;&#x3002;&#x6240;&#x4EE5;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x6709;&#x5B83;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x4F7F;&#x7A0B;&#x5E8F;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x8C03;&#x8BD5;&#x66F4;&#x65B9;&#x4FBF;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x8FD9;&#x4E00;&#x884C;&#x8868;&#x8FBE;&#x5F0F;&#x8981;&#x628A;<code class="literal">(x2-x1)</code>&#x8BA1;&#x7B97;&#x4E24;&#x904D;&#xFF0C;&#x5982;&#x679C;&#x7B97;&#x5B8C;<code class="literal">(x2-x1)</code>&#x628A;&#x7ED3;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;<code class="literal">dx</code>&#x91CC;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x7B97;&#x7B2C;&#x4E8C;&#x904D;&#x4E86;&#x3002;</p><p>&#x63A5;&#x4E0B;&#x6765;&#x7F16;&#x5199;<code class="literal">area</code>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF1A;</p><pre class="programlisting">double area(double radius)
{
	return 3.1416 * radius * radius;
}</pre><p>&#x7ED9;&#x51FA;&#x4E24;&#x70B9;&#x7684;&#x5EA7;&#x6807;&#x6C42;&#x8DDD;&#x79BB;&#xFF0C;&#x7ED9;&#x51FA;&#x534A;&#x5F84;&#x6C42;&#x5706;&#x7684;&#x9762;&#x79EF;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x90FD;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x5982;&#x4F55;&#x628A;&#x5B83;&#x4EEC;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x89E3;&#x51B3;&#x6574;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x7ED9;&#x51FA;&#x534A;&#x5F84;&#x7684;&#x4E24;&#x7AEF;&#x70B9;&#x5EA7;&#x6807;(1.0, 2.0)&#x548C;(4.0, 6.0)&#x6C42;&#x5706;&#x7684;&#x9762;&#x79EF;&#xFF0C;&#x5148;&#x7528;<code class="literal">distance</code>&#x51FD;&#x6570;&#x6C42;&#x51FA;&#x534A;&#x5F84;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x518D;&#x628A;&#x8FD9;&#x4E2A;&#x957F;&#x5EA6;&#x4F20;&#x7ED9;<code class="literal">area</code>&#x51FD;&#x6570;&#xFF1A;</p><pre class="programlisting">double radius = distance(1.0, 2.0, 4.0, 6.0);
double result = area(radius);</pre><p>&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#xFF1A;</p><pre class="programlisting">double result = area(distance(1.0, 2.0, 4.0, 6.0));</pre><p>&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x628A;&#x201C;<span class="quote">&#x7ED9;&#x51FA;&#x534A;&#x5F84;&#x7684;&#x4E24;&#x7AEF;&#x70B9;&#x5EA7;&#x6807;&#x6C42;&#x5706;&#x7684;&#x9762;&#x79EF;</span>&#x201D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F53;&#x4F5C;&#x6574;&#x4E2A;&#x95EE;&#x9898;&#x6765;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7A0B;&#x5E8F;&#x5F53;&#x4E2D;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5148;&#x524D;&#x7684;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x505A;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x51FD;&#x6570;&#x4EE5;&#x4FBF;&#x65E5;&#x540E;&#x4F7F;&#x7528;&#xFF1A;</p><pre class="programlisting">double area_point(double x1, double y1, double x2, double y2)
{
	return area(distance(x1, y1, x2, y2));
}</pre><p>&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x7EC4;&#x5408;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x4E0D;&#x662F;&#x628A;<code class="literal">distance</code>&#x548C;<code class="literal">area</code>&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x90A3;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x7EC4;&#x5408;&#x5230;&#x4E00;&#x8D77;&#xFF1A;</p><pre class="programlisting">double area_point(double x1, double y1, double x2, double y2)
{
	double dx = x2 - x1;
	double dy = y2 - y1;
	double radius = sqrt(dx * dx + dy * dy);

	return 3.1416 * radius * radius;
}</pre><p>&#x8FD9;&#x6837;&#x7EC4;&#x5408;&#x662F;&#x4E0D;&#x7406;&#x60F3;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x7EC4;&#x5408;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x539F;&#x6765;&#x5199;&#x7684;<code class="literal">distance</code>&#x548C;<code class="literal">area</code>&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x8FD8;&#x8981;&#x4E0D;&#x8981;&#x4E86;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x4E0D;&#x8981;&#x4E86;&#x5220;&#x6389;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x53EA;&#x9700;&#x8981;&#x6C42;&#x4E24;&#x70B9;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x9700;&#x8981;&#x7ED9;&#x5B9A;&#x534A;&#x5F84;&#x957F;&#x5EA6;&#x6C42;&#x5706;&#x7684;&#x9762;&#x79EF;&#x5462;&#xFF1F;<code class="literal">area_point</code>&#x628A;&#x6240;&#x6709;&#x8BED;&#x53E5;&#x90FD;&#x5199;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x592A;&#x4E0D;&#x7075;&#x6D3B;&#x4E86;&#xFF0C;&#x6EE1;&#x8DB3;&#x4E0D;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x9700;&#x8981;&#x3002;&#x5982;&#x679C;&#x4FDD;&#x7559;<code class="literal">distance</code>&#x548C;<code class="literal">area</code>&#x540C;&#x65F6;&#x4E5F;&#x4FDD;&#x7559;&#x8FD9;&#x4E2A;<code class="literal">area_point</code>&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;<code class="literal">area_point</code>&#x548C;<code class="literal">distance</code>&#x6709;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E00;&#x65E6;&#x5728;<code class="literal">distance</code>&#x51FD;&#x6570;&#x4E2D;&#x53D1;&#x73B0;&#x4E86;Bug&#xFF0C;&#x6216;&#x8005;&#x8981;&#x5347;&#x7EA7;<code class="literal">distance</code>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x91C7;&#x7528;&#x66F4;&#x9AD8;&#x7684;&#x8BA1;&#x7B97;&#x7CBE;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x4EC5;&#x8981;&#x4FEE;&#x6539;<code class="literal">distance</code>&#xFF0C;&#x8FD8;&#x8981;&#x8BB0;&#x7740;&#x4FEE;&#x6539;<code class="literal">area_point</code>&#xFF0C;&#x540C;&#x7406;&#xFF0C;&#x8981;&#x4FEE;&#x6539;<code class="literal">area</code>&#x4E5F;&#x8981;&#x8BB0;&#x7740;&#x4FEE;&#x6539;<code class="literal">area_point</code>&#xFF0C;&#x7EF4;&#x62A4;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x7684;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x8981;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;<span class="emphasis"><em>&#x5C3D;&#x53EF;&#x80FD;&#x590D;&#x7528;&#xFF08;Reuse&#xFF09;<a id="id2722882" class="indexterm"></a>&#x4EE5;&#x524D;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x907F;&#x514D;&#x5199;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;</em></span>&#x3002;&#x5C01;&#x88C5;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x590D;&#x7528;&#xFF0C;&#x628A;&#x89E3;&#x51B3;&#x5404;&#x79CD;&#x5C0F;&#x95EE;&#x9898;&#x7684;&#x4EE3;&#x7801;&#x5C01;&#x88C5;&#x6210;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x89E3;&#x51B3;&#x7B2C;&#x4E00;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x65F6;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x89E3;&#x51B3;&#x7B2C;&#x4E8C;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x65F6;&#x53EF;&#x4EE5;&#x590D;&#x7528;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x3002;</p><p>&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x628A;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5206;&#x6210;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#x518D;&#x5206;&#x6210;&#x66F4;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4F53;&#x73B0;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x7684;&#x5206;&#x5C42;&#x8BBE;&#x8BA1;&#xFF08;Stratify&#xFF09;<a id="id2722901" class="indexterm"></a>&#x3002;<code class="literal">distance</code>&#x548C;<code class="literal">area</code>&#x662F;&#x4E24;&#x4E2A;&#x5E95;&#x5C42;&#x51FD;&#x6570;&#xFF0C;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x5F88;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;<code class="literal">area_point</code>&#x662F;&#x4E00;&#x4E2A;&#x4E0A;&#x5C42;&#x51FD;&#x6570;&#xFF0C;&#x4E0A;&#x5C42;&#x51FD;&#x6570;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x5E95;&#x5C42;&#x51FD;&#x6570;&#x6765;&#x89E3;&#x51B3;&#x66F4;&#x5927;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E95;&#x5C42;&#x548C;&#x4E0A;&#x5C42;&#x51FD;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x66F4;&#x4E0A;&#x4E00;&#x5C42;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x6700;&#x7EC8;&#x6240;&#x6709;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5730;&#x88AB;<code class="literal">main</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><div class="figure"><a id="id2722937"></a><p class="title"><b>&#x56FE;&#xA0;5.1.&#xA0;&#x51FD;&#x6570;&#x7684;&#x5206;&#x5C42;&#x8BBE;&#x8BA1;</b></p><div class="figure-contents"><div><img src="images/func2.stratify.png" alt="&#x51FD;&#x6570;&#x7684;&#x5206;&#x5C42;&#x8BBE;&#x8BA1;"></div></div></div><br class="figure-break"></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch05s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch05.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch05s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">1.&#xA0;return&#x8BED;&#x53E5;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;3.&#xA0;&#x9012;&#x5F52;</td></tr></tbody></table></div>
</body></html>