<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x9012;&#x5F52;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch05.html" title="&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;"><link rel="prev" href="ch05s02.html" title="2.&#xA0;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;"><link rel="next" href="ch06.html" title="&#x7B2C;&#xA0;6&#xA0;&#x7AE0;&#xA0;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x9012;&#x5F52;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch05s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;5&#xA0;&#x7AE0;&#xA0;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x51FD;&#x6570;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch06.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2722951"></a>3.&#xA0;&#x9012;&#x5F52;</h2></div></div></div><p>&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x9700;&#x8981;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x672C;&#x8EAB;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x9012;&#x5F52;&#x7684;&#xFF08;Recursive&#xFF09;<a id="id2722964" class="indexterm"></a>&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><div class="variablelist"><dl><dt><span class="term">frabjuous</span></dt><dd><p>an adjective used to describe something that is frabjuous.</p></dd></dl></div><p>&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x73A9;&#x7B11;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x5B57;&#x5178;&#x4E0A;&#x770B;&#x5230;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8BCD;&#x6761;&#x80AF;&#x5B9A;&#x8981;&#x6012;&#x4E86;&#x3002;&#x7136;&#x800C;&#x6570;&#x5B66;&#x4E0A;&#x786E;&#x5B9E;&#x6709;&#x5F88;&#x591A;&#x6982;&#x5FF5;&#x662F;&#x7528;&#x5B83;&#x81EA;&#x5DF1;&#x6765;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x6BD4;&#x5982;n&#x7684;&#x9636;&#x4E58;&#xFF08;Factorial&#xFF09;<a id="id2722991" class="indexterm"></a>&#x662F;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x7684;&#xFF1A;n&#x7684;&#x9636;&#x4E58;&#x7B49;&#x4E8E;n&#x4E58;&#x4EE5;n-1&#x7684;&#x9636;&#x4E58;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x5C31;&#x7B97;&#x5B9A;&#x4E49;&#x5B8C;&#x4E86;&#xFF0C;&#x6050;&#x6015;&#x8DDF;&#x4E0A;&#x9762;&#x90A3;&#x4E2A;&#x8BCD;&#x6761;&#x6709;&#x5F02;&#x66F2;&#x540C;&#x5DE5;&#x4E4B;&#x5999;&#x4E86;&#xFF1A;n-1&#x7684;&#x9636;&#x4E58;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;n-1&#x4E58;&#x4EE5;n-2&#x7684;&#x9636;&#x4E58;&#x3002;&#x90A3;n-2&#x7684;&#x9636;&#x4E58;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x6837;&#x4E0B;&#x53BB;&#x6C38;&#x8FDC;&#x4E5F;&#x6CA1;&#x5B8C;&#x3002;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6700;&#x5173;&#x952E;&#x7684;&#x57FA;&#x7840;&#x6761;&#x4EF6;&#xFF08;Base Case&#xFF09;<a id="id2723009" class="indexterm"></a>&#xFF1A;0&#x7684;&#x9636;&#x4E58;&#x7B49;&#x4E8E;1&#x3002;</p><div class="literallayout"><p>0!&#xA0;=&#xA0;1<br>
n!&#xA0;=&#xA0;n&#xA0;&#xB7;&#xA0;(n-1)!</p></div><p>&#x56E0;&#x6B64;&#xFF0C;3!=3*2!&#xFF0C;2!=2*1!&#xFF0C;1!=1*0!=1*1=1&#xFF0C;&#x6B63;&#x56E0;&#x4E3A;&#x6709;&#x4E86;Base Case&#xFF0C;&#x624D;&#x4E0D;&#x4F1A;&#x6C38;&#x8FDC;&#x6CA1;&#x5B8C;&#x5730;&#x6570;&#x4E0B;&#x53BB;&#xFF0C;&#x77E5;&#x9053;&#x4E86;1!=1&#x6211;&#x4EEC;&#x518D;&#x53CD;&#x8FC7;&#x6765;&#x7B97;&#x56DE;&#x53BB;&#xFF0C;2!=2*1!=2*1=2&#xFF0C;3!=3*2!=3*2=6&#x3002;&#x4E0B;&#x9762;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x5B8C;&#x6210;&#x8FD9;&#x4E00;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x9636;&#x4E58;&#x7684;&#x51FD;&#x6570;<code class="literal">factorial</code>&#xFF0C;&#x5148;&#x628A;Base Case&#x8FD9;&#x79CD;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x5199;&#x8FDB;&#x53BB;&#xFF1A;</p><pre class="programlisting">int factorial(int n)
{
	if (n == 0)
		return 1;
}</pre><p>&#x5982;&#x679C;&#x53C2;&#x6570;<code class="literal">n</code>&#x4E0D;&#x662F;0&#x5E94;&#x8BE5;<code class="literal">return</code>&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#xFF0C;&#x5E94;&#x8BE5;<code class="literal">return n*factorial(n-1);</code>&#xFF0C;&#x4E3A;&#x4E86;&#x4E0B;&#x9762;&#x7684;&#x5206;&#x6790;&#x65B9;&#x4FBF;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x51E0;&#x4E2A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x628A;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x62C6;&#x5206;&#x4E00;&#x4E0B;&#xFF1A;</p><pre class="programlisting">int factorial(int n)
{
	if (n == 0)
		return 1;
	else {
		int recurse = factorial(n-1);
		int result = n * recurse;
		return result;
	}
}</pre><p><code class="literal">factorial</code>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5C45;&#x7136;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#xFF1F;&#x662F;&#x7684;&#x3002;&#x81EA;&#x5DF1;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x51FD;&#x6570;&#x79F0;&#x4E3A;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x91CC;&#x7684;<code class="literal">factorial</code>&#x662F;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x51FD;&#x6570;A&#x8C03;&#x7528;&#x51FD;&#x6570;B&#xFF0C;&#x51FD;&#x6570;B&#x53C8;&#x8C03;&#x7528;&#x51FD;&#x6570;A&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x51FD;&#x6570;A&#x95F4;&#x63A5;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x8FF7;&#x60D1;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;<code class="literal">factorial(n-1)</code>&#x8FD9;&#x4E00;&#x6B65;&#x770B;&#x6210;&#x662F;&#x5728;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0D;&#xFF0D;&#x53E6;&#x4E00;&#x4E2A;&#x6709;&#x7740;&#x76F8;&#x540C;&#x51FD;&#x6570;&#x540D;&#x548C;&#x76F8;&#x540C;&#x4EE3;&#x7801;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x8C03;&#x7528;&#x5B83;&#x5C31;&#x662F;&#x8DF3;&#x5230;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x91CC;&#x6267;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FD4;&#x56DE;<code class="literal">factorial(n-1)</code>&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x4EE5;<code class="literal">factorial(3)</code>&#x4E3A;&#x4F8B;&#x5206;&#x6790;&#x6574;&#x4E2A;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><div class="figure"><a id="id2723116"></a><p class="title"><b>&#x56FE;&#xA0;5.2.&#xA0;factorial(3)&#x7684;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/func2.factorial.png" alt="factorial(3)&#x7684;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><p>&#x56FE;&#x4E2D;&#x7528;&#x5B9E;&#x7EBF;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x8C03;&#x7528;&#xFF0C;&#x7528;&#x865A;&#x7EBF;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x8FD4;&#x56DE;&#xFF0C;&#x53F3;&#x4FA7;&#x7684;&#x6846;&#x8868;&#x793A;&#x5728;&#x8C03;&#x7528;&#x548C;&#x8FD4;&#x56DE;&#x8FC7;&#x7A0B;&#x4E2D;&#x5404;&#x5C42;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x53D8;&#x5316;&#x60C5;&#x51B5;&#x3002;</p><div class="orderedlist"><ol type="1"><li><p><code class="literal">main()</code>&#x6709;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;<code class="literal">result</code>&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x6846;&#x8868;&#x793A;&#x3002;</p></li><li><p>&#x8C03;&#x7528;<code class="literal">factorial(3)</code>&#x65F6;&#x8981;&#x5206;&#x914D;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4E8E;&#x662F;&#x5728;<code class="literal">main()</code>&#x7684;&#x4E0B;&#x9762;&#x53C8;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x6846;&#x8868;&#x793A;<code class="literal">factorial(3)</code>&#x7684;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;<code class="literal">n</code>&#x5DF2;&#x521D;&#x59CB;&#x5316;&#x4E3A;3&#x3002;</p></li><li><p><code class="literal">factorial(3)</code>&#x53C8;&#x8C03;&#x7528;<code class="literal">factorial(2)</code>&#xFF0C;&#x53C8;&#x8981;&#x5206;&#x914D;<code class="literal">factorial(2)</code>&#x7684;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x4E8E;&#x662F;&#x5728;<code class="literal">main()</code>&#x548C;<code class="literal">factorial(3)</code>&#x4E0B;&#x9762;&#x53C8;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x6846;&#x3002;<a class="xref" href="ch03s04.html#func.localvar">&#x7B2C;&#xA0;4&#xA0;&#x8282; &#x201C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x4F5C;&#x7528;&#x57DF;&#x201D;</a>&#x8BB2;&#x8FC7;&#xFF0C;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x5206;&#x914D;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x9000;&#x51FA;&#x51FD;&#x6570;&#x65F6;&#x91CA;&#x653E;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;<code class="literal">factorial(3)</code>&#x548C;<code class="literal">factorial(2)</code>&#x662F;&#x4E24;&#x6B21;&#x4E0D;&#x540C;&#x7684;&#x8C03;&#x7528;&#xFF0C;<code class="literal">factorial(3)</code>&#x7684;&#x53C2;&#x6570;<code class="literal">n</code>&#x548C;<code class="literal">factorial(2)</code>&#x7684;&#x53C2;&#x6570;<code class="literal">n</code>&#x5404;&#x6709;&#x5404;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x53EA;&#x5199;&#x4E86;&#x4E00;&#x6B21;&#x53C2;&#x6570;<code class="literal">n</code>&#xFF0C;&#x4F46;&#x8FD0;&#x884C;&#x65F6;&#x5374;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;<code class="literal">n</code>&#x3002;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x8C03;&#x7528;<code class="literal">factorial(2)</code>&#x65F6;<code class="literal">factorial(3)</code>&#x8FD8;&#x6CA1;&#x9000;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x53C2;&#x6570;<code class="literal">n</code>&#x540C;&#x65F6;&#x5B58;&#x5728;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x539F;&#x6765;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x591A;&#x753B;&#x4E00;&#x4E2A;&#x6846;&#x3002;</p></li><li><p>&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x8BF7;&#x8BFB;&#x8005;&#x5BF9;&#x7167;&#x7740;&#x56FE;&#x81EA;&#x5DF1;&#x5206;&#x6790;&#x6574;&#x4E2A;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x3002;&#x8BFB;&#x8005;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x548C;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x7528;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x8BA1;&#x7B97;3!&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x5148;&#x4E00;&#x6B65;&#x6B65;&#x5C55;&#x5F00;&#x7136;&#x540E;&#x518D;&#x4E00;&#x6B65;&#x6B65;&#x6536;&#x56DE;&#x53BB;&#x3002;</p></li></ol></div><p>&#x6211;&#x4EEC;&#x770B;&#x4E0A;&#x56FE;&#x53F3;&#x4FA7;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x968F;&#x7740;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x5C42;&#x5C42;&#x6DF1;&#x5165;&#xFF0C;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x4E00;&#x7AEF;&#x9010;&#x6E10;&#x589E;&#x957F;&#xFF0C;&#x7136;&#x540E;&#x968F;&#x7740;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x5C42;&#x5C42;&#x8FD4;&#x56DE;&#xFF0C;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x8FD9;&#x4E00;&#x7AEF;&#x53C8;&#x9010;&#x6E10;&#x7F29;&#x77ED;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x65F6;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x8FD9;&#x4E00;&#x7AEF;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5185;&#x90E8;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;<code class="literal">factorial(2)</code>&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4F4D;&#x4E8E;&#x672B;&#x7AEF;&#x65F6;&#xFF0C;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;<code class="literal">factorial(3)</code>&#x548C;<code class="literal">main()</code>&#x7684;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x5177;&#x6709;&#x8FD9;&#x79CD;&#x6027;&#x8D28;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x79F0;&#x4E3A;&#x5806;&#x6808;&#x6216;&#x6808;&#xFF08;Stack&#xFF09;<a id="id2723347" class="indexterm"></a>&#xFF0C;&#x968F;&#x7740;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x548C;&#x8FD4;&#x56DE;&#x800C;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x8FD9;&#x4E00;&#x7AEF;&#x79F0;&#x4E3A;&#x6808;&#x9876;&#xFF0C;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF08;&#x4E0A;&#x56FE;&#x7684;&#x6BCF;&#x4E2A;&#x5C0F;&#x65B9;&#x6846;&#xFF09;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#xFF08;Stack Frame&#xFF09;<a id="id2723357" class="indexterm"></a>&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E3A;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x9884;&#x7559;&#x4E86;&#x4E00;&#x5757;&#x6808;&#x7A7A;&#x95F4;&#xFF0C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x5C31;&#x5728;&#x8FD9;&#x4E2A;&#x6808;&#x7A7A;&#x95F4;&#x91CC;&#x5206;&#x914D;&#x6808;&#x5E27;&#xFF0C;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x5C31;&#x91CA;&#x653E;&#x6808;&#x5E27;&#x3002;</p><p>&#x5728;&#x5199;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x4F60;&#x5982;&#x4F55;&#x8BC1;&#x660E;&#x5B83;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF1F;&#x50CF;&#x4E0A;&#x9762;&#x90A3;&#x6837;&#x8DDF;&#x8E2A;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x548C;&#x8FD4;&#x56DE;&#x8FC7;&#x7A0B;&#x7B97;&#x662F;&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#xFF0C;&#x4F46;&#x53EA;&#x662F;<code class="literal">factorial(3)</code>&#x5C31;&#x5DF2;&#x7ECF;&#x8FD9;&#x4E48;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x662F;<code class="literal">factorial(100)</code>&#x5462;&#xFF1F;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BC1;&#x660E;&#x4E86;<code class="literal">factorial(3)</code>&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8DDF;&#x6211;&#x4EEC;&#x7528;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x8BA1;&#x7B97;&#x7684;&#x8FC7;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;&#x7ED3;&#x679C;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x80FD;&#x4EE3;&#x66FF;<code class="literal">factorial(100)</code>&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x522B;&#x7684;&#x51FD;&#x6570;&#x4F60;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x5B83;&#x7684;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x53BB;&#x8BC1;&#x660E;&#x5B83;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x53EA;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#x5C31;&#x8FD4;&#x56DE;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x9012;&#x5F52;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E48;&#x8DDF;&#x4E0B;&#x53BB;&#x53EA;&#x4F1A;&#x8DDF;&#x5F97;&#x4F60;&#x5934;&#x90FD;&#x5927;&#x4E86;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x5E76;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x90FD;&#x9700;&#x8981;&#x94BB;&#x8FDB;&#x53BB;&#x770B;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8C03;&#x7528;<code class="literal">printf</code>&#x65F6;&#x6CA1;&#x6709;&#x94BB;&#x8FDB;&#x53BB;&#x770B;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x6253;&#x5370;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;<span class="emphasis"><em>&#x76F8;&#x4FE1;</em></span>&#x5B83;&#x80FD;&#x6253;&#x5370;&#xFF0C;&#x80FD;&#x6B63;&#x786E;&#x5B8C;&#x6210;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x7EE7;&#x7EED;&#x5199;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5199;&#x4E86;<code class="literal">distance</code>&#x548C;<code class="literal">area</code>&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x7ACB;&#x523B;&#x6D4B;&#x8BD5;&#x8BC1;&#x660E;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5199;<code class="literal">area_point</code>&#x65F6;&#x8C03;&#x7528;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#xFF1A;</p><pre class="programlisting">return area(distance(x1, y1, x2, y2));</pre><p>&#x5728;&#x5199;&#x8FD9;&#x4E00;&#x53E5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x94BB;&#x8FDB;<code class="literal">distance</code>&#x548C;<code class="literal">area</code>&#x51FD;&#x6570;&#x4E2D;&#x53BB;&#x8D70;&#x4E00;&#x8D9F;&#x624D;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x8C03;&#x7528;&#x5F97;&#x662F;&#x5426;&#x6B63;&#x786E;&#x5417;&#xFF1F;&#x4E0D;&#x9700;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;<span class="emphasis"><em>&#x76F8;&#x4FE1;</em></span>&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x80FD;&#x6B63;&#x786E;&#x5DE5;&#x4F5C;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x76F8;&#x4FE1;&#x628A;&#x5EA7;&#x6807;&#x4F20;&#x7ED9;<code class="literal">distance</code>&#x5B83;&#x5C31;&#x80FD;&#x8FD4;&#x56DE;&#x6B63;&#x786E;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x628A;&#x534A;&#x5F84;&#x4F20;&#x7ED9;<code class="literal">area</code>&#x5B83;&#x5C31;&#x80FD;&#x8FD4;&#x56DE;&#x6B63;&#x786E;&#x7684;&#x9762;&#x79EF;&#xFF0C;&#x56E0;&#x6B64;&#x8C03;&#x7528;&#x5B83;&#x4EEC;&#x53BB;&#x5B8C;&#x6210;&#x53E6;&#x5916;&#x4E00;&#x4EF6;&#x5DE5;&#x4F5C;&#x4E5F;&#x5E94;&#x8BE5;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x201C;<span class="quote">&#x76F8;&#x4FE1;</span>&#x201D;&#x79F0;&#x4E3A;Leap of Faith<a id="id2723481" class="indexterm"></a>&#xFF0C;&#x9996;&#x5148;&#x76F8;&#x4FE1;&#x4E00;&#x4E9B;&#x7ED3;&#x8BBA;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528;&#x5B83;&#x4EEC;&#x53BB;&#x8BC1;&#x660E;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x7ED3;&#x8BBA;&#x3002;</p><p>&#x5728;&#x5199;<code class="literal">factorial(n)</code>&#x7684;&#x4EE3;&#x7801;&#x65F6;&#x5199;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#xFF1A;</p><pre class="programlisting">...
int recurse = factorial(n-1);
int result = n * recurse;
...</pre><p>&#x8FD9;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;<code class="literal">factorial(n-1)</code>&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x76F8;&#x4FE1;&#x4F20;&#x7ED9;&#x5B83;<code class="literal">n-1</code>&#x5B83;&#x5C31;&#x80FD;&#x8FD4;&#x56DE;(n-1)!&#xFF0C;&#x90A3;&#x4E48;<code class="literal">recurse</code>&#x5C31;&#x662F;(n-1)!&#xFF0C;&#x90A3;&#x4E48;<code class="literal">result</code>&#x5C31;&#x662F;n*(n-1)!&#xFF0C;&#x4E5F;&#x5C31;&#x662F;n!&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x8FD4;&#x56DE;&#x7684;<code class="literal">factorial(n)</code>&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x6709;&#x70B9;&#x5947;&#x602A;&#xFF1A;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x5199;&#x5B8C;<code class="literal">factorial</code>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x51ED;&#x4EC0;&#x4E48;&#x8981;&#x76F8;&#x4FE1;<code class="literal">factorial(n-1)</code>&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF1F;&#x53EF;Leap of Faith&#x672C;&#x8EAB;&#x5C31;&#x662F;Leap&#xFF08;&#x8DF3;&#x8DC3;&#xFF09;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;<span class="emphasis"><em>&#x5982;&#x679C;&#x4F60;&#x76F8;&#x4FE1;&#x4F60;&#x6B63;&#x5728;&#x5199;&#x7684;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x5E76;&#x8C03;&#x7528;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x5199;&#x5B8C;&#x8FD9;&#x4E2A;&#x9012;&#x5F52;&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4F1A;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4ECE;&#x800C;&#x503C;&#x5F97;&#x4F60;&#x76F8;&#x4FE1;&#x5B83;&#x6B63;&#x786E;&#x3002;</em></span></p><p>&#x8FD9;&#x4E48;&#x8BF4;&#x597D;&#x50CF;&#x6709;&#x70B9;&#x513F;&#x7384;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x6570;&#x5B66;&#x4E0A;&#x4E25;&#x683C;&#x8BC1;&#x660E;&#x4E00;&#x4E0B;<code class="literal">factorial</code>&#x51FD;&#x6570;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;&#x521A;&#x624D;&#x8BF4;&#x4E86;&#xFF0C;<code class="literal">factorial(n)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#x4F9D;&#x8D56;&#x4E8E;<code class="literal">factorial(n-1)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x53EA;&#x8981;&#x540E;&#x8005;&#x6B63;&#x786E;&#xFF0C;&#x5728;&#x540E;&#x8005;&#x7684;&#x7ED3;&#x679C;&#x4E0A;&#x4E58;&#x4E2A;<code class="literal">n</code>&#x8FD4;&#x56DE;&#x8FD9;&#x4E00;&#x6B65;&#x663E;&#x7136;&#x4E5F;&#x6CA1;&#x6709;&#x7591;&#x95EE;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x5C31;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x8981;&#x8BC1;&#x660E;<code class="literal">factorial(n)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#x5C31;&#x662F;&#x8981;&#x8BC1;&#x660E;<code class="literal">factorial(n-1)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x540C;&#x7406;&#xFF0C;&#x8981;&#x8BC1;&#x660E;<code class="literal">factorial(n-1)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#x5C31;&#x662F;&#x8981;&#x8BC1;&#x660E;<code class="literal">factorial(n-2)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x4E0B;&#x53BB;&#xFF0C;&#x6700;&#x540E;&#x662F;&#xFF1A;&#x8981;&#x8BC1;&#x660E;<code class="literal">factorial(1)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#x5C31;&#x662F;&#x8981;&#x8BC1;&#x660E;<code class="literal">factorial(0)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;&#x800C;<code class="literal">factorial(0)</code>&#x7684;&#x6B63;&#x786E;&#x6027;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x522B;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x5206;&#x652F;<code class="literal">return 1;</code>&#xFF0C;&#x8FD9;&#x4E2A;1&#x662F;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x9636;&#x4E58;&#x7684;&#x5B9A;&#x4E49;&#x5199;&#x7684;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x56E0;&#x6B64;<code class="literal">factorial(1)</code>&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x56E0;&#x6B64;<code class="literal">factorial(2)</code>&#x4E5F;&#x6B63;&#x786E;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x6700;&#x540E;<code class="literal">factorial(n)</code>&#x4E5F;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x5C31;&#x662F;&#x5728;&#x4E2D;&#x5B66;&#x65F6;&#x5B66;&#x7684;&#x6570;&#x5B66;&#x5F52;&#x7EB3;&#x6CD5;&#xFF08;Mathematical Induction&#xFF09;<a id="id2723665" class="indexterm"></a>&#xFF0C;&#x7528;&#x6570;&#x5B66;&#x5F52;&#x7EB3;&#x6CD5;&#x6765;&#x8BC1;&#x660E;&#x53EA;&#x9700;&#x8981;&#x8BC1;&#x660E;&#x4E24;&#x70B9;&#xFF1A;Base Case&#x6B63;&#x786E;&#xFF0C;&#x9012;&#x63A8;&#x5173;&#x7CFB;&#x6B63;&#x786E;&#x3002;<span class="emphasis"><em>&#x5199;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x65F6;&#x4E00;&#x5B9A;&#x8981;&#x8BB0;&#x5F97;&#x5199;Base Case</em></span>&#xFF0C;&#x5426;&#x5219;&#x5373;&#x4F7F;&#x9012;&#x63A8;&#x5173;&#x7CFB;&#x6B63;&#x786E;&#xFF0C;&#x6574;&#x4E2A;&#x51FD;&#x6570;&#x4E5F;&#x4E0D;&#x6B63;&#x786E;&#x3002;&#x5982;&#x679C;<code class="literal">factorial</code>&#x51FD;&#x6570;&#x6F0F;&#x6389;&#x4E86;Base Case&#xFF1A;</p><pre class="programlisting">int factorial(int n)
{
	int recurse = factorial(n-1);
	int result = n * recurse;
	return result;
}</pre><p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x6C38;&#x8FDC;&#x8C03;&#x7528;&#x4E0B;&#x53BB;&#xFF0C;&#x76F4;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E3A;&#x7A0B;&#x5E8F;&#x9884;&#x7559;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x8017;&#x5C3D;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#xFF08;&#x6BB5;&#x9519;&#x8BEF;&#xFF09;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x65E0;&#x7A77;&#x9012;&#x5F52;&#xFF08;Infinite recursion&#xFF09;<a id="id2723697" class="indexterm"></a>&#x3002;</p><p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x53EA;&#x5B66;&#x4E60;&#x4E86;&#x5168;&#x90E8;C&#x8BED;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x544A;&#x8BC9;&#x4F60;&#xFF1A;&#x8FD9;&#x4E2A;&#x5B50;&#x96C6;&#x662F;&#x5B8C;&#x5907;&#x7684;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E86;&#xFF0C;&#x4EE5;&#x540E;&#x8FD8;&#x8981;&#x5B66;&#x4E60;&#x5F88;&#x591A;C&#x8BED;&#x8A00;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x5168;&#x90E8;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x5DF2;&#x7ECF;&#x5B66;&#x8FC7;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x6765;&#x4EE3;&#x66FF;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4EE5;&#x540E;&#x8981;&#x5B66;&#x7684;C&#x8BED;&#x8A00;&#x7279;&#x6027;&#x4F1A;&#x4F7F;&#x4EE3;&#x7801;&#x5199;&#x8D77;&#x6765;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x5B66;&#x7684;&#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x5B8C;&#x5168;&#x8986;&#x76D6;&#x4E86;<a class="xref" href="intro.program.html" title="1.&#xA0;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x201D;</a>&#x8BB2;&#x7684;&#x4E94;&#x79CD;&#x57FA;&#x672C;&#x6307;&#x4EE4;&#x4E86;&#x3002;&#x6709;&#x7684;&#x8BFB;&#x8005;&#x4F1A;&#x8BF4;&#x5FAA;&#x73AF;&#x8FD8;&#x6CA1;&#x8BB2;&#x5230;&#x5462;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x5FAA;&#x73AF;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x624D;&#x8BB2;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7ED3;&#x8BBA;&#x5C31;&#x662F;<span class="emphasis"><em>&#x9012;&#x5F52;&#x548C;&#x5FAA;&#x73AF;&#x662F;&#x7B49;&#x4EF7;&#x7684;</em></span>&#xFF0C;&#x7528;&#x5FAA;&#x73AF;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x7528;&#x9012;&#x5F52;&#x90FD;&#x80FD;&#x505A;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;&#x6BD4;&#x5982;&#x67D0;&#x4E9B;LISP&#x5B9E;&#x73B0;&#xFF09;&#x53EA;&#x6709;&#x9012;&#x5F52;&#x800C;&#x6CA1;&#x6709;&#x5FAA;&#x73AF;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x6307;&#x4EE4;&#x80FD;&#x505A;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5B58;&#x53D6;&#x3001;&#x8FD0;&#x7B97;&#x3001;&#x6D4B;&#x8BD5;&#x548C;&#x5206;&#x652F;&#x3001;&#x5FAA;&#x73AF;&#xFF08;&#x6216;&#x9012;&#x5F52;&#xFF09;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x6700;&#x7EC8;&#x4E5F;&#x8981;&#x7FFB;&#x8BD1;&#x6210;&#x6307;&#x4EE4;&#xFF0C;&#x6307;&#x4EE4;&#x505A;&#x4E0D;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x80AF;&#x5B9A;&#x4E5F;&#x505A;&#x4E0D;&#x5230;&#xFF0C;&#x867D;&#x7136;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x8BED;&#x6CD5;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x4E5F;&#x53EA;&#x662F;&#x6BD4;&#x6307;&#x4EE4;&#x5199;&#x8D77;&#x6765;&#x66F4;&#x65B9;&#x4FBF;&#x800C;&#x5DF2;&#xFF0C;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x4E00;&#x6837;&#x591A;&#x7684;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8BA1;&#x7B97;&#x673A;&#x8981;&#x8BBE;&#x8BA1;&#x6210;&#x8FD9;&#x6837;&#xFF1F;&#x5728;&#x8BBE;&#x8BA1;&#x65F6;&#x600E;&#x4E48;&#x60F3;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x8FD9;&#x51E0;&#x6837;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x591A;&#x6216;&#x66F4;&#x5C11;&#x7684;&#x529F;&#x80FD;&#xFF1F;&#x8FD9;&#x4E9B;&#x8981;&#x5F52;&#x529F;&#x4E8E;&#x65E9;&#x671F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#xFF0C;&#x4F8B;&#x5982;Alan Turing&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x8FD8;&#x6CA1;&#x6709;&#x8BDE;&#x751F;&#x7684;&#x5E74;&#x4EE3;&#x5C31;&#x4ECE;&#x6570;&#x5B66;&#x7406;&#x8BBA;&#x4E0A;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8BBE;&#x8BA1;&#x6307;&#x660E;&#x4E86;&#x65B9;&#x5411;&#x3002;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6709;&#x5173;&#x8BA1;&#x7B97;&#x7406;&#x8BBA;&#x7684;&#x6559;&#x6750;&#xFF0C;&#x4F8B;&#x5982;<a class="xref" href="bi01.html#bibli.iatlc" title="Introduction to Automata Theory, Languages, and Computation">[<abbr class="abbrev">IATLC</abbr>]</a>&#x3002;</p><p>&#x9012;&#x5F52;&#x7EDD;&#x4E0D;&#x53EA;&#x662F;&#x4E3A;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x5947;&#x6280;&#x6DEB;&#x5DE7;&#x7684;&#x6570;&#x5B66;&#x9898;<sup>[<a id="id2723765" href="#ftn.id2723765" class="footnote">8</a>]</sup>&#x800C;&#x60F3;&#x51FA;&#x6765;&#x7684;&#x62DB;&#xFF0C;&#x5B83;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7CBE;&#x9AD3;&#x6240;&#x5728;&#xFF0C;&#x4E5F;&#x662F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x7CBE;&#x9AD3;&#x6240;&#x5728;&#x3002;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x5728;C&#x7684;&#x8BED;&#x6CD5;&#x65F6;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x5F88;&#x591A;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x4E86;&#xFF0C;&#x4F8B;&#x5982;&#x5728;<a class="xref" href="ch03s01.html#func.mathfunc">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x201D;</a>&#x8BB2;&#x8FC7;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x201C;<span class="quote">&#x8868;&#x8FBE;&#x5F0F;</span>&#x201D;&#x5C31;&#x662F;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x7684;&#xFF1A;</p><div class="literallayout"><p><span class="emphasis"><em>&#x8868;&#x8FBE;&#x5F0F;</em></span>&#xA0;&#x2192;&#xA0;<span class="emphasis"><em>&#x8868;&#x8FBE;&#x5F0F;</em></span>(&#x53C2;&#x6570;&#x5217;&#x8868;)<br>
&#x53C2;&#x6570;&#x5217;&#x8868;&#xA0;&#x2192;&#xA0;<span class="emphasis"><em>&#x8868;&#x8FBE;&#x5F0F;</em></span>,&#xA0;<span class="emphasis"><em>&#x8868;&#x8FBE;&#x5F0F;</em></span>,&#xA0;...</p></div><p>&#x518D;&#x6BD4;&#x5982;&#x5728;<a class="xref" href="ch04s01.html#cond.if">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;if&#x8BED;&#x53E5;&#x201D;</a>&#x8BB2;&#x8FC7;&#x7684;&#x8BED;&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x201C;<span class="quote">&#x8BED;&#x53E5;</span>&#x201D;&#x4E5F;&#x662F;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x7684;&#xFF1A;</p><div class="literallayout"><p><span class="emphasis"><em>&#x8BED;&#x53E5;</em></span>&#xA0;&#x2192;&#xA0;if&#xA0;(&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;)&#xA0;<span class="emphasis"><em>&#x8BED;&#x53E5;</em></span></p></div><p>&#x53EF;&#x89C1;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x89E3;&#x6790;&#x6211;&#x4EEC;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x65F6;&#x4E00;&#x5B9A;&#x4E5F;&#x7528;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x9012;&#x5F52;&#xFF0C;&#x6709;&#x5173;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x53EF;&#x53C2;&#x8003;<a class="xref" href="bi01.html#bibli.dragonbook" title="Compilers: Principles, Techniques, &amp; Tools">[<abbr class="abbrev">Dragon Book</abbr>]</a>&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2723842"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x6C42;&#x4E24;&#x4E2A;&#x6B63;&#x6574;&#x6570;<code class="literal">a</code>&#x548C;<code class="literal">b</code>&#x7684;&#x6700;&#x5927;&#x516C;&#x7EA6;&#x6570;&#xFF08;GCD&#xFF0C;Greatest Common Divisor&#xFF09;<a id="id2723863" class="indexterm"></a>&#xFF0C;&#x4F7F;&#x7528;Euclid&#x7B97;&#x6CD5;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x5982;&#x679C;<code class="literal">a</code>&#x9664;&#x4EE5;<code class="literal">b</code>&#x80FD;&#x6574;&#x9664;&#xFF0C;&#x5219;&#x6700;&#x5927;&#x516C;&#x7EA6;&#x6570;&#x662F;<code class="literal">b</code>&#x3002;</p></li><li><p>&#x5426;&#x5219;&#xFF0C;&#x6700;&#x5927;&#x516C;&#x7EA6;&#x6570;&#x7B49;&#x4E8E;<code class="literal">b</code>&#x548C;<code class="literal">a%b</code>&#x7684;&#x6700;&#x5927;&#x516C;&#x7EA6;&#x6570;&#x3002;</p></li></ol></div><p>Euclid&#x7B97;&#x6CD5;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x8BC1;&#x660E;&#x7684;&#xFF0C;&#x8BF7;&#x8BFB;&#x8005;&#x81EA;&#x5DF1;&#x8BC1;&#x660E;&#x4E00;&#x4E0B;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x7B97;&#x5C31;&#x80FD;&#x7B97;&#x51FA;&#x6700;&#x5927;&#x516C;&#x7EA6;&#x6570;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4FEE;&#x6539;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4F7F;&#x4E4B;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x6574;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6B63;&#x6574;&#x6570;&#x3002;</p><p>2&#x3001;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x6C42;Fibonacci&#x6570;&#x5217;&#x7684;&#x7B2C;<code class="literal">n</code>&#x9879;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5217;&#x662F;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x7684;&#xFF1A;</p><div class="literallayout"><p>fib(0)=1<br>
fib(1)=1<br>
fib(n)=fib(n-1)+fib(n-2)</p></div><p>&#x4E0A;&#x9762;&#x4E24;&#x4E2A;&#x770B;&#x4F3C;&#x6BEB;&#x4E0D;&#x76F8;&#x5E72;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x5374;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x8054;&#x7CFB;&#xFF1A;</p><div class="variablelist"><dl><dt><span class="term">Lam&#xE9;&#x5B9A;&#x7406;</span></dt><dd><p>&#x5982;&#x679C;Euclid&#x7B97;&#x6CD5;&#x9700;&#x8981;k&#x6B65;&#x6765;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x6570;&#x7684;GCD&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#x4E4B;&#x4E2D;&#x8F83;&#x5C0F;&#x7684;&#x4E00;&#x4E2A;&#x5FC5;&#x7136;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;Fibonacci&#x6570;&#x5217;&#x7684;&#x7B2C;k&#x9879;&#x3002;</p></dd></dl></div><p>&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a class="xref" href="bi01.html#bibli.sicp" title="Structure and Interpretation of Computer Programs">[<abbr class="abbrev">SICP</abbr>]</a>&#x7B2C;1.2&#x8282;&#x7684;&#x7B80;&#x7565;&#x8BC1;&#x660E;&#x3002;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2723765" href="#id2723765" class="para">8</a>] </sup>&#x4F8B;&#x5982;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x4E66;&#x90FD;&#x4F1A;&#x4E3E;&#x4F8B;&#x7684;&#x6C49;&#x8BFA;&#x5854;&#x95EE;&#x9898;&#xFF0C;&#x672C;&#x4E66;&#x4E0D;&#x6253;&#x7B97;&#x518D;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x4E86;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch05s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch05.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch06.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;&#x589E;&#x91CF;&#x5F0F;&#x5F00;&#x53D1;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;6&#xA0;&#x7AE0;&#xA0;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;</td></tr></tbody></table></div>
</body></html>