<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;while&#x8BED;&#x53E5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch06.html" title="&#x7B2C;&#xA0;6&#xA0;&#x7AE0;&#xA0;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;"><link rel="prev" href="ch06.html" title="&#x7B2C;&#xA0;6&#xA0;&#x7AE0;&#xA0;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;"><link rel="next" href="ch06s02.html" title="2.&#xA0;do/while&#x8BED;&#x53E5;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;while&#x8BED;&#x53E5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch06.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;6&#xA0;&#x7AE0;&#xA0;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch06s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2726104"></a>1.&#xA0;while&#x8BED;&#x53E5;</h2></div></div></div><p>&#x5728;<a class="xref" href="ch05s03.html#func2.recursion">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x9012;&#x5F52;&#x201D;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;&#x7528;&#x9012;&#x5F52;&#x6C42;n!&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x5B9E;&#x6BCF;&#x6B21;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x90FD;&#x5728;&#x91CD;&#x590D;&#x505A;&#x540C;&#x6837;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x5C31;&#x662F;&#x628A;n&#x4E58;&#x5230;(n-1)!&#x4E0A;&#x7136;&#x540E;&#x628A;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x3002;&#x867D;&#x8BF4;&#x662F;&#x91CD;&#x590D;&#xFF0C;&#x4F46;&#x6BCF;&#x6B21;&#x505A;&#x90FD;&#x7A0D;&#x5FAE;&#x6709;&#x4E00;&#x70B9;&#x533A;&#x522B;&#xFF08;<code class="literal">n</code>&#x7684;&#x503C;&#x4E0D;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x6BCF;&#x6B21;&#x90FD;&#x6709;&#x4E00;&#x70B9;&#x533A;&#x522B;&#x7684;&#x91CD;&#x590D;&#x5DE5;&#x4F5C;&#x79F0;&#x4E3A;&#x8FED;&#x4EE3;&#xFF08;Iteration&#xFF09;<a id="id2725493" class="indexterm"></a>&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x8BA9;&#x5B83;&#x505A;&#x91CD;&#x590D;&#x8FED;&#x4EE3;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x628A;&#x4E00;&#x4EF6;&#x5DE5;&#x4F5C;&#x91CD;&#x590D;&#x505A;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x6B21;&#x800C;&#x4E0D;&#x51FA;&#x9519;&#x6B63;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x6700;&#x64C5;&#x957F;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x4EBA;&#x7C7B;&#x6700;&#x4E0D;&#x64C5;&#x957F;&#x7684;&#x3002;&#x867D;&#x7136;&#x8FED;&#x4EE3;&#x7528;&#x9012;&#x5F52;&#x6765;&#x505A;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x4F46;C&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x4F7F;&#x8FED;&#x4EE3;&#x7A0B;&#x5E8F;&#x5199;&#x8D77;&#x6765;&#x66F4;&#x65B9;&#x4FBF;&#x3002;&#x4F8B;&#x5982;<code class="literal">factorial</code>&#x7528;<code class="literal">while</code>&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#xFF1A;</p><pre class="programlisting">int factorial(int n)
{
	int result = 1;
	while (n &gt; 0) {
		result = result * n;
		n = n - 1;
	}
	return result;
}</pre><p>&#x548C;<code class="literal">if</code>&#x8BED;&#x53E5;&#x7C7B;&#x4F3C;&#xFF0C;<code class="literal">while</code>&#x8BED;&#x53E5;&#x7531;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x4E00;&#x4E2A;&#x5B50;&#x8BED;&#x53E5;&#x7EC4;&#x6210;&#xFF0C;&#x5B50;&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x662F;&#x7531;&#x82E5;&#x5E72;&#x6761;&#x8BED;&#x53E5;&#x7EC4;&#x6210;&#x7684;&#x8BED;&#x53E5;&#x5757;&#x3002;</p><div class="literallayout"><p>&#x8BED;&#x53E5;&#xA0;&#x2192;&#xA0;while&#xA0;(&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;)&#xA0;&#x8BED;&#x53E5;</p></div><p>&#x5982;&#x679C;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x4E3A;&#x771F;&#xFF0C;&#x5B50;&#x8BED;&#x53E5;&#x5C31;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6B21;&#x6D4B;&#x8BD5;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x771F;&#xFF0C;&#x5C31;&#x628A;&#x5B50;&#x8BED;&#x53E5;&#x518D;&#x6267;&#x884C;&#x4E00;&#x904D;&#xFF0C;&#x518D;&#x6D4B;&#x8BD5;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x2026;&#x2026;&#x8FD9;&#x79CD;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x79F0;&#x4E3A;&#x5FAA;&#x73AF;&#xFF08;Loop&#xFF09;<a id="id2726166" class="indexterm"></a>&#xFF0C;&#x5B50;&#x8BED;&#x53E5;&#x79F0;&#x4E3A;&#x5FAA;&#x73AF;&#x4F53;&#x3002;&#x5982;&#x679C;&#x67D0;&#x6B21;&#x6D4B;&#x8BD5;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x4E3A;&#x5047;&#xFF0C;&#x5C31;&#x8DF3;&#x51FA;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x540E;&#x9762;&#x7684;<code class="literal">return</code>&#x8BED;&#x53E5;&#xFF0C;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x6B21;&#x6D4B;&#x8BD5;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x5C31;&#x662F;&#x5047;&#xFF0C;&#x90A3;&#x4E48;&#x76F4;&#x63A5;&#x8DF3;&#x5230;<code class="literal">return</code>&#x8BED;&#x53E5;&#xFF0C;&#x5FAA;&#x73AF;&#x4F53;&#x4E00;&#x6B21;&#x90FD;&#x4E0D;&#x6267;&#x884C;&#x3002;</p><p>&#x53D8;&#x91CF;<code class="literal">result</code>&#x5728;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x7D2F;&#x52A0;&#x5668;&#xFF08;Accumulator&#xFF09;<a id="id2726198" class="indexterm"></a>&#xFF0C;&#x628A;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x7684;&#x4E2D;&#x95F4;&#x7ED3;&#x679C;&#x7D2F;&#x79EF;&#x8D77;&#x6765;&#xFF0C;&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#x540E;&#x5F97;&#x5230;&#x7684;&#x7D2F;&#x79EF;&#x503C;&#x5C31;&#x662F;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x7528;&#x4E58;&#x6CD5;&#x6765;&#x7D2F;&#x79EF;&#x7684;&#xFF0C;&#x6240;&#x4EE5;<code class="literal">result</code>&#x7684;&#x521D;&#x503C;&#x662F;1&#xFF0C;&#x5982;&#x679C;&#x7528;&#x52A0;&#x6CD5;&#x7D2F;&#x79EF;&#x5219;<code class="literal">result</code>&#x7684;&#x521D;&#x503C;&#x5E94;&#x8BE5;&#x662F;0&#x3002;&#x53D8;&#x91CF;<code class="literal">n</code>&#x662F;&#x5FAA;&#x73AF;&#x53D8;&#x91CF;&#xFF08;Loop Variable&#xFF09;<a id="id2726227" class="indexterm"></a>&#xFF0C;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x8981;&#x6539;&#x53D8;&#x5B83;&#x7684;&#x503C;&#xFF0C;&#x5728;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x8981;&#x6D4B;&#x8BD5;&#x5B83;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x4E24;&#x70B9;&#x5408;&#x8D77;&#x6765;&#x8D77;&#x5230;&#x63A7;&#x5236;&#x5FAA;&#x73AF;&#x6B21;&#x6570;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;<code class="literal">n</code>&#x7684;&#x503C;&#x662F;&#x9012;&#x51CF;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x4E9B;&#x5FAA;&#x73AF;&#x91C7;&#x7528;&#x9012;&#x589E;&#x7684;&#x5FAA;&#x73AF;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5178;&#x578B;&#x6027;&#xFF0C;&#x7D2F;&#x52A0;&#x5668;&#x548C;&#x5FAA;&#x73AF;&#x53D8;&#x91CF;&#x8FD9;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x90FD;&#x5F88;&#x5E38;&#x89C1;&#x3002;</p><p>&#x53EF;&#x89C1;&#xFF0C;&#x9012;&#x5F52;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x7528;&#x5FAA;&#x73AF;&#x4E5F;&#x80FD;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x8DEF;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x7528;&#x9012;&#x5F52;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x9760;&#x7684;&#x662F;&#x9012;&#x63A8;&#x5173;&#x7CFB;n!=n&#xB7;(n-1)!&#xFF0C;&#x7528;&#x5FAA;&#x73AF;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5219;&#x66F4;&#x50CF;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x5C55;&#x5F00;&#x4E86;&#xFF1A;n!=n&#xB7;(n-1)&#xB7;(n-2)&#xB7;&#x2026;&#xB7;3&#xB7;2&#xB7;1&#x3002;&#x628A;&#x516C;&#x5F0F;&#x5C55;&#x5F00;&#x4E86;&#x7406;&#x89E3;&#x4F1A;&#x66F4;&#x76F4;&#x89C2;&#x4E00;&#x4E9B;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x5FAA;&#x73AF;&#x7A0B;&#x5E8F;&#x6BD4;&#x9012;&#x5F52;&#x7A0B;&#x5E8F;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x4F46;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x516C;&#x5F0F;&#x8981;&#x5C55;&#x5F00;&#x662F;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x751A;&#x81F3;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x53CD;&#x5012;&#x662F;&#x9012;&#x63A8;&#x5173;&#x7CFB;&#x66F4;&#x76F4;&#x89C2;&#x4E00;&#x4E9B;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x9012;&#x5F52;&#x7A0B;&#x5E8F;&#x6BD4;&#x5FAA;&#x73AF;&#x7A0B;&#x5E8F;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x6B64;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x4E0D;&#x540C;&#xFF1A;&#x770B;<a class="xref" href="ch05s03.html#func2.factorial">&#x56FE;&#xA0;5.2 &#x201C;factorial(3)&#x7684;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x201D;</a>&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x867D;&#x7136;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x4E86;&#x5F88;&#x591A;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x90FD;&#x53EA;&#x5728;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x8D4B;&#x503C;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53D1;&#x751F;&#x8FC7;&#x6539;&#x53D8;&#xFF0C;&#x800C;&#x4E0A;&#x9762;&#x7684;&#x5FAA;&#x73AF;&#x7A0B;&#x5E8F;&#x5219;&#x901A;&#x8FC7;&#x5BF9;<code class="literal">n</code>&#x548C;<code class="literal">result</code>&#x8FD9;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x591A;&#x6B21;&#x8D4B;&#x503C;&#x6765;&#x8FBE;&#x5230;&#x540C;&#x6837;&#x7684;&#x76EE;&#x7684;&#x3002;&#x524D;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#x79F0;&#x4E3A;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#xFF08;Functional Programming&#xFF09;<a id="id2726291" class="indexterm"></a>&#xFF0C;&#x800C;&#x540E;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#x79F0;&#x4E3A;&#x547D;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#xFF08;Imperative Programming&#xFF09;<a id="id2726299" class="indexterm"></a>&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x522B;&#x7C7B;&#x4F3C;&#x4E8E;<a class="xref" href="intro.program.html" title="1.&#xA0;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x201D;</a>&#x8BB2;&#x7684;Declarative&#x548C;Imperative&#x7684;&#x533A;&#x522B;&#x3002;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x201C;<span class="quote">&#x51FD;&#x6570;</span>&#x201D;&#x7C7B;&#x4F3C;&#x4E8E;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x56DE;&#x987E;&#x4E00;&#x4E0B;<a class="xref" href="ch03s01.html#func.mathfunc">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x201D;</a>&#x6240;&#x8BB2;&#x7684;&#xFF0C;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x662F;&#x6CA1;&#x6709;Side Effect&#x7684;&#xFF0C;&#x800C;C&#x8BED;&#x8A00;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x6709;Side Effect&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x4FEE;&#x6539;&#x67D0;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x5C31;&#x662F;&#x4E00;&#x79CD;Side Effect&#x3002;<a class="xref" href="ch03s04.html#func.localvar">&#x7B2C;&#xA0;4&#xA0;&#x8282; &#x201C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x4F5C;&#x7528;&#x57DF;&#x201D;</a>&#x6307;&#x51FA;&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x88AB;&#x591A;&#x6B21;&#x8D4B;&#x503C;&#x4F1A;&#x7ED9;&#x8C03;&#x8BD5;&#x5E26;&#x6765;&#x9EBB;&#x70E6;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F53;&#x5F88;&#x957F;&#xFF0C;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x90A3;&#x4E48;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x88AB;&#x591A;&#x6B21;&#x8D4B;&#x503C;&#x4E5F;&#x4F1A;&#x6709;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x201C;<span class="quote">&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x591A;&#x6B21;&#x8D4B;&#x503C;</span>&#x201D;&#x662F;&#x5929;&#x7ECF;&#x5730;&#x4E49;&#x7684;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x91C7;&#x7528;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x907F;&#x514D;Side Effect&#xFF0C;&#x4F8B;&#x5982;LISP&#x3001;Haskell&#x3001;Erlang&#x7B49;&#x3002;&#x7528;C&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x91C7;&#x7528;Imperative&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;<span class="emphasis"><em>&#x7ED9;&#x53D8;&#x91CF;&#x591A;&#x6B21;&#x8D4B;&#x503C;&#x65F6;&#x8981;&#x683C;&#x5916;&#x5C0F;&#x5FC3;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x591A;&#x6B21;&#x8BFB;&#x5199;&#x540C;&#x4E00;&#x53D8;&#x91CF;&#x5E94;&#x8BE5;&#x4EE5;&#x4E00;&#x79CD;&#x4E00;&#x81F4;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;</em></span>&#x3002;&#x6240;&#x8C13;&#x201C;<span class="quote">&#x4E00;&#x81F4;&#x7684;&#x65B9;&#x5F0F;</span>&#x201D;&#x662F;&#x8BF4;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x5957;&#x7EDF;&#x4E00;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x89C4;&#x5B9A;&#x5728;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#x54EA;&#x91CC;&#x4F1A;&#x5BF9;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x3001;&#x54EA;&#x91CC;&#x4F1A;&#x8BFB;&#x53D6;&#x5B83;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x5728;<a class="xref" href="ch25s02.html#stdlib.errno">&#x7B2C;&#xA0;2.4&#xA0;&#x8282; &#x201C;errno&#x4E0E;perror&#x51FD;&#x6570;&#x201D;</a>&#x4F1A;&#x8BB2;&#x5230;&#x8BBF;&#x95EE;<code class="literal">errno</code>&#x7684;&#x89C4;&#x5219;&#x3002;</p><p>&#x9012;&#x5F52;&#x51FD;&#x6570;&#x5982;&#x679C;&#x5199;&#x5F97;&#x4E0D;&#x5C0F;&#x5FC3;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x65E0;&#x7A77;&#x9012;&#x5F52;&#xFF0C;&#x540C;&#x6837;&#x9053;&#x7406;&#xFF0C;&#x5FAA;&#x73AF;&#x5982;&#x679C;&#x5199;&#x5F97;&#x4E0D;&#x5C0F;&#x5FC3;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF08;Infinite Loop&#xFF09;<a id="id2726376" class="indexterm"></a>&#x6216;&#x8005;&#x53EB;&#x6B7B;&#x5FAA;&#x73AF;&#x3002;&#x5982;&#x679C;<code class="literal">while</code>&#x8BED;&#x53E5;&#x7684;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x6C38;&#x8FDC;&#x4E3A;&#x771F;&#x5C31;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">while (1) {...}</code>&#x3002;&#x5728;&#x5199;&#x5FAA;&#x73AF;&#x65F6;&#x8981;&#x5C0F;&#x5FC3;&#x68C0;&#x67E5;&#x4F60;&#x5199;&#x7684;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x6709;&#x6CA1;&#x6709;&#x53EF;&#x80FD;&#x53D6;&#x503C;&#x4E3A;&#x5047;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x6545;&#x610F;&#x5199;&#x6B7B;&#x5FAA;&#x73AF;&#xFF08;&#x6709;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF09;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E0D;&#x7BA1;<code class="literal">n</code>&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x51E0;&#xFF0C;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x90FD;&#x4F1A;&#x628A;<code class="literal">n</code>&#x51CF;&#x6389;1&#xFF0C;<code class="literal">n</code>&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x6700;&#x540E;&#x5FC5;&#x7136;&#x7B49;&#x4E8E;0&#xFF0C;&#x6240;&#x4EE5;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x6700;&#x540E;&#x5FC5;&#x7136;&#x53D6;&#x503C;&#x4E3A;&#x5047;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x628A;<code class="literal">n = n - 1;</code>&#x8FD9;&#x53E5;&#x6F0F;&#x6389;&#x5C31;&#x6210;&#x4E86;&#x6B7B;&#x5FAA;&#x73AF;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4E0D;&#x662F;&#x6B7B;&#x5FAA;&#x73AF;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF1A;</p><pre class="programlisting">while (n != 1) {
	if (n % 2 == 0) {
		n = n / 2;
	} else {
		n = n * 3 + 1;
	}
}</pre><p>&#x5982;&#x679C;<code class="literal">n</code>&#x4E3A;&#x6B63;&#x6574;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x80FD;&#x8DF3;&#x51FA;&#x6765;&#x5417;&#xFF1F;&#x5FAA;&#x73AF;&#x4F53;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF1A;&#x5982;&#x679C;<code class="literal">n</code>&#x662F;&#x5076;&#x6570;&#xFF0C;&#x5C31;&#x628A;<code class="literal">n</code>&#x9664;&#x4EE5;2&#xFF0C;&#x5982;&#x679C;<code class="literal">n</code>&#x662F;&#x5947;&#x6570;&#xFF0C;&#x5C31;&#x628A;<code class="literal">n</code>&#x4E58;3&#x52A0;1&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x5FAA;&#x73AF;&#x53D8;&#x91CF;&#x8981;&#x4E48;&#x9012;&#x589E;&#x8981;&#x4E48;&#x9012;&#x51CF;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;<code class="literal">n</code>&#x4E00;&#x4F1A;&#x513F;&#x53D8;&#x5927;&#x4E00;&#x4F1A;&#x513F;&#x53D8;&#x5C0F;&#xFF0C;&#x6700;&#x7EC8;&#x4F1A;&#x4E0D;&#x4F1A;&#x53D8;&#x6210;1&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x627E;&#x4E2A;&#x6570;&#x8BD5;&#x8BD5;&#xFF0C;&#x4F8B;&#x5982;&#x4E00;&#x5F00;&#x59CB;<code class="literal">n</code>&#x7B49;&#x4E8E;7&#xFF0C;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x540E;<code class="literal">n</code>&#x7684;&#x503C;&#x4F9D;&#x6B21;&#x662F;&#xFF1A;7&#x3001;22&#x3001;11&#x3001;34&#x3001;17&#x3001;52&#x3001;26&#x3001;13&#x3001;40&#x3001;20&#x3001;10&#x3001;5&#x3001;16&#x3001;8&#x3001;4&#x3001;2&#x3001;1&#x3002;&#x6700;&#x540E;<code class="literal">n</code>&#x786E;&#x5B9E;&#x7B49;&#x4E8E;1&#x4E86;&#x3002;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x518D;&#x8BD5;&#x51E0;&#x4E2A;&#x6570;&#x90FD;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x65E0;&#x8BBA;&#x8BD5;&#x591A;&#x5C11;&#x4E2A;&#x6570;&#x4E5F;&#x4E0D;&#x80FD;&#x4EE3;&#x66FF;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x6709;&#x6CA1;&#x6709;&#x53EF;&#x80FD;&#x5BF9;&#x67D0;&#x4E9B;&#x6B63;&#x6574;&#x6570;<code class="literal">n</code>&#x662F;&#x6B7B;&#x5FAA;&#x73AF;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53EA;&#x662F;&#x7ED9;&#x8BFB;&#x8005;&#x63D0;&#x63D0;&#x5174;&#x8DA3;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x9192;&#x8BFB;&#x8005;&#x5199;&#x5FAA;&#x73AF;&#x65F6;&#x8981;&#x6709;&#x610F;&#x8BC6;&#x5730;&#x68C0;&#x67E5;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x81F3;&#x4E8E;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x6709;&#x6CA1;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x8FD9;&#x662F;&#x8457;&#x540D;&#x7684;3x+1&#x95EE;&#x9898;&#xFF0C;&#x76EE;&#x524D;&#x4E16;&#x754C;&#x4E0A;&#x8FD8;&#x65E0;&#x4EBA;&#x80FD;&#x8BC1;&#x660E;&#x3002;&#x8BB8;&#x591A;&#x4E16;&#x754C;&#x96BE;&#x9898;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x63CF;&#x8FF0;&#x65E0;&#x6BD4;&#x7B80;&#x5355;&#xFF0C;&#x8FDE;&#x5C0F;&#x5B66;&#x751F;&#x90FD;&#x80FD;&#x770B;&#x61C2;&#xFF0C;&#x4F46;&#x8BC1;&#x660E;&#x5374;&#x65E0;&#x6BD4;&#x56F0;&#x96BE;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2726515"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x7528;&#x5FAA;&#x73AF;&#x89E3;&#x51B3;<a class="xref" href="ch05s03.html#func2.recursion">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x9012;&#x5F52;&#x201D;</a>&#x7684;&#x6240;&#x6709;&#x4E60;&#x9898;&#xFF0C;&#x4F53;&#x4F1A;&#x9012;&#x5F52;&#x548C;&#x5FAA;&#x73AF;&#x8FD9;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x8DEF;&#x3002;</p><p>2&#x3001;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x6570;&#x4E00;&#x4E0B;1&#x5230;100&#x7684;&#x6240;&#x6709;&#x6574;&#x6570;&#x4E2D;&#x51FA;&#x73B0;&#x591A;&#x5C11;&#x6B21;&#x6570;&#x5B57;9&#x3002;&#x5728;&#x5199;&#x7A0B;&#x5E8F;&#x4E4B;&#x524D;&#x5148;&#x628A;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x8003;&#x8651;&#x6E05;&#x695A;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x5FAA;&#x73AF;&#x53D8;&#x91CF;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p></li><li><p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x7D2F;&#x52A0;&#x5668;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x7528;&#x52A0;&#x6CD5;&#x8FD8;&#x662F;&#x7528;&#x4E58;&#x6CD5;&#x7D2F;&#x79EF;&#xFF1F;</p></li><li><p>&#x5728;<a class="xref" href="ch04s02.html#cond.ifelse">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;if/else&#x8BED;&#x53E5;&#x201D;</a>&#x7684;&#x4E60;&#x9898;1&#x5199;&#x8FC7;&#x53D6;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x7684;&#x4E2A;&#x4F4D;&#x548C;&#x5341;&#x4F4D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x600E;&#x6837;&#x7528;&#x5230;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF1F;</p></li></ol></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch06.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch06.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch06s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;6&#xA0;&#x7AE0;&#xA0;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;do/while&#x8BED;&#x53E5;</td></tr></tbody></table></div>
</body></html>