<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>2.&#xA0;&#x6570;&#x636E;&#x62BD;&#x8C61;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch07.html" title="&#x7B2C;&#xA0;7&#xA0;&#x7AE0;&#xA0;&#x7ED3;&#x6784;&#x4F53;"><link rel="prev" href="ch07s01.html" title="1.&#xA0;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x4E0E;&#x7ED3;&#x6784;&#x4F53;"><link rel="next" href="ch07s03.html" title="3.&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6807;&#x5FD7;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">2.&#xA0;&#x6570;&#x636E;&#x62BD;&#x8C61;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch07s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;7&#xA0;&#x7AE0;&#xA0;&#x7ED3;&#x6784;&#x4F53;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch07s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2730921"></a>2.&#xA0;&#x6570;&#x636E;&#x62BD;&#x8C61;</h2></div></div></div><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x590D;&#x6570;&#x8FD0;&#x7B97;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x4E86;&#x590D;&#x6570;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;&#x73B0;&#x5728;&#x9700;&#x8981;&#x56F4;&#x7ED5;&#x5B83;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x3002;&#x590D;&#x6570;&#x53EF;&#x4EE5;&#x7528;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x6216;&#x6781;&#x5EA7;&#x6807;&#x8868;&#x793A;&#xFF0C;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x505A;&#x52A0;&#x51CF;&#x6CD5;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#xFF0C;&#x6781;&#x5EA7;&#x6807;&#x505A;&#x4E58;&#x9664;&#x6CD5;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x7684;&#x590D;&#x6570;&#x7ED3;&#x6784;&#x4F53;&#x662F;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x6781;&#x5EA7;&#x6807;&#x7684;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x53D6;&#x5B83;&#x7684;&#x6A21;&#x548C;&#x8F90;&#x89D2;&#xFF1A;</p><pre class="programlisting">#include &lt;math.h&gt;

struct complex_struct {
	double x, y;
};

double real_part(struct complex_struct z)
{
	return z.x;
}

double img_part(struct complex_struct z)
{
	return z.y;
}

double magnitude(struct complex_struct z)
{
	return sqrt(z.x * z.x + z.y * z.y);
}

double angle(struct complex_struct z)
{
	return atan2(z.y, z.x);
}</pre><p>&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x63D0;&#x4F9B;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x7528;&#x6765;&#x6784;&#x9020;&#x590D;&#x6570;&#x53D8;&#x91CF;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6781;&#x5EA7;&#x6807;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x81EA;&#x52A8;&#x505A;&#x76F8;&#x5E94;&#x7684;&#x8F6C;&#x6362;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x6784;&#x9020;&#x7684;&#x590D;&#x6570;&#x53D8;&#x91CF;&#xFF1A;</p><pre class="programlisting">struct complex_struct make_from_real_img(double x, double y)
{
	struct complex_struct z;
	z.x = x;
	z.y = y;
	return z;
}

struct complex_struct make_from_mag_ang(double r, double A)
{
	struct complex_struct z;
	z.x = r * cos(A);
	z.y = r * sin(A);
	return z;
}</pre><p>&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x590D;&#x6570;&#x7684;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x8FD0;&#x7B97;&#x4E86;&#xFF1A;</p><pre class="programlisting">struct complex_struct add_complex(struct complex_struct z1, struct complex_struct z2)
{
	return make_from_real_img(real_part(z1) + real_part(z2),
				  img_part(z1) + img_part(z2));
}

struct complex_struct sub_complex(struct complex_struct z1, struct complex_struct z2)
{
	return make_from_real_img(real_part(z1) - real_part(z2),
				  img_part(z1) - img_part(z2));
}

struct complex_struct mul_complex(struct complex_struct z1, struct complex_struct z2)
{
	return make_from_mag_ang(magnitude(z1) * magnitude(z2),
				 angle(z1) + angle(z2));
}

struct complex_struct div_complex(struct complex_struct z1, struct complex_struct z2)
{
	return make_from_mag_ang(magnitude(z1) / magnitude(z2),
				 angle(z1) - angle(z2));
}</pre><p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x590D;&#x6570;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x8FD0;&#x7B97;&#x7684;&#x5B9E;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x7ED3;&#x6784;&#x4F53;<code class="literal">complex_struct</code>&#x7684;&#x6210;&#x5458;<code class="literal">x</code>&#x548C;<code class="literal">y</code>&#xFF0C;&#x800C;&#x662F;&#x628A;&#x5B83;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x76F8;&#x5173;&#x51FD;&#x6570;&#x6765;&#x53D6;&#x5B83;&#x7684;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x548C;&#x6781;&#x5EA7;&#x6807;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x5730;&#x66FF;&#x6362;&#x6389;&#x7ED3;&#x6784;&#x4F53;<code class="literal">complex_struct</code>&#x7684;&#x5B58;&#x50A8;&#x8868;&#x793A;&#xFF0C;&#x4F8B;&#x5982;&#x6539;&#x4E3A;&#x7528;&#x6781;&#x5EA7;&#x6807;&#x6765;&#x5B58;&#x50A8;&#xFF1A;</p><pre class="programlisting">#include &lt;math.h&gt;

struct complex_struct {
	double r, A;
};

double real_part(struct complex_struct z)
{
	return z.r * cos(z.A);
}

double img_part(struct complex_struct z)
{
	return z.r * sin(z.A);
}

double magnitude(struct complex_struct z)
{
	return z.r;
}

double angle(struct complex_struct z)
{
	return z.A;
}

struct complex_struct make_from_real_img(double x, double y)
{
	struct complex_struct z;
	z.A = atan2(y, x);
	z.r = sqrt(x * x + y * y);
}

struct complex_struct make_from_mag_ang(double r, double A)
{
	struct complex_struct z;
	z.r = r;
	z.A = A;
	return z;
}</pre><p>&#x867D;&#x7136;&#x7ED3;&#x6784;&#x4F53;<code class="literal">complex_struct</code>&#x7684;&#x5B58;&#x50A8;&#x8868;&#x793A;&#x505A;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x6539;&#x52A8;&#xFF0C;<code class="literal">add_complex</code>&#x3001;<code class="literal">sub_complex</code>&#x3001;<code class="literal">mul_complex</code>&#x3001;<code class="literal">div_complex</code>&#x8FD9;&#x51E0;&#x4E2A;&#x590D;&#x6570;&#x8FD0;&#x7B97;&#x7684;&#x51FD;&#x6570;&#x5374;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x7528;&#xFF0C;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#x8FD9;&#x51E0;&#x4E2A;&#x51FD;&#x6570;&#x53EA;&#x628A;&#x7ED3;&#x6784;&#x4F53;<code class="literal">complex_struct</code>&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5B83;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5B83;&#x6709;&#x54EA;&#x4E9B;&#x6210;&#x5458;&#x3002;&#x6211;&#x4EEC;&#x7ED3;&#x5408;&#x4E0B;&#x56FE;&#x5177;&#x4F53;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x3002;</p><div class="figure"><a id="id2731079"></a><p class="title"><b>&#x56FE;&#xA0;7.3.&#xA0;&#x6570;&#x636E;&#x62BD;&#x8C61;</b></p><div class="figure-contents"><div><img src="images/struct.abstraction.png" alt="&#x6570;&#x636E;&#x62BD;&#x8C61;"></div></div></div><br class="figure-break"><p>&#x8FD9;&#x91CC;&#x662F;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x7684;&#x601D;&#x60F3;&#x3002;&#x5176;&#x5B9E;&#x201C;<span class="quote">&#x62BD;&#x8C61;</span>&#x201D;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x62BD;&#x8C61;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#x5C31;&#x662F;&#x201C;<span class="quote">&#x63D0;&#x53D6;&#x516C;&#x56E0;&#x5F0F;</span>&#x201D;&#xFF1A;ab+ac=a(b+c)&#x3002;&#x5982;&#x679C;a&#x53D8;&#x4E86;&#xFF0C;ab&#x548C;ac&#x8FD9;&#x4E24;&#x9879;&#x90FD;&#x9700;&#x8981;&#x6539;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5199;&#x6210;a(b+c)&#x7684;&#x5F62;&#x5F0F;&#x5C31;&#x53EA;&#x9700;&#x8981;&#x6539;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x56E0;&#x5B50;&#x3002;</p><p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x590D;&#x6570;&#x8FD0;&#x7B97;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x590D;&#x6570;&#x6709;&#x53EF;&#x80FD;&#x7528;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x6216;&#x6781;&#x5EA7;&#x6807;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x6709;&#x53EF;&#x80FD;&#x53D8;&#x52A8;&#x7684;&#x56E0;&#x7D20;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7EC4;&#x6210;&#x590D;&#x6570;&#x5B58;&#x50A8;&#x8868;&#x793A;&#x5C42;&#xFF1A;<code class="literal">real_part</code>&#x3001;<code class="literal">img_part</code>&#x3001;<code class="literal">magnitude</code>&#x3001;<code class="literal">angle</code>&#x3001;<code class="literal">make_from_real_img</code>&#x3001;<code class="literal">make_from_mag_ang</code>&#x3002;&#x8FD9;&#x4E00;&#x5C42;&#x770B;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x4E24;&#x4E2A;&#x6210;&#x5458;<code class="literal">x</code>&#x548C;<code class="literal">y</code>&#xFF0C;&#x6216;&#x8005;<code class="literal">r</code>&#x548C;<code class="literal">A</code>&#xFF0C;&#x5982;&#x679C;&#x6539;&#x53D8;&#x4E86;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x5C31;&#x8981;&#x6539;&#x53D8;&#x8FD9;&#x4E00;&#x5C42;&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x51FD;&#x6570;&#x63A5;&#x53E3;&#x4E0D;&#x6539;&#x53D8;&#xFF0C;&#x56E0;&#x6B64;&#x8C03;&#x7528;&#x8FD9;&#x4E00;&#x5C42;&#x51FD;&#x6570;&#x63A5;&#x53E3;&#x7684;&#x590D;&#x6570;&#x8FD0;&#x7B97;&#x5C42;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x6539;&#x53D8;&#x3002;&#x590D;&#x6570;&#x8FD0;&#x7B97;&#x5C42;&#x770B;&#x5230;&#x7684;&#x6570;&#x636E;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7684;&#x201C;<span class="quote">&#x590D;&#x6570;</span>&#x201D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x77E5;&#x9053;&#x5B83;&#x6709;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x548C;&#x6781;&#x5EA7;&#x6807;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x590D;&#x6570;&#x5B58;&#x50A8;&#x8868;&#x793A;&#x5C42;&#x7684;&#x51FD;&#x6570;&#x5F97;&#x5230;&#x8FD9;&#x4E9B;&#x5EA7;&#x6807;&#x3002;&#x518D;&#x5F80;&#x4E0A;&#x770B;&#xFF0C;&#x5176;&#x5B83;&#x4F7F;&#x7528;&#x590D;&#x6570;&#x8FD0;&#x7B97;&#x7684;&#x7A0B;&#x5E8F;&#x770B;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x62BD;&#x8C61;&#x7684;&#x201C;<span class="quote">&#x590D;&#x6570;</span>&#x201D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x53EA;&#x77E5;&#x9053;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x50CF;&#x6574;&#x6570;&#x3001;&#x5C0F;&#x6570;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x5B83;&#x6709;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x548C;&#x6781;&#x5EA7;&#x6807;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x3002;</p><p>&#x8FD9;&#x91CC;&#x7684;&#x590D;&#x6570;&#x5B58;&#x50A8;&#x8868;&#x793A;&#x5C42;&#x548C;&#x590D;&#x6570;&#x8FD0;&#x7B97;&#x5C42;&#x79F0;&#x4E3A;&#x62BD;&#x8C61;&#x5C42;&#xFF08;Abstraction Layer&#xFF09;<a id="id2731193" class="indexterm"></a>&#xFF0C;&#x4ECE;&#x5E95;&#x5C42;&#x5F80;&#x4E0A;&#x5C42;&#x6765;&#x770B;&#xFF0C;&#x590D;&#x6570;&#x8D8A;&#x6765;&#x8D8A;&#x62BD;&#x8C61;&#x4E86;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5C42;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7CFB;&#x7EDF;&#x3002;<span class="emphasis"><em>&#x7EC4;&#x5408;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x62BD;&#x8C61;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x662F;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#x90FD;&#x53EA;&#x5C40;&#x9650;&#x5728;&#x67D0;&#x4E00;&#x5C42;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x6CE2;&#x53CA;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;</em></span>&#x3002;&#x8457;&#x540D;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;Butler Lampson&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;<span class="quote">All problems in computer science can be solved by another level of indirection.</span>&#x201D;&#x8FD9;&#x91CC;&#x7684;indirection&#x5176;&#x5B9E;&#x5C31;&#x662F;abstraction&#x7684;&#x610F;&#x601D;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2731216"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x5728;&#x672C;&#x8282;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6253;&#x5370;&#x590D;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6253;&#x5370;&#x7684;&#x683C;&#x5F0F;&#x662F;x+yi&#xFF0C;&#x5982;&#x679C;&#x5B9E;&#x90E8;&#x6216;&#x865A;&#x90E8;&#x4E3A;0&#x5219;&#x7701;&#x7565;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;1.0&#x3001;-2.0i&#x3001;-1.0+2.0i&#x3001;1.0-2.0i&#x3002;&#x6700;&#x540E;&#x7F16;&#x5199;&#x4E00;&#x4E2A;<code class="literal">main</code>&#x51FD;&#x6570;&#x6D4B;&#x8BD5;&#x672C;&#x8282;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x3002;&#x60F3;&#x4E00;&#x60F3;&#x8FD9;&#x4E2A;&#x6253;&#x5370;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x5C5E;&#x4E8E;&#x4E0A;&#x56FE;&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x5C42;&#xFF1F;</p><p>2&#x3001;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7528;&#x5206;&#x5B50;&#x5206;&#x6BCD;&#x7684;&#x683C;&#x5F0F;&#x6765;&#x8868;&#x793A;&#x6709;&#x7406;&#x6570;&#x7684;&#x7ED3;&#x6784;&#x4F53;<code class="literal">rational</code>&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x7684;&#x51FD;&#x6570;&#xFF0C;<code class="literal">rational</code>&#x7ED3;&#x6784;&#x4F53;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x505A;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x8FD0;&#x7B97;&#xFF0C;&#x8FD0;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#x4ECD;&#x7136;&#x662F;<code class="literal">rational</code>&#x3002;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="programlisting">int main(void)
{
	struct rational a = make_rational(1, 8); /* a=1/8 */
	struct rational b = make_rational(-1, 8); /* b=-1/8 */
	print_rational(add_rational(a, b));
	print_rational(sub_rational(a, b));
	print_rational(mul_rational(a, b));
	print_rational(div_rational(a, b));

	return 0;
}</pre><p>&#x6CE8;&#x610F;&#x8981;&#x7EA6;&#x5206;&#x4E3A;&#x6700;&#x7B80;&#x5206;&#x6570;&#xFF0C;&#x4F8B;&#x5982;1/8&#x548C;-1/8&#x76F8;&#x51CF;&#x7684;&#x6253;&#x5370;&#x7ED3;&#x679C;&#x5E94;&#x8BE5;&#x662F;1/4&#x800C;&#x4E0D;&#x662F;2/8&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;<a class="xref" href="ch05s03.html#func2.recursion">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x9012;&#x5F52;&#x201D;</a>&#x7EC3;&#x4E60;&#x9898;&#x4E2D;&#x7684;Euclid&#x7B97;&#x6CD5;&#x6765;&#x7EA6;&#x5206;&#x3002;&#x5728;&#x52A8;&#x624B;&#x7F16;&#x7A0B;&#x4E4B;&#x524D;&#x5148;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5B9E;&#x73B0;&#x4E86;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6570;&#x636E;&#x62BD;&#x8C61;&#xFF0C;&#x62BD;&#x8C61;&#x5C42;&#x5E94;&#x8BE5;&#x7531;&#x54EA;&#x4E9B;&#x51FD;&#x6570;&#x7EC4;&#x6210;&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch07s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch07.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch07s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">1.&#xA0;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x4E0E;&#x7ED3;&#x6784;&#x4F53;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;3.&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6807;&#x5FD7;</td></tr></tbody></table></div>
</body></html>