<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x4E0E;&#x7ED3;&#x6784;&#x4F53;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch07.html" title="&#x7B2C;&#xA0;7&#xA0;&#x7AE0;&#xA0;&#x7ED3;&#x6784;&#x4F53;"><link rel="prev" href="ch07.html" title="&#x7B2C;&#xA0;7&#xA0;&#x7AE0;&#xA0;&#x7ED3;&#x6784;&#x4F53;"><link rel="next" href="ch07s02.html" title="2.&#xA0;&#x6570;&#x636E;&#x62BD;&#x8C61;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x4E0E;&#x7ED3;&#x6784;&#x4F53;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch07.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;7&#xA0;&#x7AE0;&#xA0;&#x7ED3;&#x6784;&#x4F53;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch07s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2730146"></a>1.&#xA0;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x4E0E;&#x7ED3;&#x6784;&#x4F53;</h2></div></div></div><p>&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6700;&#x57FA;&#x672C;&#x7684;&#x3001;&#x4E0D;&#x53EF;&#x518D;&#x5206;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x79F0;&#x4E3A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF08;Primitive Type&#xFF09;<a id="id2729520" class="indexterm"></a>&#xFF0C;&#x4F8B;&#x5982;&#x6574;&#x578B;&#x3001;&#x6D6E;&#x70B9;&#x578B;&#xFF1B;&#x6839;&#x636E;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x7531;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7EC4;&#x5408;&#x800C;&#x6210;&#x7684;&#x7C7B;&#x578B;&#x79F0;&#x4E3A;&#x590D;&#x5408;&#x7C7B;&#x578B;&#xFF08;Compound Type&#xFF09;<a id="id2729529" class="indexterm"></a>&#xFF0C;&#x4F8B;&#x5982;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x7531;&#x5F88;&#x591A;&#x5B57;&#x7B26;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x6709;&#x4E9B;&#x573A;&#x5408;&#x4E0B;&#x8981;&#x628A;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x6765;&#x7528;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x573A;&#x5408;&#x4E0B;&#x9700;&#x8981;&#x5206;&#x89E3;&#x7EC4;&#x6210;&#x8FD9;&#x4E2A;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x5404;&#x79CD;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x8FD9;&#x79CD;&#x4E24;&#x9762;&#x6027;&#x4E3A;&#x6570;&#x636E;&#x62BD;&#x8C61;&#xFF08;Data Abstraction&#xFF09;<a id="id2729540" class="indexterm"></a>&#x5960;&#x5B9A;&#x4E86;&#x57FA;&#x7840;&#x3002;<a class="xref" href="bi01.html#bibli.sicp" title="Structure and Interpretation of Computer Programs">[<abbr class="abbrev">SICP</abbr>]</a>&#x6307;&#x51FA;&#xFF0C;&#x5728;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x65F6;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x54EA;&#x4E9B;Primitive&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x672C;&#x8FD0;&#x7B97;&#x7B26;&#x3001;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x8BED;&#x53E5;&#x3002;</p></li><li><p>&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x54EA;&#x4E9B;&#x7EC4;&#x5408;&#x89C4;&#x5219;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x5982;&#x4F55;&#x7EC4;&#x6210;&#x590D;&#x5408;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x7B80;&#x5355;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x8BED;&#x53E5;&#x5982;&#x4F55;&#x7EC4;&#x6210;&#x590D;&#x6742;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x8BED;&#x53E5;&#x3002;</p></li><li><p>&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x54EA;&#x4E9B;&#x62BD;&#x8C61;&#x673A;&#x5236;&#xFF0C;&#x5305;&#x62EC;&#x6570;&#x636E;&#x62BD;&#x8C61;&#x548C;&#x8FC7;&#x7A0B;&#x62BD;&#x8C61;&#xFF08;Procedure Abstraction&#xFF09;<a id="id2730187" class="indexterm"></a>&#x3002;</p></li></ol></div><p>&#x672C;&#x7AE0;&#x4EE5;&#x7ED3;&#x6784;&#x4F53;&#x4E3A;&#x4F8B;&#x8BB2;&#x89E3;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x7EC4;&#x5408;&#x548C;&#x6570;&#x636E;&#x62BD;&#x8C61;&#x3002;&#x81F3;&#x4E8E;&#x8FC7;&#x7A0B;&#x62BD;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x5728;<a class="xref" href="ch04s02.html#cond.ifelse">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;if/else&#x8BED;&#x53E5;&#x201D;</a>&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x4E00;&#x7EC4;&#x8BED;&#x53E5;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x540D;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x4F7F;&#x7528;&#xFF0C;&#x672C;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8FC7;&#x7A0B;&#x62BD;&#x8C61;&#x3002;</p><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7528;C&#x8BED;&#x8A00;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x590D;&#x6570;&#x3002;&#x4ECE;&#x76F4;&#x89D2;&#x5EA7;&#x6807;&#x7CFB;&#x6765;&#x770B;&#xFF0C;&#x590D;&#x6570;&#x7531;&#x5B9E;&#x90E8;&#x548C;&#x865A;&#x90E8;&#x7EC4;&#x6210;&#xFF0C;&#x4ECE;&#x6781;&#x5EA7;&#x6807;&#x7CFB;&#x6765;&#x770B;&#xFF0C;&#x590D;&#x6570;&#x7531;&#x6A21;&#x548C;&#x8F90;&#x89D2;&#x7EC4;&#x6210;&#xFF0C;&#x4E24;&#x79CD;&#x5EA7;&#x6807;&#x7CFB;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><div class="figure"><a id="id2730217"></a><p class="title"><b>&#x56FE;&#xA0;7.1.&#xA0;&#x590D;&#x6570;</b></p><div class="figure-contents"><div><img src="images/struct.complex.png" alt="&#x590D;&#x6570;"></div></div></div><br class="figure-break"><p>&#x5982;&#x679C;&#x7528;&#x5B9E;&#x90E8;&#x548C;&#x865A;&#x90E8;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x590D;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x7531;&#x4E24;&#x4E2A;<code class="literal">double</code>&#x578B;&#x7EC4;&#x6210;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF1A;</p><pre class="programlisting">struct complex_struct {
	double x, y;
};</pre><p>&#x8FD9;&#x4E00;&#x53E5;&#x5B9A;&#x4E49;&#x4E86;&#x6807;&#x8BC6;&#x7B26;<code class="literal">complex_struct</code>&#xFF08;&#x540C;&#x6837;&#x9075;&#x5FAA;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x6807;&#x8BC6;&#x7B26;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x79F0;&#x4E3A;Tag<a id="id2730254" class="indexterm"></a>&#xFF0C;<code class="literal">struct complex_struct { double x, y; }</code>&#x6574;&#x4E2A;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x540D;<sup>[<a id="id2730268" href="#ftn.id2730268" class="footnote">12</a>]</sup>&#xFF0C;&#x5C31;&#x50CF;<code class="literal">int</code>&#x6216;<code class="literal">double</code>&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x5408;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x540D;&#x6765;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p><pre class="programlisting">struct complex_struct {
	double x, y;
} z1, z2;</pre><p>&#x8FD9;&#x6837;<code class="literal">z1</code>&#x548C;<code class="literal">z2</code>&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x540E;&#x9762;&#x5E26;&#x4E2A;;&#x53F7;&#x662F;&#x6211;&#x4EEC;&#x65E9;&#x5C31;&#x4E60;&#x60EF;&#x7684;&#x3002;&#x4F46;&#x5373;&#x4F7F;&#x50CF;&#x5148;&#x524D;&#x7684;&#x4F8B;&#x5B50;&#x90A3;&#x6837;&#x53EA;&#x5B9A;&#x4E49;&#x4E86;<code class="literal">complex_struct</code>&#x8FD9;&#x4E2A;Tag&#x800C;&#x4E0D;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#xFF0C;}&#x540E;&#x9762;&#x7684;;&#x53F7;&#x4E5F;&#x4E0D;&#x80FD;&#x5C11;&#x3002;&#x8FD9;&#x70B9;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x58F0;&#x660E;&#xFF0C;&#x58F0;&#x660E;&#x90FD;&#x8981;&#x4EE5;;&#x53F7;&#x7ED3;&#x5C3E;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7684;}&#x540E;&#x9762;&#x5C11;;&#x53F7;&#x662F;&#x521D;&#x5B66;&#x8005;&#x5E38;&#x72AF;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x7528;&#x4E0A;&#x9762;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x54EA;&#x4E00;&#x79CD;&#x5B9A;&#x4E49;&#x4E86;<code class="literal">complex_struct</code>&#x8FD9;&#x4E2A;Tag&#xFF0C;&#x4EE5;&#x540E;&#x90FD;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7528;<code class="literal">struct complex_struct</code>&#x6765;&#x4EE3;&#x66FF;&#x7C7B;&#x578B;&#x540D;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x590D;&#x6570;&#x53D8;&#x91CF;&#xFF1A;</p><pre class="programlisting">struct complex_struct z3, z4;</pre><p>&#x5982;&#x679C;&#x5728;&#x5B9A;&#x4E49;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x540C;&#x65F6;&#x5B9A;&#x4E49;&#x4E86;&#x53D8;&#x91CF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x5FC5;&#x5199;Tag&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">struct {
	double x, y;
} z1, z2;</pre><p>&#x4F46;&#x8FD9;&#x6837;&#x5C31;&#x6CA1;&#x529E;&#x6CD5;&#x518D;&#x6B21;&#x5F15;&#x7528;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6CA1;&#x6709;&#x540D;&#x5B57;&#x3002;&#x6BCF;&#x4E2A;&#x590D;&#x6570;&#x53D8;&#x91CF;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x6210;&#x5458;&#xFF08;Member&#xFF09;<a id="id2730396" class="indexterm"></a>x&#x548C;y&#xFF0C;&#x53EF;&#x4EE5;&#x7528;.&#x8FD0;&#x7B97;&#x7B26;&#xFF08;.&#x53F7;&#xFF0C;Period&#xFF09;<a id="id2730404" class="indexterm"></a>&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x6210;&#x5458;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x662F;&#x76F8;&#x90BB;&#x7684;<sup>[<a id="id2730413" href="#ftn.id2730413" class="footnote">13</a>]</sup>&#xFF0C;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7EC4;&#x6210;&#x590D;&#x6570;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p><div class="example"><a id="id2730428"></a><p class="title"><b>&#x4F8B;&#xA0;7.1.&#xA0;&#x5B9A;&#x4E49;&#x548C;&#x8BBF;&#x95EE;&#x7ED3;&#x6784;&#x4F53;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

int main(void)
{
	struct complex_struct { double x, y; } z;
	double x = 3.0;	
	z.x = x;
	z.y = 4.0;
	if (z.y &lt; 0)
		printf(&quot;z=%f%fi\n&quot;, z.x, z.y);
	else
		printf(&quot;z=%f+%fi\n&quot;, z.x, z.y);

	return 0;
}</pre></div></div><br class="example-break"><p>&#x6CE8;&#x610F;&#x4E0A;&#x4F8B;&#x4E2D;&#x53D8;&#x91CF;<code class="literal">x</code>&#x548C;&#x53D8;&#x91CF;<code class="literal">z</code>&#x7684;&#x6210;&#x5458;<code class="literal">x</code>&#x7684;&#x540D;&#x5B57;&#x5E76;&#x4E0D;&#x51B2;&#x7A81;&#xFF0C;&#x56E0;&#x4E3A;&#x53D8;&#x91CF;<code class="literal">z</code>&#x7684;&#x6210;&#x5458;<code class="literal">x</code>&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">z.x</code>&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x4ECE;&#x8BED;&#x6CD5;&#x4E0A;&#x533A;&#x5206;&#x54EA;&#x4E2A;<code class="literal">x</code>&#x662F;&#x53D8;&#x91CF;<code class="literal">x</code>&#xFF0C;&#x54EA;&#x4E2A;<code class="literal">x</code>&#x662F;&#x53D8;&#x91CF;<code class="literal">z</code>&#x7684;&#x6210;&#x5458;<code class="literal">x</code>&#xFF0C;<a class="xref" href="ch19s03.html#asmc.layout">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#x201D;</a>&#x4F1A;&#x8BB2;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;<code class="literal">x</code>&#x5C5E;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x3002;&#x7ED3;&#x6784;&#x4F53;Tag&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5728;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x7684;Tag&#x5728;&#x5176;&#x5B9A;&#x4E49;&#x4E4B;&#x540E;&#x7684;&#x5404;&#x51FD;&#x6570;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">struct complex_struct { double x, y; };

int main(void)
{
	struct complex_struct z;
	...
}</pre><p>&#x7ED3;&#x6784;&#x4F53;&#x53D8;&#x91CF;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">struct complex_struct z = { 3.0, 4.0 };</pre><p>Initializer&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4F9D;&#x6B21;&#x8D4B;&#x7ED9;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5404;&#x6210;&#x5458;&#x3002;&#x5982;&#x679C;Initializer&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6BD4;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6210;&#x5458;&#x591A;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x62A5;&#x9519;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x53EA;&#x662F;&#x672B;&#x5C3E;&#x591A;&#x4E2A;&#x9017;&#x53F7;&#x5219;&#x4E0D;&#x7B97;&#x9519;&#x3002;&#x5982;&#x679C;Initializer&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6BD4;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6210;&#x5458;&#x5C11;&#xFF0C;&#x672A;&#x6307;&#x5B9A;&#x7684;&#x6210;&#x5458;&#x5C06;&#x7528;0&#x6765;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5C31;&#x50CF;&#x672A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E00;&#x6837;&#x3002;&#x4F8B;&#x5982;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x521D;&#x59CB;&#x5316;&#x90FD;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF1A;</p><pre class="programlisting">double x = 3.0;
struct complex_struct z1 = { x, 4.0, }; /* z1.x=3.0, z1.y=4.0 */
struct complex_struct z2 = { 3.0, }; /* z2.x=3.0, z2.y=0.0 */
struct complex_struct z3 = { 0 }; /* z3.x=0.0, z3.y=0.0 */</pre><p>&#x6CE8;&#x610F;&#xFF0C;<code class="literal">z1</code>&#x5FC5;&#x987B;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x624D;&#x80FD;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;<code class="literal">x</code>&#x7684;&#x503C;&#x6765;&#x521D;&#x59CB;&#x5316;&#x5B83;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5C31;&#x53EA;&#x80FD;&#x7528;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x521D;&#x59CB;&#x5316;&#x3002;&#x8FD9;&#x4E5F;&#x662F;C99&#x7684;&#x65B0;&#x7279;&#x6027;&#xFF0C;C89&#x53EA;&#x5141;&#x8BB8;&#x5728;{}&#x4E2D;&#x4F7F;&#x7528;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x521D;&#x59CB;&#x5316;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x8FD8;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</p><p>{}&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x8D4B;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x8FD9;&#x6837;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF1A;</p><pre class="programlisting">struct complex_struct z1;
z1 = { 3.0, 4.0 };</pre><p>&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x521D;&#x59CB;&#x5316;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x6240;&#x4F7F;&#x7528;&#x7684;Initializer&#x90FD;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8D4B;&#x503C;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x7531;{}&#x62EC;&#x8D77;&#x6765;&#x7684;Initializer&#x5E76;&#x4E0D;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x8D4B;&#x503C;<sup>[<a id="id2730593" href="#ftn.id2730593" class="footnote">14</a>]</sup>&#x3002;Initializer&#x7684;&#x8BED;&#x6CD5;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#xFF1A;</p><div class="literallayout"><p>Initializer&#xA0;&#x2192;&#xA0;&#x8868;&#x8FBE;&#x5F0F;<br>
Initializer&#xA0;&#x2192;&#xA0;{&#xA0;&#x521D;&#x59CB;&#x5316;&#x5217;&#x8868;&#xA0;}&#xA0;<br>
&#x521D;&#x59CB;&#x5316;&#x5217;&#x8868;&#xA0;&#x2192;&#xA0;Designated-Initializer,&#xA0;Designated-Initializer,&#xA0;...<br>
&#xFF08;&#x6700;&#x540E;&#x4E00;&#x4E2A;Designated-Initializer&#x672B;&#x5C3E;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x4F59;&#x7684;,&#x53F7;&#xFF09;<br>
Designated-Initializer&#xA0;&#x2192;&#xA0;Initializer<br>
Designated-Initializer&#xA0;&#x2192;&#xA0;.&#x6807;&#x8BC6;&#x7B26;&#xA0;=&#xA0;Initializer<br>
Designated-Initializer&#xA0;&#x2192;&#xA0;[&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;]&#xA0;=&#xA0;Initializer</p></div><p>Designated Initializer<a id="id2730636" class="indexterm"></a>&#x662F;C99&#x5F15;&#x5165;&#x7684;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x7528;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#x7A00;&#x758F;&#xFF08;Sparse&#xFF09;<a id="id2730644" class="indexterm"></a>&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x7A00;&#x758F;&#x6570;&#x7EC4;&#x5F88;&#x65B9;&#x4FBF;&#x3002;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x7ED3;&#x6784;&#x4F53;&#x6216;&#x6570;&#x7EC4;&#x4E2D;&#x53EA;&#x6709;&#x67D0;&#x4E00;&#x4E2A;&#x6216;&#x67D0;&#x51E0;&#x4E2A;&#x6210;&#x5458;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5176;&#x5B83;&#x6210;&#x5458;&#x90FD;&#x7528;0&#x521D;&#x59CB;&#x5316;&#x5373;&#x53EF;&#xFF0C;&#x7528;Designated Initializer&#x8BED;&#x6CD5;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x6210;&#x5458;&#x505A;&#x521D;&#x59CB;&#x5316;&#xFF08;Memberwise Initialization&#xFF09;<a id="id2730654" class="indexterm"></a>&#xFF0C;&#x5F88;&#x65B9;&#x4FBF;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">struct complex_struct z1 = { .y = 4.0 }; /* z1.x=0.0, z1.y=4.0 */</pre><p>&#x6570;&#x7EC4;&#x7684;Memberwise Initialization&#x8BED;&#x6CD5;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4ECB;&#x7ECD;&#x3002;</p><p>&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x7528;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x9650;&#x5236;&#xFF0C;&#x4E0D;&#x50CF;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x90A3;&#x4E48;&#x81EA;&#x7531;&#xFF0C;&#x6BD4;&#x5982;+ - * /&#x7B49;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&amp;&amp; || !&#x7B49;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#x90FD;&#x4E0D;&#x80FD;&#x4F5C;&#x7528;&#x4E8E;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;<code class="literal">if</code>&#x8BED;&#x53E5;&#x3001;<code class="literal">while</code>&#x8BED;&#x53E5;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x4E5F;&#x4E0D;&#x80FD;&#x662F;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x3002;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7684;&#x7C7B;&#x578B;&#x79F0;&#x4E3A;&#x7B97;&#x672F;&#x7C7B;&#x578B;&#xFF08;Arithmetic Type&#xFF09;<a id="id2730692" class="indexterm"></a>&#xFF0C;&#x7B97;&#x672F;&#x7C7B;&#x578B;&#x5305;&#x62EC;&#x6574;&#x578B;&#x548C;&#x6D6E;&#x70B9;&#x578B;&#x3002;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x96F6;&#x548C;&#x975E;&#x96F6;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x4E0E;&#x903B;&#x8F91;&#x4E0E;&#x3001;&#x6216;&#x3001;&#x975E;&#x8FD0;&#x7B97;&#x6216;&#x8005;&#x505A;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x79F0;&#x4E3A;&#x6807;&#x91CF;&#x7C7B;&#x578B;&#xFF08;Scalar Type&#xFF09;<a id="id2730702" class="indexterm"></a>&#xFF0C;&#x6807;&#x91CF;&#x7C7B;&#x578B;&#x5305;&#x62EC;&#x7B97;&#x672F;&#x7C7B;&#x578B;&#x548C;&#x4EE5;&#x540E;&#x8981;&#x8BB2;&#x7684;&#x6307;&#x9488;&#x7C7B;&#x578B;&#xFF0C;&#x8BE6;&#x89C1;<a class="xref" href="ch23s09.html#pointer.typesummary">&#x56FE;&#xA0;23.5 &#x201C;C&#x8BED;&#x8A00;&#x7C7B;&#x578B;&#x603B;&#x7ED3;&#x201D;</a>&#x3002;</p><p>&#x7ED3;&#x6784;&#x4F53;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;&#x7B26;&#x662F;&#x5141;&#x8BB8;&#x7684;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x53D8;&#x91CF;&#x521D;&#x59CB;&#x5316;&#x53E6;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x53D8;&#x91CF;&#x4E5F;&#x662F;&#x5141;&#x8BB8;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">struct complex_struct z1 = { 3.0, 4.0 };
struct complex_struct z2 = z1;
z1 = z2;</pre><p>&#x540C;&#x6837;&#x5730;&#xFF0C;<code class="literal">z2</code>&#x5FC5;&#x987B;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x624D;&#x80FD;&#x7528;&#x53D8;&#x91CF;<code class="literal">z1</code>&#x7684;&#x503C;&#x6765;&#x521D;&#x59CB;&#x5316;&#x3002;&#x65E2;&#x7136;&#x7ED3;&#x6784;&#x4F53;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x8D4B;&#x503C;&#x548C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4E5F;&#x5C31;&#x53EF;&#x4EE5;&#x5F53;&#x4F5C;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x6765;&#x4F20;&#x9012;&#xFF1A;</p><pre class="programlisting">struct complex_struct add_complex(struct complex_struct z1, struct complex_struct z2)
{
	z1.x = z1.x + z2.x;
	z1.y = z1.y + z2.y;
	return z1;
}</pre><p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x590D;&#x6570;&#x76F8;&#x52A0;&#xFF0C;&#x5982;&#x679C;&#x5728;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x8FD9;&#x6837;&#x8C03;&#x7528;&#xFF1A;</p><pre class="programlisting">struct complex_struct z = { 3.0, 4.0 };
z = add_complex(z, z);</pre><p>&#x90A3;&#x4E48;&#x8C03;&#x7528;&#x4F20;&#x53C2;&#x7684;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><div class="figure"><a id="id2730772"></a><p class="title"><b>&#x56FE;&#xA0;7.2.&#xA0;&#x7ED3;&#x6784;&#x4F53;&#x4F20;&#x53C2;</b></p><div class="figure-contents"><div><img src="images/struct.parameter.png" alt="&#x7ED3;&#x6784;&#x4F53;&#x4F20;&#x53C2;"></div></div></div><br class="figure-break"><p>&#x53D8;&#x91CF;<code class="literal">z</code>&#x5728;<code class="literal">main</code>&#x51FD;&#x6570;&#x7684;&#x6808;&#x5E27;&#x4E0A;&#xFF0C;&#x53C2;&#x6570;<code class="literal">z1</code>&#x548C;<code class="literal">z2</code>&#x5728;<code class="literal">add_complex</code>&#x51FD;&#x6570;&#x7684;&#x6808;&#x5E27;&#x4E0A;&#xFF0C;<code class="literal">z</code>&#x7684;&#x503C;&#x5206;&#x522B;&#x8D4B;&#x7ED9;<code class="literal">z1</code>&#x548C;<code class="literal">z2</code>&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x91CC;&#xFF0C;<code class="literal">z2</code>&#x7684;&#x5B9E;&#x90E8;&#x548C;&#x865A;&#x90E8;&#x88AB;&#x7D2F;&#x52A0;&#x5230;<code class="literal">z1</code>&#x4E2D;&#xFF0C;&#x7136;&#x540E;<code class="literal">return z1;</code>&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x662F;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x7528;<code class="literal">z1</code>&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x3002;</p></li><li><p>&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x5E76;&#x91CA;&#x653E;&#x6808;&#x5E27;&#x3002;</p></li><li><p>&#x628A;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;<code class="literal">z</code>&#xFF0C;&#x91CA;&#x653E;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x3002;</p></li></ol></div><p>&#x7531;.&#x8FD0;&#x7B97;&#x7B26;&#x7EC4;&#x6210;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x80FD;&#x4E0D;&#x80FD;&#x505A;&#x5DE6;&#x503C;&#x53D6;&#x51B3;&#x4E8E;.&#x8FD0;&#x7B97;&#x7B26;&#x5DE6;&#x8FB9;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x80FD;&#x4E0D;&#x80FD;&#x505A;&#x5DE6;&#x503C;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code class="literal">z</code>&#x662F;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">z.x</code>&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#xFF0C;&#x4F46;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">add_complex(z, z).x</code>&#x53EA;&#x80FD;&#x505A;&#x53F3;&#x503C;&#x800C;&#x4E0D;&#x80FD;&#x505A;&#x5DE6;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">add_complex(z, z)</code>&#x4E0D;&#x80FD;&#x505A;&#x5DE6;&#x503C;&#x3002;</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2730268" href="#id2730268" class="para">12</a>] </sup>&#x5176;&#x5B9E;C99&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x4E86;&#x590D;&#x6570;&#x7C7B;&#x578B;<code class="literal">_Complex</code>&#x3002;&#x5982;&#x679C;&#x5305;&#x542B;C&#x6807;&#x51C6;&#x5E93;&#x7684;&#x5934;&#x6587;&#x4EF6;<code class="literal">complex.h</code>&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;<code class="literal">complex</code>&#x505A;&#x7C7B;&#x578B;&#x540D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x5305;&#x542B;&#x5934;&#x6587;&#x4EF6;<code class="literal">complex.h</code>&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x6807;&#x8BC6;&#x7B26;<code class="literal">complex</code>&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x6DF7;&#x6DC6;&#xFF0C;&#x672C;&#x7AE0;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x90FD;&#x7528;<code class="literal">complex_struct</code>&#x505A;&#x6807;&#x8BC6;&#x7B26;&#x800C;&#x4E0D;&#x7528;<code class="literal">complex</code>&#x3002;</p></div><div class="footnote"><p><sup>[<a id="ftn.id2730413" href="#id2730413" class="para">13</a>] </sup>&#x6211;&#x4EEC;&#x5728;<a class="xref" href="ch19s04.html#asmc.structunion">&#x7B2C;&#xA0;4&#xA0;&#x8282; &#x201C;&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x8054;&#x5408;&#x4F53;&#x201D;</a>&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x4E4B;&#x95F4;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x82E5;&#x5E72;&#x4E2A;&#x586B;&#x5145;&#x5B57;&#x8282;&#x3002;</p></div><div class="footnote"><p><sup>[<a id="ftn.id2730593" href="#id2730593" class="para">14</a>] </sup>C99&#x5F15;&#x5165;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x6CD5;Compound Literal<a id="id2730598" class="indexterm"></a>&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8D4B;&#x503C;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">z1 = (struct complex_struct){ 3.0, 4.0 };</code>&#xFF0C;&#x672C;&#x4E66;&#x4E0D;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B0;&#x8BED;&#x6CD5;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch07.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch07.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch07s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;7&#xA0;&#x7AE0;&#xA0;&#x7ED3;&#x6784;&#x4F53;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x6570;&#x636E;&#x62BD;&#x8C61;</td></tr></tbody></table></div>
</body></html>