<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x6570;&#x7EC4;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch08.html" title="&#x7B2C;&#xA0;8&#xA0;&#x7AE0;&#xA0;&#x6570;&#x7EC4;"><link rel="prev" href="ch08.html" title="&#x7B2C;&#xA0;8&#xA0;&#x7AE0;&#xA0;&#x6570;&#x7EC4;"><link rel="next" href="ch08s02.html" title="2.&#xA0;&#x6570;&#x7EC4;&#x5E94;&#x7528;&#x5B9E;&#x4F8B;&#xFF1A;&#x7EDF;&#x8BA1;&#x968F;&#x673A;&#x6570;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x6570;&#x7EC4;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch08.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;8&#xA0;&#x7AE0;&#xA0;&#x6570;&#x7EC4;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch08s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2733213"></a>1.&#xA0;&#x6570;&#x7EC4;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</h2></div></div></div><p>&#x6570;&#x7EC4;&#xFF08;Array&#xFF09;<a id="id2732586" class="indexterm"></a>&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x590D;&#x5408;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5143;&#x7D20;&#xFF08;Element&#xFF09;<a id="id2732594" class="indexterm"></a>&#x7EC4;&#x6210;&#x3002;&#x4F8B;&#x5982;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7531;4&#x4E2A;<code class="literal">int</code>&#x578B;&#x5143;&#x7D20;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;count&#xFF1A;</p><pre class="programlisting">int count[4];</pre><p>&#x548C;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x7C7B;&#x4F3C;&#xFF0C;&#x6570;&#x7EC4;<code class="literal">count</code>&#x7684;4&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E5F;&#x662F;&#x76F8;&#x90BB;&#x7684;&#x3002;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x53EF;&#x4EE5;&#x662F;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x590D;&#x5408;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x6839;&#x636E;&#x7EC4;&#x5408;&#x89C4;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7531;4&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x5143;&#x7D20;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;&#xFF1A;</p><pre class="programlisting">struct complex_struct {
	double x, y;
} a[4];</pre><p>&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6570;&#x7EC4;&#x6210;&#x5458;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF1A;</p><pre class="programlisting">struct {
	double x, y;
	int count[4];
} s;</pre><p>&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x7684;&#x957F;&#x5EA6;&#x5E94;&#x8BE5;&#x7528;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x6307;&#x5B9A;<sup>[<a id="id2733250" href="#ftn.id2733250" class="footnote">16</a>]</sup>&#x3002;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x901A;&#x8FC7;&#x4E0B;&#x6807;&#xFF08;&#x6216;&#x8005;&#x53EB;&#x7D22;&#x5F15;&#xFF0C;Index&#xFF09;<a id="id2733270" class="indexterm"></a>&#x6765;&#x8BBF;&#x95EE;&#x3002;&#x4F8B;&#x5982;&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x7531;4&#x4E2A;<code class="literal">int</code>&#x578B;&#x5143;&#x7D20;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;<code class="literal">count</code>&#x56FE;&#x793A;&#x5982;&#x4E0B;&#xFF1A;</p><div class="figure"><a id="id2733290"></a><p class="title"><b>&#x56FE;&#xA0;8.1.&#xA0;&#x6570;&#x7EC4;count</b></p><div class="figure-contents"><div><img src="images/array.count.png" alt="&#x6570;&#x7EC4;count"></div></div></div><br class="figure-break"><p>&#x6574;&#x4E2A;&#x6570;&#x7EC4;&#x5360;&#x4E86;4&#x4E2A;<code class="literal">int</code>&#x578B;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x7528;&#x5C0F;&#x65B9;&#x6846;&#x8868;&#x793A;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x6570;&#x5B57;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x8FD9;&#x4E2A;&#x5355;&#x5143;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF08;&#x5047;&#x8BBE;&#x90FD;&#x662F;0&#xFF09;&#xFF0C;&#x800C;&#x6846;&#x5916;&#x9762;&#x7684;&#x6570;&#x5B57;&#x662F;&#x4E0B;&#x6807;&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x5355;&#x5143;&#x5206;&#x522B;&#x7528;<code class="literal">count[0]</code>&#x3001;<code class="literal">count[1]</code>&#x3001;<code class="literal">count[2]</code>&#x3001;<code class="literal">count[3]</code>&#x6765;&#x8BBF;&#x95EE;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;<code class="literal">int count[4];</code>&#x65F6;&#xFF0C;&#x65B9;&#x62EC;&#x53F7;&#xFF08;Bracket&#xFF09;<a id="id2733345" class="indexterm"></a>&#x4E2D;&#x7684;&#x6570;&#x5B57;4&#x8868;&#x793A;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x800C;&#x5728;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x65F6;&#xFF0C;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x8868;&#x793A;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x51E0;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x548C;&#x6211;&#x4EEC;&#x5E73;&#x5E38;&#x6570;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x662F;&#x4ECE;&#x201C;<span class="quote">&#x7B2C;0&#x4E2A;</span>&#x201D;&#x5F00;&#x59CB;&#x6570;&#x7684;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x662F;&#x8FD9;&#x4E48;&#x89C4;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8BA1;&#x7B97;&#x673A;&#x672F;&#x8BED;&#x4E2D;&#x6709;Zeroth<a id="id2733360" class="indexterm"></a>&#x8FD9;&#x4E2A;&#x8BCD;&#x3002;&#x8FD9;&#x6837;&#x89C4;&#x5B9A;&#x4F7F;&#x5F97;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF0C;&#x6BD4;&#x5982;<code class="literal">count</code>&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5360;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5219;<code class="literal">count[i]</code>&#x8868;&#x793A;&#x4ECE;&#x6570;&#x7EC4;&#x5F00;&#x5934;&#x8DF3;&#x8FC7;<code class="literal">4*i</code>&#x4E2A;&#x5B57;&#x8282;&#x4E4B;&#x540E;&#x7684;&#x90A3;&#x4E2A;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x3002;&#x8FD9;&#x79CD;&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x672C;&#x8EAB;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x4EE5;&#x4E0B;&#x8BED;&#x53E5;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF1A;</p><pre class="programlisting">count[0] = 7;
count[1] = count[0] * 2;
++count[2];</pre><p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E86;&#x4E94;&#x79CD;&#x540E;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x540E;&#x7F00;++&#x3001;&#x540E;&#x7F00;--&#x3001;&#x7ED3;&#x6784;&#x4F53;&#x53D6;&#x6210;&#x5458;.&#x3001;&#x6570;&#x7EC4;&#x53D6;&#x4E0B;&#x6807;[]&#x3001;&#x51FD;&#x6570;&#x8C03;&#x7528;()&#x3002;&#x8FD8;&#x5B66;&#x4E60;&#x4E86;&#x4E94;&#x79CD;&#x5355;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&#x6216;&#x8005;&#x53EB;&#x524D;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#xFF09;&#xFF1A;&#x524D;&#x7F00;++&#x3001;&#x524D;&#x7F00;--&#x3001;&#x6B63;&#x53F7;+&#x3001;&#x8D1F;&#x53F7;-&#x3001;&#x903B;&#x8F91;&#x975E;!&#x3002;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x540E;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x9AD8;&#xFF0C;&#x5355;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4EC5;&#x6B21;&#x4E8E;&#x540E;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x6BD4;&#x5176;&#x5B83;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x90FD;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x4E0A;&#x9762;&#x4E3E;&#x4F8B;&#x7684;<code class="literal">++count[2]</code>&#x5E94;&#x8BE5;&#x770B;&#x4F5C;&#x5BF9;<code class="literal">count[2]</code>&#x505A;&#x524D;&#x7F00;++&#x8FD0;&#x7B97;&#x3002;</p><p>&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F46;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x5FC5;&#x987B;&#x662F;&#x6574;&#x578B;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int i = 10;
count[i] = count[i+1];</pre><p>&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x4E0D;&#x80FD;&#x8D85;&#x51FA;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x8303;&#x56F4;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5728;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x505A;&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x65F6;&#x5C24;&#x5176;&#x8981;&#x6CE8;&#x610F;&#x3002;C&#x7F16;&#x8BD1;&#x5668;&#x5E76;&#x4E0D;&#x68C0;&#x67E5;<code class="literal">count[-1]</code>&#x6216;&#x662F;<code class="literal">count[100]</code>&#x8FD9;&#x6837;&#x7684;&#x8BBF;&#x95EE;&#x8D8A;&#x754C;&#x9519;&#x8BEF;&#xFF0C;&#x7F16;&#x8BD1;&#x65F6;&#x80FD;&#x987A;&#x5229;&#x901A;&#x8FC7;&#xFF0C;&#x6240;&#x4EE5;&#x5C5E;&#x4E8E;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;<sup>[<a id="id2733456" href="#ftn.id2733456" class="footnote">17</a>]</sup>&#x3002;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x5F88;&#x9690;&#x853D;&#xFF0C;&#x53D1;&#x751F;&#x8BBF;&#x95EE;&#x8D8A;&#x754C;&#x65F6;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x5D29;&#x6E83;&#xFF0C;&#x800C;&#x6267;&#x884C;&#x5230;&#x540E;&#x9762;&#x67D0;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x8BED;&#x53E5;&#x65F6;&#x5374;&#x6709;&#x53EF;&#x80FD;&#x7A81;&#x7136;&#x5D29;&#x6E83;&#xFF08;&#x5728;<a class="xref" href="ch10s04.html#gdb.segfault">&#x7B2C;&#xA0;4&#xA0;&#x8282; &#x201C;&#x6BB5;&#x9519;&#x8BEF;&#x201D;</a>&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x5C31;&#x8981;&#x5C0F;&#x5FC3;&#x907F;&#x514D;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x4E8B;&#x540E;&#x4F9D;&#x9760;&#x8C03;&#x8BD5;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x6210;&#x672C;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x3002;</p><p>&#x6570;&#x7EC4;&#x4E5F;&#x53EF;&#x4EE5;&#x50CF;&#x7ED3;&#x6784;&#x4F53;&#x4E00;&#x6837;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x672A;&#x8D4B;&#x521D;&#x503C;&#x7684;&#x5143;&#x7D20;&#x4E5F;&#x662F;&#x7528;0&#x6765;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int count[4] = { 3, 2, };</pre><p>&#x5219;<code class="literal">count[0]</code>&#x7B49;&#x4E8E;3&#xFF0C; <code class="literal">count[1]</code>&#x7B49;&#x4E8E;2&#xFF0C;&#x540E;&#x9762;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x7B49;&#x4E8E;0&#x3002;&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;&#x7684;&#x540C;&#x65F6;&#x521D;&#x59CB;&#x5316;&#x5B83;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x6307;&#x5B9A;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int count[] = { 3, 2, 1, };</pre><p>&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x6839;&#x636E;Initializer&#x6709;&#x4E09;&#x4E2A;&#x5143;&#x7D20;&#x786E;&#x5B9A;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x4E3A;3&#x3002;&#x5229;&#x7528;C99&#x7684;&#x65B0;&#x7279;&#x6027;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;Memberwise Initialization&#xFF1A;</p><pre class="programlisting">int count[4] = { [2] = 3 };</pre><p>&#x4E0B;&#x9762;&#x4E3E;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p><div class="example"><a id="id2733545"></a><p class="title"><b>&#x4F8B;&#xA0;8.1.&#xA0;&#x5B9A;&#x4E49;&#x548C;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

int main(void)
{
	int count[4] = { 3, 2, }, i;

	for (i = 0; i &lt; 4; i++)
		printf(&quot;count[%d]=%d\n&quot;, i, count[i]);
	return 0;
}</pre></div></div><br class="example-break"><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x901A;&#x8FC7;&#x5FAA;&#x73AF;&#x628A;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x4F9D;&#x6B21;&#x8BBF;&#x95EE;&#x4E00;&#x904D;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x672F;&#x8BED;&#x4E2D;&#x79F0;&#x4E3A;&#x904D;&#x5386;&#xFF08;Traversal&#xFF09;<a id="id2733562" class="indexterm"></a>&#x3002;&#x6CE8;&#x610F;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">i &lt; 4</code>&#xFF0C;&#x5982;&#x679C;&#x5199;&#x6210;<code class="literal">i &lt;= 4</code>&#x5C31;&#x9519;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;<code class="literal">count[4]</code>&#x662F;&#x8BBF;&#x95EE;&#x8D8A;&#x754C;&#x3002;</p><p>&#x6570;&#x7EC4;&#x548C;&#x7ED3;&#x6784;&#x4F53;&#x867D;&#x7136;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x7684;&#x4E0D;&#x540C;&#xFF1A;&#x6570;&#x7EC4;&#x4E0D;&#x80FD;&#x76F8;&#x4E92;&#x8D4B;&#x503C;&#x6216;&#x521D;&#x59CB;&#x5316;&#x3002;&#x4F8B;&#x5982;&#x8FD9;&#x6837;&#x662F;&#x9519;&#x7684;&#xFF1A;</p><pre class="programlisting">int a[5] = { 4, 3, 2, 1 };
int b[5] = a;</pre><p>&#x76F8;&#x4E92;&#x8D4B;&#x503C;&#x4E5F;&#x662F;&#x9519;&#x7684;&#xFF1A;</p><pre class="programlisting">a = b;</pre><p>&#x65E2;&#x7136;&#x4E0D;&#x80FD;&#x76F8;&#x4E92;&#x8D4B;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;<span class="emphasis"><em>&#x4E0D;&#x80FD;&#x7528;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x6216;&#x8FD4;&#x56DE;&#x503C;</em></span>&#x3002;&#x5982;&#x679C;&#x5199;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF1A;</p><pre class="programlisting">void foo(int a[5])
{
	...
}</pre><p>&#x7136;&#x540E;&#x8FD9;&#x6837;&#x8C03;&#x7528;&#xFF1A;</p><pre class="programlisting">int array[5] = {0};
foo(array);</pre><p>&#x7F16;&#x8BD1;&#x5668;&#x4E5F;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x5199;&#x5E76;&#x4E0D;&#x662F;&#x4F20;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x7684;&#x610F;&#x601D;&#x3002;&#x5BF9;&#x4E8E;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x6709;&#x4E00;&#x6761;&#x7279;&#x6B8A;&#x89C4;&#x5219;&#xFF1A;<span class="emphasis"><em>&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x505A;&#x53F3;&#x503C;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x6210;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x9996;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;</em></span>&#x3002;&#x6240;&#x4EE5;&#x4E0A;&#x9762;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5176;&#x5B9E;&#x662F;&#x4F20;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x7AE0;&#x91CC;&#x6709;&#x7684;&#x51FD;&#x6570;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x6570;&#x7EC4;&#x5B9A;&#x4E49;&#x4E3A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7ED9;&#x51FD;&#x6570;&#x8BBF;&#x95EE;&#xFF0C;&#x7B49;&#x4EE5;&#x540E;&#x8BB2;&#x4E86;&#x6307;&#x9488;&#x518D;&#x4F7F;&#x7528;&#x4F20;&#x53C2;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x8FD9;&#x4E5F;&#x89E3;&#x91CA;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x4E0D;&#x80FD;&#x76F8;&#x4E92;&#x8D4B;&#x503C;&#x6216;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;<code class="literal">a = b</code>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;<code class="literal">a</code>&#x548C;<code class="literal">b</code>&#x90FD;&#x662F;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x662F;<code class="literal">b</code>&#x505A;&#x53F3;&#x503C;&#x4F7F;&#x7528;&#xFF0C;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x6210;&#x6307;&#x9488;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x5DE6;&#x8FB9;&#x4ECD;&#x7136;&#x662F;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x5668;&#x62A5;&#x7684;&#x9519;&#x662F;<code class="literal">error: incompatible types in assignment</code>&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2733680"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x7C7B;&#x578B;&#x548C;&#x957F;&#x5EA6;&#x90FD;&#x76F8;&#x540C;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x5C06;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x62F7;&#x8D1D;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x3002;&#x65E2;&#x7136;&#x6570;&#x7EC4;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8D4B;&#x503C;&#xFF0C;&#x60F3;&#x60F3;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x3002;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2733250" href="#id2733250" class="para">16</a>] </sup>C99&#x7684;&#x65B0;&#x7279;&#x6027;&#x5141;&#x8BB8;&#x5728;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#xFF0C;&#x79F0;&#x4E3A;&#x53D8;&#x957F;&#x6570;&#x7EC4;&#xFF08;VLA&#xFF0C;Variable Length Array&#xFF09;<a id="id2733257" class="indexterm"></a>&#xFF0C;VLA&#x53EA;&#x80FD;&#x5B9A;&#x4E49;&#x4E3A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x800C;&#x4E0D;&#x80FD;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x4E0E;VLA&#x6709;&#x5173;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x591A;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x3002;</p></div><div class="footnote"><p><sup>[<a id="ftn.id2733456" href="#id2733456" class="para">17</a>] </sup>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x4E3A;&#x4EC0;&#x4E48;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x8FD9;&#x4E48;&#x660E;&#x663E;&#x7684;&#x9519;&#x8BEF;&#x90FD;&#x89C6;&#x800C;&#x4E0D;&#x89C1;&#xFF1F;&#x7406;&#x7531;&#x4E00;&#xFF0C;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#xFF0C;&#x5728;<a class="xref" href="ch23s01.html#pointer.intro">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x6307;&#x9488;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x201D;</a>&#x4F1A;&#x8BB2;&#x5230;&#x901A;&#x8FC7;&#x6307;&#x9488;&#x800C;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#x540D;&#x6765;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6307;&#x9488;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4EC0;&#x4E48;&#x4F4D;&#x7F6E;&#x53EA;&#x6709;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x7F16;&#x8BD1;&#x65F6;&#x65E0;&#x6CD5;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x8D8A;&#x754C;&#xFF0C;&#x800C;&#x8FD0;&#x884C;&#x65F6;&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x90FD;&#x68C0;&#x67E5;&#x8D8A;&#x754C;&#x4F1A;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x5E72;&#x8106;&#x4E0D;&#x68C0;&#x67E5;&#x4E86;&#xFF1B;&#x7406;&#x7531;&#x4E8C;&#xFF0C;<a class="xref" href="bi01.html#bibli.rationale" title="Rationale for International Standard &#xFF0D; Programming Languages &#xFF0D; C">[<abbr class="abbrev">C99 Rationale</abbr>]</a>&#x6307;&#x51FA;C&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x7CBE;&#x795E;&#x662F;&#xFF1A;&#x76F8;&#x4FE1;&#x6BCF;&#x4E2A;C&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x9AD8;&#x624B;&#xFF0C;&#x4E0D;&#x8981;&#x963B;&#x6B62;&#x7A0B;&#x5E8F;&#x5458;&#x53BB;&#x5E72;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x5E72;&#x7684;&#x4E8B;&#xFF0C;&#x9AD8;&#x624B;&#x4EEC;&#x4F7F;&#x7528;<code class="literal">count[-1]</code>&#x8FD9;&#x79CD;&#x6280;&#x5DE7;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x5C11;&#x89C1;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x5F53;&#x4F5C;&#x9519;&#x8BEF;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch08.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch08.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch08s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;8&#xA0;&#x7AE0;&#xA0;&#x6570;&#x7EC4;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x6570;&#x7EC4;&#x5E94;&#x7528;&#x5B9E;&#x4F8B;&#xFF1A;&#x7EDF;&#x8BA1;&#x968F;&#x673A;&#x6570;</td></tr></tbody></table></div>
</body></html>