<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x7F29;&#x8FDB;&#x548C;&#x7A7A;&#x767D;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch09.html" title="&#x7B2C;&#xA0;9&#xA0;&#x7AE0;&#xA0;&#x7F16;&#x7801;&#x98CE;&#x683C;"><link rel="prev" href="ch09.html" title="&#x7B2C;&#xA0;9&#xA0;&#x7AE0;&#xA0;&#x7F16;&#x7801;&#x98CE;&#x683C;"><link rel="next" href="ch09s02.html" title="2.&#xA0;&#x6CE8;&#x91CA;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x7F29;&#x8FDB;&#x548C;&#x7A7A;&#x767D;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch09.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;9&#xA0;&#x7AE0;&#xA0;&#x7F16;&#x7801;&#x98CE;&#x683C;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch09s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2737006"></a>1.&#xA0;&#x7F29;&#x8FDB;&#x548C;&#x7A7A;&#x767D;</h2></div></div></div><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;C&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x6CD5;&#x5BF9;&#x7F29;&#x8FDB;&#x548C;&#x7A7A;&#x767D;&#x6CA1;&#x6709;&#x8981;&#x6C42;&#xFF0C;&#x7A7A;&#x683C;&#x3001;Tab&#x3001;&#x6362;&#x884C;&#x90FD;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x5199;&#xFF0C;&#x5B9E;&#x73B0;&#x540C;&#x6837;&#x529F;&#x80FD;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5199;&#x5F97;&#x5F88;&#x597D;&#x770B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x5F97;&#x5F88;&#x96BE;&#x770B;&#x3002;&#x4F8B;&#x5982;&#x4E0A;&#x4E00;&#x7AE0;<a class="xref" href="ch08s05.html#array.scissor">&#x4F8B;&#xA0;8.5 &#x201C;&#x526A;&#x5200;&#x77F3;&#x5934;&#x5E03;&#x201D;</a>&#x7684;&#x4EE3;&#x7801;&#x5982;&#x679C;&#x5199;&#x6210;&#x8FD9;&#x6837;&#x5C31;&#x5F88;&#x96BE;&#x770B;&#x4E86;&#xFF1A;</p><div class="example"><a id="id2737667"></a><p class="title"><b>&#x4F8B;&#xA0;9.1.&#xA0;&#x7F3A;&#x5C11;&#x7F29;&#x8FDB;&#x548C;&#x7A7A;&#x767D;&#x7684;&#x4EE3;&#x7801;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;time.h&gt;
int main(void)
{
char gesture[3][10]={&quot;scissor&quot;,&quot;stone&quot;,&quot;cloth&quot;};
int man,computer,result, ret;
srand(time(NULL));
while(1){
computer=rand()%3;
printf(&quot;\nInput your gesture (0-scissor 1-stone 2-cloth):\n&quot;);
ret=scanf(&quot;%d&quot;,&amp;man);
if(ret!=1||man&lt;0||man&gt;2){
printf(&quot;Invalid input! Please input 0, 1 or 2.\n&quot;);
continue;
}
printf(&quot;Your gesture: %s\tComputer&apos;s gesture: %s\n&quot;,gesture[man],gesture[computer]);
result=(man-computer+4)%3-1;
if(result&gt;0)printf(&quot;You win!\n&quot;);
else if(result==0)printf(&quot;Draw!\n&quot;);
else printf(&quot;You lose!\n&quot;);
}
return 0;
}</pre></div></div><br class="example-break"><p>&#x4E00;&#x662F;&#x7F3A;&#x5C11;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF0C;&#x4EE3;&#x7801;&#x5BC6;&#x5EA6;&#x592A;&#x5927;&#xFF0C;&#x770B;&#x7740;&#x5F88;&#x8D39;&#x52B2;&#x3002;&#x4E8C;&#x662F;&#x6CA1;&#x6709;&#x7F29;&#x8FDB;&#xFF0C;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#x54EA;&#x4E2A;{&#x548C;&#x54EA;&#x4E2A;}&#x914D;&#x5BF9;&#xFF0C;&#x50CF;&#x8FD9;&#x4E48;&#x77ED;&#x7684;&#x4EE3;&#x7801;&#x8FD8;&#x80FD;&#x51D1;&#x5408;&#x7740;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x8D85;&#x8FC7;&#x4E00;&#x5C4F;&#x5C31;&#x5B8C;&#x5168;&#x6CA1;&#x6CD5;&#x770B;&#x4E86;&#x3002;<a class="xref" href="bi01.html#bibli.codingstyle" title="Linux&#x5185;&#x6838;&#x6E90;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x4E0B;&#x7684;Documentation/CodingStyle&#x6587;&#x4EF6;">[<abbr class="abbrev">CodingStyle</abbr>]</a>&#x4E2D;&#x5173;&#x4E8E;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x5E76;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x89C4;&#x5B9A;&#xFF0C;&#x56E0;&#x4E3A;&#x57FA;&#x672C;&#x4E0A;&#x6240;&#x6709;&#x7684;C&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x5BF9;&#x4E8E;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x7684;&#x89C4;&#x5B9A;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x6761;&#x3002;</p><p>1&#x3001;&#x5173;&#x952E;&#x5B57;<code class="literal">if</code>&#x3001;<code class="literal">while</code>&#x3001;<code class="literal">for</code>&#x4E0E;&#x5176;&#x540E;&#x7684;&#x63A7;&#x5236;&#x8868;&#x8FBE;&#x5F0F;&#x7684;(&#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x5206;&#x9694;&#xFF0C;&#x4F46;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5E94;&#x7D27;&#x8D34;&#x62EC;&#x53F7;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">while&#x2423;(1);</pre><p>2&#x3001;&#x53CC;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4E24;&#x4FA7;&#x5404;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x5206;&#x9694;&#xFF0C;&#x5355;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x4E4B;&#x95F4;&#x4E0D;&#x52A0;&#x7A7A;&#x683C;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">i&#x2423;=&#x2423;i&#x2423;+&#x2423;1</code>&#x3001;<code class="literal">++i</code>&#x3001;<code class="literal">!(i&#x2423;&lt;&#x2423;1)</code>&#x3001;<code class="literal">-x</code>&#x3001;<code class="literal">&amp;a[1]</code>&#x7B49;&#x3002;</p><p>3&#x3001;&#x540E;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x4E4B;&#x95F4;&#x4E5F;&#x4E0D;&#x52A0;&#x7A7A;&#x683C;&#xFF0C;&#x4F8B;&#x5982;&#x53D6;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;<code class="literal">s.a</code>&#x3001;&#x51FD;&#x6570;&#x8C03;&#x7528;<code class="literal">foo(arg1)</code>&#x3001;&#x53D6;&#x6570;&#x7EC4;&#x6210;&#x5458;<code class="literal">a[i]</code>&#x3002;</p><p>4&#x3001;,&#x53F7;&#x548C;;&#x53F7;&#x4E4B;&#x540E;&#x8981;&#x52A0;&#x7A7A;&#x683C;&#xFF0C;&#x8FD9;&#x662F;&#x82F1;&#x6587;&#x7684;&#x4E66;&#x5199;&#x4E60;&#x60EF;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">for&#x2423;(i&#x2423;=&#x2423;1;&#x2423;i&#x2423;&lt;&#x2423;10;&#x2423;i++)</code>&#x3001;<code class="literal">foo(arg1,&#x2423;arg2)</code>&#x3002;</p><p>5&#x3001;&#x4EE5;&#x4E0A;&#x5173;&#x4E8E;&#x53CC;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x540E;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x89C4;&#x5219;&#x5E76;&#x6CA1;&#x6709;&#x4E25;&#x683C;&#x8981;&#x6C42;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4E3A;&#x4E86;&#x7A81;&#x51FA;&#x4F18;&#x5148;&#x7EA7;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x5F97;&#x66F4;&#x7D27;&#x51D1;&#x4E00;&#x4E9B;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">for&#x2423;(i=1;&#x2423;i&lt;10;&#x2423;i++)</code>&#x3001;<code class="literal">distance&#x2423;=&#x2423;sqrt(x*x&#x2423;+&#x2423;y*y)</code>&#x7B49;&#x3002;&#x4F46;&#x662F;&#x7701;&#x7565;&#x7684;&#x7A7A;&#x683C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x8BEF;&#x5BFC;&#x4E86;&#x8BFB;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">a||b&#x2423;&amp;&amp;&#x2423;c</code>&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x7406;&#x89E3;&#x6210;&#x9519;&#x8BEF;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;</p><p>6&#x3001;&#x7531;&#x4E8E;UNIX&#x7CFB;&#x7EDF;&#x6807;&#x51C6;&#x7684;&#x5B57;&#x7B26;&#x7EC8;&#x7AEF;&#x662F;24&#x884C;80&#x5217;&#x7684;&#xFF0C;&#x63A5;&#x8FD1;&#x6216;&#x5927;&#x4E8E;80&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x8F83;&#x957F;&#x8BED;&#x53E5;&#x8981;&#x6298;&#x884C;&#x5199;&#xFF0C;&#x6298;&#x884C;&#x540E;&#x7528;&#x7A7A;&#x683C;&#x548C;&#x4E0A;&#x9762;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6216;&#x53C2;&#x6570;&#x5BF9;&#x9F50;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">if&#x2423;(sqrt(x*x&#x2423;+&#x2423;y*y)&#x2423;&gt;&#x2423;5.0
    &amp;&amp;&#x2423;x&#x2423;&lt;&#x2423;0.0
    &amp;&amp;&#x2423;y&#x2423;&gt;&#x2423;0.0)</pre><p>&#x518D;&#x6BD4;&#x5982;&#xFF1A;</p><pre class="programlisting">foo(sqrt(x*x&#x2423;+&#x2423;y*y),
    a[i-1]&#x2423;+&#x2423;b[i-1]&#x2423;+&#x2423;c[i-1])</pre><p>7&#x3001;&#x8F83;&#x957F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x65AD;&#x6210;&#x591A;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7136;&#x540E;&#x5206;&#x884C;&#x4E66;&#x5199;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">printf(&quot;This is such a long sentence that &quot;
       &quot;it cannot be held within a line\n&quot;);</pre><p>C&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x628A;&#x76F8;&#x90BB;&#x7684;&#x591A;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x4E0A;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;<code class="literal">&quot;This is such a long sentence that it cannot be held within a line\n&quot;</code>&#x3002;</p><p>8&#x3001;&#x6709;&#x7684;&#x4EBA;&#x559C;&#x6B22;&#x5728;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x8BED;&#x53E5;&#x4E2D;&#x7528;Tab&#x5B57;&#x7B26;&#xFF0C;&#x4F7F;&#x53D8;&#x91CF;&#x540D;&#x5BF9;&#x9F50;&#xFF0C;&#x8FD9;&#x6837;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x7F8E;&#x89C2;&#x3002;</p><pre class="programlisting">       &#x2192;int    &#x2192;a, b;
       &#x2192;double &#x2192;c;</pre><p>&#x5185;&#x6838;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x5173;&#x4E8E;&#x7F29;&#x8FDB;&#x7684;&#x89C4;&#x5219;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x6761;&#x3002;</p><p>1&#x3001;&#x8981;&#x7528;&#x7F29;&#x8FDB;&#x4F53;&#x73B0;&#x51FA;&#x8BED;&#x53E5;&#x5757;&#x7684;&#x5C42;&#x6B21;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x7528;Tab&#x5B57;&#x7B26;&#x7F29;&#x8FDB;&#xFF0C;&#x4E0D;&#x80FD;&#x7528;&#x7A7A;&#x683C;&#x4EE3;&#x66FF;Tab&#x3002;&#x5728;&#x6807;&#x51C6;&#x7684;&#x5B57;&#x7B26;&#x7EC8;&#x7AEF;&#x4E0A;&#x4E00;&#x4E2A;Tab&#x770B;&#x8D77;&#x6765;&#x662F;8&#x4E2A;&#x7A7A;&#x683C;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;Tab&#x7684;&#x663E;&#x793A;&#x5BBD;&#x5EA6;&#x662F;&#x51E0;&#x4E2A;&#x7A7A;&#x683C;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E5F;&#x8BBE;&#x6210;8&#xFF0C;&#x8FD9;&#x6837;&#x5927;&#x7684;&#x7F29;&#x8FDB;&#x4F7F;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x6E05;&#x6670;&#x3002;&#x5982;&#x679C;&#x6709;&#x7684;&#x884C;&#x7528;&#x7A7A;&#x683C;&#x505A;&#x7F29;&#x8FDB;&#xFF0C;&#x6709;&#x7684;&#x884C;&#x7528;Tab&#x505A;&#x7F29;&#x8FDB;&#xFF0C;&#x751A;&#x81F3;&#x7A7A;&#x683C;&#x548C;Tab&#x6DF7;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x65E6;&#x6539;&#x53D8;&#x4E86;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x7684;Tab&#x663E;&#x793A;&#x5BBD;&#x5EA6;&#x5C31;&#x4F1A;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x6DF7;&#x4E71;&#xFF0C;&#x6240;&#x4EE5;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x89C4;&#x5B9A;&#x53EA;&#x80FD;&#x7528;Tab&#x505A;&#x7F29;&#x8FDB;&#xFF0C;&#x4E0D;&#x80FD;&#x7528;&#x7A7A;&#x683C;&#x4EE3;&#x66FF;Tab&#x3002;</p><p>2&#x3001;<code class="literal">if/else</code>&#x3001;<code class="literal">while</code>&#x3001;<code class="literal">do/while</code>&#x3001;<code class="literal">for</code>&#x3001;<code class="literal">switch</code>&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x5E26;&#x8BED;&#x53E5;&#x5757;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x8BED;&#x53E5;&#x5757;&#x7684;{&#x6216;}&#x5E94;&#x8BE5;&#x548C;&#x5173;&#x952E;&#x5B57;&#x5199;&#x5728;&#x540C;&#x4E00;&#x884C;&#xFF0C;&#x7528;&#x7A7A;&#x683C;&#x9694;&#x5F00;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5355;&#x72EC;&#x5360;&#x4E00;&#x884C;&#x3002;&#x4F8B;&#x5982;&#x5E94;&#x8BE5;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p><pre class="programlisting">if&#x2423;(...)&#x2423;{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}&#x2423;else&#x2423;if&#x2423;(...)&#x2423;{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}</pre><p>&#x4F46;&#x5F88;&#x591A;&#x4EBA;&#x4E60;&#x60EF;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p><pre class="programlisting">if&#x2423;(...)
{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}
else&#x2423;if&#x2423;(...)
{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}</pre><p>&#x5185;&#x6838;&#x7684;&#x5199;&#x6CD5;&#x548C;<a class="xref" href="bi01.html#bibli.kr" title="The C Programming Language">[<abbr class="abbrev">K&amp;R</abbr>]</a>&#x4E00;&#x81F4;&#xFF0C;&#x597D;&#x5904;&#x662F;&#x4E0D;&#x5FC5;&#x5360;&#x592A;&#x591A;&#x884C;&#xFF0C;&#x4F7F;&#x5F97;&#x4E00;&#x5C4F;&#x80FD;&#x663E;&#x793A;&#x66F4;&#x591A;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x5199;&#x6CD5;&#x7528;&#x5F97;&#x90FD;&#x5F88;&#x5E7F;&#x6CDB;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x80FD;&#x4FDD;&#x6301;&#x7EDF;&#x4E00;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p><p>3&#x3001;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x7684;{&#x548C;}&#x5355;&#x72EC;&#x5360;&#x4E00;&#x884C;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x548C;&#x8BED;&#x53E5;&#x5757;&#x7684;&#x89C4;&#x5B9A;&#x4E0D;&#x540C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int&#x2423;foo(int&#x2423;a,&#x2423;int&#x2423;b)
{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}</pre><p>4&#x3001;<code class="literal">switch</code>&#x548C;&#x8BED;&#x53E5;&#x5757;&#x91CC;&#x7684;<code class="literal">case</code>&#x3001;<code class="literal">default</code>&#x5BF9;&#x9F50;&#x5199;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8BED;&#x53E5;&#x5757;&#x91CC;&#x7684;<code class="literal">case</code>&#x3001;<code class="literal">default</code>&#x6807;&#x53F7;&#x76F8;&#x5BF9;&#x4E8E;<code class="literal">switch</code>&#x4E0D;&#x5F80;&#x91CC;&#x7F29;&#x8FDB;&#xFF0C;&#x4F46;&#x6807;&#x53F7;&#x4E0B;&#x7684;&#x8BED;&#x53E5;&#x8981;&#x5F80;&#x91CC;&#x7F29;&#x8FDB;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">      &#x2192;switch&#x2423;(c)&#x2423;{
      &#x2192;case &apos;A&apos;:
      &#x2192;       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
      &#x2192;case &apos;B&apos;:
      &#x2192;       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
      &#x2192;default:
      &#x2192;       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
      &#x2192;}</pre><p>&#x7528;&#x4E8E;<code class="literal">goto</code>&#x8BED;&#x53E5;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x6807;&#x53F7;&#x5E94;&#x8BE5;&#x9876;&#x5934;&#x5199;&#x4E0D;&#x7F29;&#x8FDB;&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x6807;&#x53F7;&#x4E0B;&#x7684;&#x8BED;&#x53E5;&#x7F29;&#x8FDB;&#x5230;&#x7B2C;&#x51E0;&#x5C42;&#x3002;</p><p>5&#x3001;&#x4EE3;&#x7801;&#x4E2D;&#x6BCF;&#x4E2A;&#x903B;&#x8F91;&#x6BB5;&#x843D;&#x4E4B;&#x95F4;&#x5E94;&#x8BE5;&#x7528;&#x4E00;&#x4E2A;&#x7A7A;&#x884C;&#x5206;&#x9694;&#x5F00;&#x3002;&#x4F8B;&#x5982;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E4B;&#x95F4;&#x5E94;&#x8BE5;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x7A7A;&#x884C;&#xFF0C;&#x5934;&#x6587;&#x4EF6;&#x3001;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x548C;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E4B;&#x95F4;&#x4E5F;&#x5E94;&#x8BE5;&#x63D2;&#x5165;&#x7A7A;&#x884C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

int g;
double h;

int foo(void)
{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}

int bar(int a)
{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}

int main(void)
{
       &#x2192;&#x8BED;&#x53E5;&#x5217;&#x8868;
}</pre><p>6&#x3001;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x8BED;&#x53E5;&#x5217;&#x8868;&#x5982;&#x679C;&#x5F88;&#x957F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x76F8;&#x5173;&#x6027;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x7EC4;&#xFF0C;&#x7528;&#x7A7A;&#x884C;&#x5206;&#x9694;&#x3002;&#x8FD9;&#x6761;&#x89C4;&#x5B9A;&#x4E0D;&#x662F;&#x4E25;&#x683C;&#x8981;&#x6C42;&#xFF0C;&#x901A;&#x5E38;&#x628A;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x7EC4;&#x6210;&#x4E00;&#x7EC4;&#xFF0C;&#x540E;&#x9762;&#x52A0;&#x7A7A;&#x884C;&#xFF0C;<code class="literal">return</code>&#x8BED;&#x53E5;&#x4E4B;&#x524D;&#x52A0;&#x7A7A;&#x884C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int main(void)
{
       &#x2192;int    &#x2192;a, b;
       &#x2192;double &#x2192;c;

       &#x2192;&#x8BED;&#x53E5;&#x7EC4;1

       &#x2192;&#x8BED;&#x53E5;&#x7EC4;2

       &#x2192;return 0;
}</pre></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch09.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch09.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch09s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;9&#xA0;&#x7AE0;&#xA0;&#x7F16;&#x7801;&#x98CE;&#x683C;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x6CE8;&#x91CA;</td></tr></tbody></table></div>
</body></html>