<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x7B97;&#x6CD5;&#x7684;&#x6982;&#x5FF5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch11.html" title="&#x7B2C;&#xA0;11&#xA0;&#x7AE0;&#xA0;&#x6392;&#x5E8F;&#x4E0E;&#x67E5;&#x627E;"><link rel="prev" href="ch11.html" title="&#x7B2C;&#xA0;11&#xA0;&#x7AE0;&#xA0;&#x6392;&#x5E8F;&#x4E0E;&#x67E5;&#x627E;"><link rel="next" href="ch11s02.html" title="2.&#xA0;&#x63D2;&#x5165;&#x6392;&#x5E8F;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x7B97;&#x6CD5;&#x7684;&#x6982;&#x5FF5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch11.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;11&#xA0;&#x7AE0;&#xA0;&#x6392;&#x5E8F;&#x4E0E;&#x67E5;&#x627E;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch11s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2745184"></a>1.&#xA0;&#x7B97;&#x6CD5;&#x7684;&#x6982;&#x5FF5;</h2></div></div></div><p>&#x7B97;&#x6CD5;&#xFF08;Algorithm&#xFF09;<a id="id2744553" class="indexterm"></a>&#x662F;&#x5C06;&#x4E00;&#x7EC4;&#x8F93;&#x5165;&#x8F6C;&#x5316;&#x6210;&#x4E00;&#x7EC4;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#x5FC5;&#x987B;&#x80FD;&#x5728;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x3002;&#x6BD4;&#x5982;<a class="xref" href="ch05s03.html#func2.recursion">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x9012;&#x5F52;&#x201D;</a>&#x4E60;&#x9898;1&#x4E2D;&#x7684;Euclid&#x7B97;&#x6CD5;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x4E24;&#x4E2A;&#x6B63;&#x6574;&#x6570;&#xFF0C;&#x8F93;&#x51FA;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x6700;&#x5927;&#x516C;&#x7EA6;&#x6570;&#xFF0C;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#x662F;&#x53D6;&#x6A21;&#x3001;&#x6BD4;&#x8F83;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x4E00;&#x5B9A;&#x80FD;&#x5728;&#x6709;&#x9650;&#x7684;&#x6B65;&#x9AA4;&#x548C;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#xFF08;&#x60F3;&#x4E00;&#x60F3;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#xFF09;&#x3002;&#x518D;&#x6BD4;&#x5982;&#x5C06;&#x4E00;&#x7EC4;&#x6570;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x6392;&#x5E8F;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x4E00;&#x7EC4;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF0C;&#x8F93;&#x51FA;&#x662F;&#x6392;&#x5E8F;&#x4E4B;&#x540E;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#x5305;&#x62EC;&#x6BD4;&#x8F83;&#x3001;&#x79FB;&#x52A8;&#x6570;&#x636E;&#x7B49;&#x64CD;&#x4F5C;&#x3002;</p><p>&#x7B97;&#x6CD5;&#x662F;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x7C7B;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x6CE8;&#x610F;&#x662F;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x80FD;&#x5BF9;&#x4EFB;&#x610F;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EC5;&#x5BF9;<code class="literal">int a[] = { 1, 3, 4, 2, 6, 5 };</code>&#x8FD9;&#x6837;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x6392;&#x5E8F;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x6392;&#x5E8F;&#x53EF;&#x4EE5;&#x5199;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x505A;&#xFF1A;</p><pre class="programlisting">void sort(void)
{
	a[0] = 1;
	a[1] = 2;
	a[2] = 3;
	a[3] = 4;
	a[4] = 5;
	a[5] = 6;
}</pre><p>&#x8FD9;&#x663E;&#x7136;&#x4E0D;&#x53EB;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x5177;&#x6709;&#x901A;&#x7528;&#x6027;&#x3002;&#x7531;&#x4E8E;&#x7B97;&#x6CD5;&#x662F;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x5730;&#x89E3;&#x51B3;&#x8FD9;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x624D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x4EFB;&#x610F;&#x8F93;&#x5165;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x90FD;&#x80FD;&#x8F93;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x6392;&#x5E8F;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x624D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x7B97;&#x6CD5;&#x6709;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#xFF0C;&#x4E00;&#x662F;&#x5BF9;&#x4E8E;&#x8BE5;&#x95EE;&#x9898;&#x7684;&#x67D0;&#x4E9B;&#x8F93;&#x5165;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x4F1A;&#x65E0;&#x9650;&#x8BA1;&#x7B97;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0D;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x4E8C;&#x662F;&#x5BF9;&#x4E8E;&#x8BE5;&#x95EE;&#x9898;&#x7684;&#x67D0;&#x4E9B;&#x8F93;&#x5165;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x7EC8;&#x6B62;&#x65F6;&#x8F93;&#x51FA;&#x7684;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6709;&#x65F6;&#x5019;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x5BFB;&#x6C42;&#x6B63;&#x786E;&#x7684;&#x7B97;&#x6CD5;&#x5F88;&#x56F0;&#x96BE;&#xFF0C;&#x800C;&#x67D0;&#x4E2A;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x5185;&#x7EC8;&#x6B62;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x628A;&#x8BEF;&#x5DEE;&#x63A7;&#x5236;&#x5728;&#x4E00;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x6709;&#x65F6;&#x5019;&#x5BFB;&#x627E;&#x6700;&#x4F18;&#x89E3;&#x7684;&#x5F00;&#x9500;&#x5F88;&#x5927;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x9009;&#x62E9;&#x80FD;&#x7ED9;&#x51FA;&#x6B21;&#x4F18;&#x89E3;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p><p>&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x51E0;&#x79CD;&#x5178;&#x578B;&#x7684;&#x6392;&#x5E8F;&#x548C;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x5E76;&#x56F4;&#x7ED5;&#x8FD9;&#x51E0;&#x79CD;&#x7B97;&#x6CD5;&#x505A;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x3002;&#x5B66;&#x5B8C;&#x672C;&#x7AE0;&#x4E4B;&#x540E;&#x5982;&#x679C;&#x60F3;&#x8FDB;&#x4E00;&#x6B65;&#x5B66;&#x4E60;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x4E00;&#x4E9B;&#x5168;&#x9762;&#x7CFB;&#x7EDF;&#x5730;&#x4ECB;&#x7ECD;&#x7B97;&#x6CD5;&#x7684;&#x4E66;&#xFF0C;&#x4F8B;&#x5982;<a class="xref" href="bi01.html#bibli.taocp" title="The Art of Computer Programming">[<abbr class="abbrev">TAOCP</abbr>]</a>&#x548C;<a class="xref" href="bi01.html#bibli.algorithm" title="Introduction to Algorithms">[<abbr class="abbrev">&#x7B97;&#x6CD5;&#x5BFC;&#x8BBA;</abbr>]</a>&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch11.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch11.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch11s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;11&#xA0;&#x7AE0;&#xA0;&#x6392;&#x5E8F;&#x4E0E;&#x67E5;&#x627E;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x63D2;&#x5165;&#x6392;&#x5E8F;</td></tr></tbody></table></div>
</body></html>