<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x6574;&#x6570;&#x7684;&#x52A0;&#x51CF;&#x8FD0;&#x7B97;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch14.html" title="&#x7B2C;&#xA0;14&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6570;&#x7684;&#x8868;&#x793A;"><link rel="prev" href="ch14s02.html" title="2.&#xA0;&#x4E0D;&#x540C;&#x8FDB;&#x5236;&#x4E4B;&#x95F4;&#x7684;&#x6362;&#x7B97;"><link rel="next" href="ch14s04.html" title="4.&#xA0;&#x6D6E;&#x70B9;&#x6570;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x6574;&#x6570;&#x7684;&#x52A0;&#x51CF;&#x8FD0;&#x7B97;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch14s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;14&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6570;&#x7684;&#x8868;&#x793A;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch14s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2753602"></a>3.&#xA0;&#x6574;&#x6570;&#x7684;&#x52A0;&#x51CF;&#x8FD0;&#x7B97;</h2></div></div></div><p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6B63;&#x6574;&#x6570;&#x5982;&#x4F55;&#x8868;&#x793A;&#xFF0C;&#x52A0;&#x6CD5;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;&#x8D1F;&#x6570;&#x5982;&#x4F55;&#x8868;&#x793A;&#xFF0C;&#x51CF;&#x6CD5;&#x53C8;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5462;&#xFF1F;&#x672C;&#x8282;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x4E86;&#x4E66;&#x5199;&#x65B9;&#x4FBF;&#xFF0C;&#x672C;&#x8282;&#x4E3E;&#x7684;&#x4F8B;&#x5B50;&#x90FD;&#x7528;8&#x4E2A;bit&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x5B9E;&#x9645;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x6574;&#x6570;&#x52A0;&#x51CF;&#x8FD0;&#x7B97;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x53EF;&#x4EE5;&#x662F;8&#x4F4D;&#x3001;16&#x4F4D;&#x3001;32&#x4F4D;&#x751A;&#x81F3;64&#x4F4D;&#x7684;&#x3002;</p><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2753623"></a>3.1.&#xA0;Sign and Magnitude&#x8868;&#x793A;&#x6CD5;</h3></div></div></div><p>&#x8981;&#x7528;8&#x4E2A;bit&#x8868;&#x793A;&#x6B63;&#x6570;&#x548C;&#x8D1F;&#x6570;&#xFF0C;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x628A;&#x6700;&#x9AD8;&#x4F4D;&#x89C4;&#x5B9A;&#x4E3A;&#x7B26;&#x53F7;&#x4F4D;&#xFF08;Sign Bit&#xFF09;<a id="id2753633" class="indexterm"></a>&#xFF0C;0&#x8868;&#x793A;&#x6B63;1&#x8868;&#x793A;&#x8D1F;&#xFF0C;&#x5269;&#x4E0B;&#x7684;7&#x4F4D;&#x8868;&#x793A;&#x7EDD;&#x5BF9;&#x503C;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;Sign and Magnitude<a id="id2753641" class="indexterm"></a>&#x8868;&#x793A;&#x6CD5;&#x3002;&#x4F8B;&#x5982;-1&#x8868;&#x793A;&#x6210;10000001&#xFF0C;+1&#x8868;&#x793A;&#x6210;00000001&#x3002;&#x8FD9;&#x6837;&#x7528;8&#x4E2A;bit&#x8868;&#x793A;&#x6574;&#x6570;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;-2<sup>7</sup>-1~2<sup>7</sup>-1&#xFF0C;&#x5373;-127~127&#x3002;</p><p>&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x52A0;&#x6CD5;&#x8FD0;&#x7B97;&#x9700;&#x8981;&#x5904;&#x7406;&#x4EE5;&#x4E0B;&#x903B;&#x8F91;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x5982;&#x679C;&#x4E24;&#x6570;&#x7B26;&#x53F7;&#x4F4D;&#x76F8;&#x540C;&#xFF0C;&#x5C31;&#x628A;&#x5B83;&#x4EEC;&#x7684;&#x4F4E;7&#x4F4D;&#x76F8;&#x52A0;&#xFF0C;&#x7B26;&#x53F7;&#x4F4D;&#x4E0D;&#x53D8;&#x3002;&#x5982;&#x679C;&#x4F4E;7&#x4F4D;&#x76F8;&#x52A0;&#x65F6;&#x5728;&#x6700;&#x9AD8;&#x4F4D;&#x4EA7;&#x751F;&#x8FDB;&#x4F4D;&#xFF0C;&#x8BF4;&#x660E;&#x7ED3;&#x679C;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x5927;&#x4E8E;127&#xFF0C;&#x8D85;&#x51FA;7&#x4F4D;&#x6240;&#x80FD;&#x8868;&#x793A;&#x7684;&#x6570;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x6EA2;&#x51FA;&#xFF08;Overflow&#xFF09;<a id="id2753678" class="indexterm"></a><sup>[<a id="id2753684" href="#ftn.id2753684" class="footnote">24</a>]</sup>&#xFF0C;&#x8FD9;&#x65F6;&#x901A;&#x5E38;&#x628A;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#x4F4D;&#x7F6E;1&#x8868;&#x793A;&#x5F53;&#x524D;&#x8FD0;&#x7B97;&#x4EA7;&#x751F;&#x4E86;&#x6EA2;&#x51FA;&#x3002;</p></li><li><p>&#x5982;&#x679C;&#x4E24;&#x6570;&#x7B26;&#x53F7;&#x4F4D;&#x4E0D;&#x540C;&#xFF0C;&#x9996;&#x5148;&#x6BD4;&#x8F83;&#x5B83;&#x4EEC;&#x7684;&#x4F4E;7&#x4F4D;&#x8C01;&#x5927;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x5927;&#x6570;&#x51CF;&#x5C0F;&#x6570;&#xFF0C;&#x7ED3;&#x679C;&#x7684;&#x7B26;&#x53F7;&#x4F4D;&#x548C;&#x5927;&#x6570;&#x76F8;&#x540C;&#x3002;</p></li></ol></div><p>&#x90A3;&#x4E48;&#x51CF;&#x6CD5;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5462;&#xFF1F;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x89C4;&#x5B9A;&#x4E86;&#x8D1F;&#x6570;&#x7684;&#x8868;&#x793A;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x51CF;&#x6CD5;&#x8F6C;&#x6362;&#x6210;&#x52A0;&#x6CD5;&#x6765;&#x8BA1;&#x7B97;&#xFF0C;&#x8981;&#x8BA1;&#x7B97;a-b&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x628A;b&#x53D8;&#x53F7;&#x7136;&#x540E;&#x548C;a&#x76F8;&#x52A0;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x8BA1;&#x7B97;a+(-b)&#x3002;&#x4F46;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x52A0;&#x6570;&#x7684;&#x7B26;&#x53F7;&#x4F4D;&#x4E0D;&#x540C;&#x5C31;&#x8981;&#x7528;&#x5927;&#x6570;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x51CF;&#x5C0F;&#x6570;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x51CF;&#x6CD5;&#x8BA1;&#x7B97;&#x4ECD;&#x7136;&#x662F;&#x514D;&#x4E0D;&#x4E86;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x52A0;&#x6CD5;&#x8981;&#x8FDB;&#x4F4D;&#xFF0C;&#x51CF;&#x6CD5;&#x8981;&#x501F;&#x4F4D;&#xFF0C;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9664;&#x4E86;&#x8981;&#x6709;<a class="xref" href="ch14s01.html#number.binary">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#x8BA1;&#x7B97;&#x673A;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x201D;</a>&#x63D0;&#x5230;&#x7684;&#x52A0;&#x6CD5;&#x5668;&#x7535;&#x8DEF;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x8981;&#x53E6;&#x5916;&#x6709;&#x4E00;&#x5957;&#x51CF;&#x6CD5;&#x5668;&#x7535;&#x8DEF;&#x3002;</p><p>&#x5982;&#x679C;&#x91C7;&#x7528;Sign and Magnitude&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x52A0;&#x51CF;&#x8FD0;&#x7B97;&#x9700;&#x8981;&#x5904;&#x7406;&#x5F88;&#x591A;&#x903B;&#x8F91;&#xFF1A;&#x6BD4;&#x8F83;&#x7B26;&#x53F7;&#x4F4D;&#xFF0C;&#x6BD4;&#x8F83;&#x7EDD;&#x5BF9;&#x503C;&#xFF0C;&#x52A0;&#x6CD5;&#x6539;&#x51CF;&#x6CD5;&#xFF0C;&#x51CF;&#x6CD5;&#x6539;&#x52A0;&#x6CD5;&#xFF0C;&#x5C0F;&#x6570;&#x51CF;&#x5927;&#x6570;&#x6539;&#x6210;&#x5927;&#x6570;&#x51CF;&#x5C0F;&#x6570;&#x2026;&#x2026;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x4F4E;&#x6548;&#x7387;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;0&#x7684;&#x8868;&#x793A;&#x4E0D;&#x552F;&#x4E00;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x6210;10000000&#x4E5F;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x6210;00000000&#xFF0C;&#x8FD9;&#x8FDB;&#x4E00;&#x6B65;&#x589E;&#x52A0;&#x4E86;&#x903B;&#x8F91;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FEB;&#x5207;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x6574;&#x6570;&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x4F7F;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x66F4;&#x7B80;&#x5355;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2753761"></a>3.2.&#xA0;1&apos;s Complement&#x8868;&#x793A;&#x6CD5;</h3></div></div></div><p>&#x672C;&#x8282;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x4E8C;&#x8FDB;&#x5236;&#x8865;&#x7801;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x4E00;&#x4E2A;&#x5341;&#x8FDB;&#x5236;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p><div class="literallayout"><p>167-52=167+(-52)=167+(999-52)-1000+1=167+947-1000+1=1114-1000+1=114+1=115<br>
167-52&#xA0;&#x2192;&#xA0;&#x51CF;&#x6CD5;&#x8F6C;&#x6362;&#x6210;&#x52A0;&#x6CD5;&#xA0;167+(-52)&#xA0;&#x2192;&#xA0;&#x8D1F;&#x6570;&#x53D6;9&#x7684;&#x8865;&#x7801;&#x8868;&#x793A;&#xA0;167+947&#xA0;&#x2192;&#xA0;114&#x8FDB;1&#xA0;&#x2192;&#xA0;&#x9AD8;&#x4F4D;&#x8FDB;&#x7684;1&#x52A0;&#x5230;&#x4F4E;&#x4F4D;&#x4E0A;&#x53BB;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;115</p></div><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x7528;&#x4E09;&#x4F4D;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x8868;&#x793A;&#x6B63;&#x6570;&#x548C;&#x8D1F;&#x6570;&#xFF0C;&#x5177;&#x4F53;&#x89C4;&#x5B9A;&#x5982;&#x4E0B;&#xFF1A;</p><div class="table"><a id="id2753790"></a><p class="title"><b>&#x8868;&#xA0;14.5.&#xA0;9&apos;s Complement&#x8868;&#x793A;&#x6CD5;</b></p><div class="table-contents"><table summary="9&apos;s Complement&#x8868;&#x793A;&#x6CD5;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#x6570;&#x503C;</th><th>&#x8865;&#x7801;&#x8868;&#x793A;</th></tr></thead><tbody><tr><td>-499</td><td>500</td></tr><tr><td>-498</td><td>501</td></tr><tr><td>...</td><td>...</td></tr><tr><td>-1</td><td>998</td></tr><tr><td>0</td><td>999</td></tr><tr><td>0</td><td>0</td></tr><tr><td>1</td><td>1</td></tr><tr><td>...</td><td>...</td></tr><tr><td>498</td><td>498</td></tr><tr><td>499</td><td>499</td></tr></tbody></table></div></div><br class="table-break"><p>&#x9996;&#x5148;-52&#x8981;&#x7528;999-52&#x8868;&#x793A;&#xFF0C;&#x5C31;&#x662F;947&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x53D6;9&#x7684;&#x8865;&#x7801;&#xFF08;9&apos;s Complement&#xFF09;<a id="id2753880" class="indexterm"></a>&#xFF1B;&#x7136;&#x540E;&#x628A;167&#x548C;947&#x76F8;&#x52A0;&#xFF0C;&#x5F97;&#x5230;114&#x8FDB;1&#xFF1B;&#x518D;&#x628A;&#x9AD8;&#x4F4D;&#x8FDB;&#x7684;1&#x52A0;&#x5230;&#x4F4E;&#x4F4D;&#x4E0A;&#x53BB;&#xFF0C;&#x5F97;115&#xFF0C;&#x672C;&#x6765;&#x5E94;&#x8BE5;&#x52A0;1000&#xFF0C;&#x7ED3;&#x679C;&#x52A0;&#x4E86;1&#xFF0C;&#x5C11;&#x52A0;&#x4E86;999&#xFF0C;&#x6B63;&#x597D;&#x628A;&#x5148;&#x524D;&#x53D6;9&#x7684;&#x8865;&#x7801;&#x591A;&#x52A0;&#x7684;999&#x62B5;&#x6D88;&#x6389;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x672C;&#x6765;&#x8981;&#x505A;167-52&#x7684;&#x51CF;&#x6CD5;&#x8FD0;&#x7B97;&#xFF0C;&#x7ED3;&#x679C;&#x53D8;&#x6210;&#x505A;999-52&#x7684;&#x51CF;&#x6CD5;&#x8FD0;&#x7B97;&#xFF0C;&#x540E;&#x8005;&#x663E;&#x7136;&#x8981;&#x5BB9;&#x6613;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x501F;&#x4F4D;&#x3002;&#x8FD9;&#x79CD;&#x8865;&#x7801;&#x8868;&#x793A;&#x6CD5;&#x7684;&#x8BA1;&#x7B97;&#x89C4;&#x5219;&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x6982;&#x62EC;&#x5C31;&#x662F;&#xFF1A;&#x8D1F;&#x6570;&#x7528;9&#x7684;&#x8865;&#x7801;&#x8868;&#x793A;&#xFF0C;&#x51CF;&#x6CD5;&#x8F6C;&#x6362;&#x6210;&#x52A0;&#x6CD5;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x7684;&#x6700;&#x9AD8;&#x4F4D;&#x5982;&#x679C;&#x6709;&#x8FDB;&#x4F4D;&#x5219;&#x8981;&#x52A0;&#x56DE;&#x5230;&#x6700;&#x4F4E;&#x4F4D;&#x4E0A;&#x53BB;&#x3002;&#x8981;&#x9A8C;&#x8BC1;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x5F97;&#x8003;&#x8651;&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x4E24;&#x4E2A;&#x6B63;&#x6570;&#xFF0C;&#x76F8;&#x52A0;&#x5F97;&#x6B63;</p></li><li><p>&#x4E00;&#x6B63;&#x4E00;&#x8D1F;&#xFF0C;&#x76F8;&#x52A0;&#x5F97;&#x6B63;</p></li><li><p>&#x4E00;&#x6B63;&#x4E00;&#x8D1F;&#xFF0C;&#x76F8;&#x52A0;&#x5F97;&#x8D1F;</p></li><li><p>&#x4E24;&#x4E2A;&#x8D1F;&#x6570;&#xFF0C;&#x76F8;&#x52A0;&#x5F97;&#x8D1F;</p></li></ol></div><p>&#x6211;&#x4EEC;&#x4E3E;&#x7684;&#x4F8B;&#x5B50;&#x9A8C;&#x8BC1;&#x4E86;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x53E6;&#x5916;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x8BF7;&#x8BFB;&#x8005;&#x81EA;&#x5DF1;&#x9A8C;&#x8BC1;&#xFF0C;&#x6682;&#x65F6;&#x4E0D;&#x8003;&#x8651;&#x6EA2;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7A0D;&#x540E;&#x4F1A;&#x8BB2;&#x5230;&#x5982;&#x4F55;&#x5224;&#x5B9A;&#x6EA2;&#x51FA;&#x3002;</p><p>&#x4E0A;&#x8FF0;&#x89C4;&#x5219;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x4E8C;&#x8FDB;&#x5236;&#xFF1A;<span class="emphasis"><em>&#x8D1F;&#x6570;&#x7528;1&#x7684;&#x8865;&#x7801;&#xFF08;1&apos;s Complement&#xFF09;<a id="id2753944" class="indexterm"></a>&#x8868;&#x793A;&#xFF0C;&#x51CF;&#x6CD5;&#x8F6C;&#x6362;&#x6210;&#x52A0;&#x6CD5;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x7684;&#x6700;&#x9AD8;&#x4F4D;&#x5982;&#x679C;&#x6709;&#x8FDB;&#x4F4D;&#x5219;&#x8981;&#x52A0;&#x56DE;&#x5230;&#x6700;&#x4F4E;&#x4F4D;&#x4E0A;&#x53BB;</em></span>&#x3002;&#x53D6;1&#x7684;&#x8865;&#x7801;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x8FDE;&#x51CF;&#x6CD5;&#x90FD;&#x4E0D;&#x7528;&#x505A;&#xFF0C;&#x56E0;&#x4E3A;1-1=0&#xFF0C;1-0=1&#xFF0C;&#x53D6;1&#x7684;&#x8865;&#x7801;&#x5C31;&#x662F;&#x628A;&#x6BCF;&#x4E2A;bit&#x53D6;&#x53CD;&#xFF0C;&#x6240;&#x4EE5;1&#x7684;&#x8865;&#x7801;&#x4E5F;&#x79F0;&#x4E3A;&#x53CD;&#x7801;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p><div class="literallayout"><p>00001000-00000100&#xA0;&#x2192;&#xA0;00001000+(-00000100)&#xA0;&#x2192;&#xA0;00001000+11111011&#xA0;&#x2192;&#xA0;00000011&#x8FDB;1&#xA0;&#x2192;&#xA0;&#x9AD8;&#x4F4D;&#x8FDB;&#x7684;1&#x52A0;&#x5230;&#x4F4E;&#x4F4D;&#x4E0A;&#x53BB;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;00000100</p></div><p>1&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#x76F8;&#x5BF9;&#x4E8E;Sign and Magnitude&#x8868;&#x793A;&#x6CD5;&#x7684;&#x4F18;&#x52BF;&#x662F;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#xFF1A;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x7B26;&#x53F7;&#x548C;&#x7EDD;&#x5BF9;&#x503C;&#x5206;&#x5F00;&#x8003;&#x8651;&#xFF0C;&#x6B63;&#x6570;&#x548C;&#x8D1F;&#x6570;&#x7684;&#x52A0;&#x6CD5;&#x90FD;&#x4E00;&#x6837;&#x7B97;&#xFF0C;&#x8BA1;&#x7B97;&#x903B;&#x8F91;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x51CF;&#x6CD5;&#x5668;&#x7535;&#x8DEF;&#x90FD;&#x7701;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x5957;&#x52A0;&#x6CD5;&#x5668;&#x7535;&#x8DEF;&#xFF0C;&#x518D;&#x6709;&#x4E00;&#x5957;&#x628A;&#x6BCF;&#x4E2A;bit&#x53D6;&#x53CD;&#x7684;&#x7535;&#x8DEF;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x52A0;&#x6CD5;&#x548C;&#x51CF;&#x6CD5;&#x8FD0;&#x7B97;&#x3002;&#x5982;&#x679C;8&#x4E2A;bit&#x91C7;&#x7528;1&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x8D1F;&#x6570;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;&#x4ECE;10000000&#x5230;11111111&#xFF08;-127~0&#xFF09;&#xFF0C;&#x6B63;&#x6570;&#x662F;&#x4ECE;00000000&#x5230;01111111&#xFF08;0~127&#xFF09;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6700;&#x9AD8;&#x4F4D;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6570;&#x662F;&#x6B63;&#x662F;&#x8D1F;&#x3002;&#x7F8E;&#x4E2D;&#x4E0D;&#x8DB3;&#x7684;&#x662F;0&#x7684;&#x8868;&#x793A;&#x4ECD;&#x7136;&#x4E0D;&#x552F;&#x4E00;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x6210;11111111&#x4E5F;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x6210;00000000&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2753996"></a>3.3.&#xA0;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;</h3></div></div></div><p>2&apos;s Complement<a id="id2754003" class="indexterm"></a>&#x8868;&#x793A;&#x6CD5;&#x89C4;&#x5B9A;&#xFF1A;&#x6B63;&#x6570;&#x4E0D;&#x53D8;&#xFF0C;&#x8D1F;&#x6570;&#x5148;&#x53D6;&#x53CD;&#x7801;&#x518D;&#x52A0;1&#x3002;&#x5982;&#x679C;8&#x4E2A;bit&#x91C7;&#x7528;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x8D1F;&#x6570;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;&#x4ECE;10000000&#x5230;11111111&#xFF08;-128~-1&#xFF09;&#xFF0C;&#x6B63;&#x6570;&#x662F;&#x4ECE;00000000&#x5230;01111111&#xFF08;0~127&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6700;&#x9AD8;&#x4F4D;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6570;&#x662F;&#x6B63;&#x662F;&#x8D1F;&#xFF0C;&#x5E76;&#x4E14;0&#x7684;&#x8868;&#x793A;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x76EE;&#x524D;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#x6CD5;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x79F0;&#x4E3A;&#x201C;<span class="quote">2&#x7684;&#x8865;&#x7801;</span>&#x201D;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x5BF9;&#x4E00;&#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x6570;b&#x53D6;&#x8865;&#x7801;&#x5C31;&#x662F;1-b+1=10-b&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x4ECE;2&#x91CC;&#x9762;&#x51CF;&#x53BB;b&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x8981;&#x8868;&#x793A;-4&#x9700;&#x8981;&#x5BF9;00000100&#x53D6;&#x8865;&#x7801;&#xFF0C;11111111-00000100+1=100000000-00000100&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x4ECE;2<sup>8</sup>&#x91CC;&#x9762;&#x51CF;&#x53BB;4&#x3002;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#x7684;&#x8BA1;&#x7B97;&#x89C4;&#x5219;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#xFF1A;&#x51CF;&#x6CD5;&#x8F6C;&#x6362;&#x6210;&#x52A0;&#x6CD5;&#xFF0C;&#x5FFD;&#x7565;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x6700;&#x9AD8;&#x4F4D;&#x7684;&#x8FDB;&#x4F4D;&#xFF0C;&#x4E0D;&#x5FC5;&#x52A0;&#x56DE;&#x5230;&#x6700;&#x4F4E;&#x4F4D;&#x4E0A;&#x53BB;&#x3002;&#x8BF7;&#x8BFB;&#x8005;&#x81EA;&#x5DF1;&#x9A8C;&#x8BC1;&#x4E0A;&#x4E00;&#x8282;&#x63D0;&#x5230;&#x7684;&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x90FD;&#x80FD;&#x7B97;&#x51FA;&#x6B63;&#x786E;&#x7ED3;&#x679C;&#x3002;</p><p>8&#x4E2A;bit&#x91C7;&#x7528;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;-128~127&#xFF0C;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x8D85;&#x51FA;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x6EA2;&#x51FA;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><div class="figure"><a id="id2754046"></a><p class="title"><b>&#x56FE;&#xA0;14.3.&#xA0;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#x6EA2;&#x51FA;</b></p><div class="figure-contents"><div><img src="images/number.overflow.png" alt="&#x6709;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#x6EA2;&#x51FA;"></div></div></div><br class="figure-break"><p>&#x5982;&#x4F55;&#x5224;&#x65AD;&#x4EA7;&#x751F;&#x4E86;&#x6EA2;&#x51FA;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x5206;&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#x8BA8;&#x8BBA;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x6B63;&#x6570;&#x76F8;&#x52A0;&#x6EA2;&#x51FA;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x5B9A;&#x662F;&#x8D1F;&#x6570;&#xFF1B;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x8D1F;&#x6570;&#x76F8;&#x52A0;&#x6EA2;&#x51FA;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x5B9A;&#x662F;&#x6B63;&#x6570;&#xFF1B;&#x4E00;&#x6B63;&#x4E00;&#x8D1F;&#x76F8;&#x52A0;&#xFF0C;&#x65E0;&#x8BBA;&#x7ED3;&#x679C;&#x662F;&#x6B63;&#x662F;&#x8D1F;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x6EA2;&#x51FA;&#x3002;</p><div class="figure"><a id="id2754066"></a><p class="title"><b>&#x56FE;&#xA0;14.4.&#xA0;&#x5982;&#x4F55;&#x5224;&#x5B9A;&#x6EA2;&#x51FA;</b></p><div class="figure-contents"><div><img src="images/number.overflowp.png" alt="&#x5982;&#x4F55;&#x5224;&#x5B9A;&#x6EA2;&#x51FA;"></div></div></div><br class="figure-break"><p>&#x4ECE;&#x4E0A;&#x56FE;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;<span class="emphasis"><em>&#x5728;&#x76F8;&#x52A0;&#x8FC7;&#x7A0B;&#x4E2D;&#x6700;&#x9AD8;&#x4F4D;&#x4EA7;&#x751F;&#x7684;&#x8FDB;&#x4F4D;&#x548C;&#x6B21;&#x9AD8;&#x4F4D;&#x4EA7;&#x751F;&#x7684;&#x8FDB;&#x4F4D;&#x5982;&#x679C;&#x76F8;&#x540C;&#x5219;&#x6CA1;&#x6709;&#x6EA2;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x540C;&#x5219;&#x8868;&#x793A;&#x6709;&#x6EA2;&#x51FA;</em></span>&#x3002;&#x903B;&#x8F91;&#x7535;&#x8DEF;&#x7684;&#x5B9E;&#x73B0;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x8FDB;&#x4F4D;&#x8FDE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;&#x5F02;&#x6216;&#x95E8;&#xFF0C;&#x628A;&#x5F02;&#x6216;&#x95E8;&#x7684;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x5230;&#x6EA2;&#x51FA;&#x6807;&#x5FD7;&#x4F4D;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2754091"></a>3.4.&#xA0;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x548C;&#x65E0;&#x7B26;&#x53F7;&#x6570;</h3></div></div></div><p>&#x524D;&#x9762;&#x51E0;&#x8282;&#x6211;&#x4EEC;&#x7528;8&#x4E2A;bit&#x8868;&#x793A;&#x6B63;&#x6570;&#x548C;&#x8D1F;&#x6570;&#xFF0C;&#x8BB2;&#x4E86;&#x4E09;&#x79CD;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x6BCF;&#x79CD;&#x8868;&#x793A;&#x6CD5;&#x5BF9;&#x5E94;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x6709;&#x7B26;&#x53F7;&#x6570;&#xFF08;Signed Number&#xFF09;<a id="id2754101" class="indexterm"></a>&#xFF1B;&#x5982;&#x679C;8&#x4E2A;bit&#x5168;&#x90E8;&#x8868;&#x793A;&#x6B63;&#x6570;&#x5219;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;0~255&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#xFF08;Unsigned Number&#xFF09;<a id="id2754110" class="indexterm"></a>&#x3002;&#x5176;&#x5B9E;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x52A0;&#x6CD5;&#x65F6;&#x5E76;&#x4E0D;&#x533A;&#x5206;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x8FD8;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#xFF0C;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x7684;&#x52A0;&#x6CD5;&#xFF1A;</p><div class="figure"><a id="id2754121"></a><p class="title"><b>&#x56FE;&#xA0;14.5.&#xA0;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#x8FDB;&#x4F4D;</b></p><div class="figure-contents"><div><img src="images/number.carry.png" alt="&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#x8FDB;&#x4F4D;"></div></div></div><br class="figure-break"><p>&#x5982;&#x679C;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x770B;&#x4F5C;&#x6709;&#x7B26;&#x53F7;&#x6570;-126&#x548C;-8&#x76F8;&#x52A0;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4EA7;&#x751F;&#x4E86;&#x6EA2;&#x51FA;&#xFF1B;&#x4F46;&#x5982;&#x679C;&#x770B;&#x4F5C;&#x65E0;&#x7B26;&#x53F7;&#x6570;130&#x548C;248&#x76F8;&#x52A0;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x662F;122&#x8FDB;1&#xFF0C;&#x4E5F;&#x5C31;&#x662F;122+256&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x662F;&#x5BF9;&#x7684;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x52A0;&#x6CD5;&#x5668;&#x5728;&#x505A;&#x5B8C;&#x8BA1;&#x7B97;&#x4E4B;&#x540E;&#xFF0C;&#x6839;&#x636E;&#x6700;&#x9AD8;&#x4F4D;&#x4EA7;&#x751F;&#x7684;&#x8FDB;&#x4F4D;&#x8BBE;&#x7F6E;<span class="emphasis"><em>&#x8FDB;&#x4F4D;&#x6807;&#x5FD7;</em></span>&#xFF0C;&#x540C;&#x65F6;&#x6839;&#x636E;&#x6700;&#x9AD8;&#x4F4D;&#x548C;&#x6B21;&#x9AD8;&#x4F4D;&#x4EA7;&#x751F;&#x7684;&#x8FDB;&#x4F4D;&#x7684;&#x5F02;&#x6216;&#x8BBE;&#x7F6E;<span class="emphasis"><em>&#x6EA2;&#x51FA;&#x6807;&#x5FD7;</em></span>&#x3002;&#x81F3;&#x4E8E;&#x8FD9;&#x4E2A;&#x52A0;&#x6CD5;&#x5230;&#x5E95;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#x8FD8;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#x5219;&#x53D6;&#x51B3;&#x4E8E;&#x7A0B;&#x5E8F;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x6210;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x8981;&#x68C0;&#x67E5;&#x6EA2;&#x51FA;&#x6807;&#x5FD7;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x6210;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x52A0;&#x6CD5;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x8981;&#x68C0;&#x67E5;&#x8FDB;&#x4F4D;&#x6807;&#x5FD7;&#x3002;&#x901A;&#x5E38;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x505A;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x4E4B;&#x540E;&#x8FD8;&#x53EF;&#x80FD;&#x8BBE;&#x7F6E;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x6807;&#x5FD7;&#xFF0C;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x7684;&#x6240;&#x6709;bit&#x90FD;&#x662F;&#x96F6;&#x5219;&#x8BBE;&#x7F6E;<span class="emphasis"><em>&#x96F6;&#x6807;&#x5FD7;</em></span>&#xFF0C;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x7684;&#x6700;&#x9AD8;&#x4F4D;&#x662F;1&#x5219;&#x8BBE;&#x7F6E;<span class="emphasis"><em>&#x8D1F;&#x6570;&#x6807;&#x5FD7;</em></span>&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x628A;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x7406;&#x89E3;&#x6210;&#x6709;&#x7B26;&#x53F7;&#x6570;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x8D1F;&#x6570;&#x6807;&#x5FD7;&#x5224;&#x65AD;&#x7ED3;&#x679C;&#x662F;&#x6B63;&#x662F;&#x8D1F;&#x3002;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2753684" href="#id2753684" class="para">24</a>] </sup>&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x7EC6;&#x5206;&#xFF0C;&#x628A;&#x6B63;&#x6574;&#x6570;&#x6EA2;&#x51FA;&#x79F0;&#x4E3A;&#x4E0A;&#x6EA2;&#xFF08;Overflow&#xFF09;&#xFF0C;&#x8D1F;&#x6574;&#x6570;&#x6EA2;&#x51FA;&#x79F0;&#x4E3A;&#x4E0B;&#x6EA2;&#xFF08;Underflow&#xFF09;<a id="id2753689" class="indexterm"></a>&#xFF0C;&#x8BE6;&#x89C1;<code class="literal">strtol(3)</code>&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch14s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch14.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch14s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;&#x4E0D;&#x540C;&#x8FDB;&#x5236;&#x4E4B;&#x95F4;&#x7684;&#x6362;&#x7B97;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;4.&#xA0;&#x6D6E;&#x70B9;&#x6570;</td></tr></tbody></table></div>
</body></html>