<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;&#x6D6E;&#x70B9;&#x6570;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch14.html" title="&#x7B2C;&#xA0;14&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6570;&#x7684;&#x8868;&#x793A;"><link rel="prev" href="ch14s03.html" title="3.&#xA0;&#x6574;&#x6570;&#x7684;&#x52A0;&#x51CF;&#x8FD0;&#x7B97;"><link rel="next" href="ch15.html" title="&#x7B2C;&#xA0;15&#xA0;&#x7AE0;&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;&#x6D6E;&#x70B9;&#x6570;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch14s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;14&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6570;&#x7684;&#x8868;&#x793A;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch15.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2754181"></a>4.&#xA0;&#x6D6E;&#x70B9;&#x6570;</h2></div></div></div><p>&#x6D6E;&#x70B9;&#x6570;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x8868;&#x793A;&#x662F;&#x57FA;&#x4E8E;&#x79D1;&#x5B66;&#x8BA1;&#x6570;&#x6CD5;&#xFF08;Scientific Notation&#xFF09;<a id="id2754193" class="indexterm"></a>&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;32767&#x8FD9;&#x4E2A;&#x6570;&#x7528;&#x79D1;&#x5B66;&#x8BA1;&#x6570;&#x6CD5;&#x53EF;&#x4EE5;&#x5199;&#x6210;3.2767&#xD7;10<sup>4</sup>&#xFF0C;3.2767&#x79F0;&#x4E3A;&#x5C3E;&#x6570;&#xFF08;Mantissa&#xFF0C;&#x6216;&#x8005;&#x53EB;Significand&#xFF09;<a id="id2754206" class="indexterm"></a><a id="id2754214" class="indexterm"></a>&#xFF0C;4&#x79F0;&#x4E3A;&#x6307;&#x6570;&#xFF08;Exponent&#xFF09;<a id="id2754223" class="indexterm"></a>&#x3002;&#x6D6E;&#x70B9;&#x6570;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x8868;&#x793A;&#x4E0E;&#x6B64;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x57FA;&#x6570;&#xFF08;Radix&#xFF09;<a id="id2754232" class="indexterm"></a>&#x662F;2&#x800C;&#x4E0D;&#x662F;10&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#x6765;&#x89E3;&#x91CA;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x7531;&#x4E09;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;&#x7B26;&#x53F7;&#x4F4D;&#x3001;&#x6307;&#x6570;&#x90E8;&#x5206;&#xFF08;&#x8868;&#x793A;2&#x7684;&#x591A;&#x5C11;&#x6B21;&#x65B9;&#xFF09;&#x548C;&#x5C3E;&#x6570;&#x90E8;&#x5206;&#xFF08;&#x5C0F;&#x6570;&#x70B9;&#x524D;&#x9762;&#x662F;0&#xFF0C;&#x5C3E;&#x6570;&#x90E8;&#x5206;&#x53EA;&#x8868;&#x793A;&#x5C0F;&#x6570;&#x70B9;&#x540E;&#x7684;&#x6570;&#x5B57;&#xFF09;&#x3002;</p><div class="figure"><a id="id2752523"></a><p class="title"><b>&#x56FE;&#xA0;14.6.&#xA0;&#x4E00;&#x79CD;&#x6D6E;&#x70B9;&#x6570;&#x683C;&#x5F0F;</b></p><div class="figure-contents"><div><img src="images/number.float.png" alt="&#x4E00;&#x79CD;&#x6D6E;&#x70B9;&#x6570;&#x683C;&#x5F0F;"></div></div></div><br class="figure-break"><p>&#x5982;&#x679C;&#x8981;&#x8868;&#x793A;17&#x8FD9;&#x4E2A;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;17=17.0&#xD7;10<sup>0</sup>=0.17&#xD7;10<sup>2</sup>&#xFF0C;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;17=(10001)<sub>2</sub>&#xD7;2<sup>0</sup>=(0.10001)<sub>2</sub>&#xD7;2<sup>5</sup>&#xFF0C;&#x628A;&#x5C3E;&#x6570;&#x7684;&#x6709;&#x6548;&#x6570;&#x5B57;&#x5168;&#x90E8;&#x79FB;&#x5230;&#x5C0F;&#x6570;&#x70B9;&#x540E;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#xFF1A;</p><div class="figure"><a id="id2752563"></a><p class="title"><b>&#x56FE;&#xA0;14.7.&#xA0;17&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;</b></p><div class="figure-contents"><div><img src="images/number.float17.png" alt="17&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;"></div></div></div><br class="figure-break"><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x8868;&#x793A;0.25&#x5C31;&#x9047;&#x5230;&#x65B0;&#x7684;&#x56F0;&#x96BE;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;0.25=1&#xD7;2<sup>-2</sup>=(0.1)<sub>2</sub>&#xD7;2<sup>-1</sup>&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x4E2D;&#x6307;&#x6570;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x89C4;&#x5B9A;&#x5982;&#x4F55;&#x8868;&#x793A;&#x8D1F;&#x6570;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6307;&#x6570;&#x90E8;&#x5206;&#x89C4;&#x5B9A;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x4F4D;&#xFF0C;&#x7136;&#x800C;&#x66F4;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x504F;&#x79FB;&#x7684;&#x6307;&#x6570;&#xFF08;Biased Exponent&#xFF09;<a id="id2752592" class="indexterm"></a>&#x3002;&#x89C4;&#x5B9A;&#x4E00;&#x4E2A;&#x504F;&#x79FB;&#x503C;&#xFF0C;&#x6BD4;&#x5982;16&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x6307;&#x6570;&#x8981;&#x52A0;&#x4E0A;&#x8FD9;&#x4E2A;&#x504F;&#x79FB;&#x503C;&#x518D;&#x586B;&#x5199;&#x5230;&#x6307;&#x6570;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x6837;&#x6BD4;16&#x5927;&#x7684;&#x5C31;&#x8868;&#x793A;&#x6B63;&#x6307;&#x6570;&#xFF0C;&#x6BD4;16&#x5C0F;&#x7684;&#x5C31;&#x8868;&#x793A;&#x8D1F;&#x6307;&#x6570;&#x3002;&#x8981;&#x8868;&#x793A;0.25&#xFF0C;&#x6307;&#x6570;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x586B;16-1=15&#xFF1A;</p><div class="figure"><a id="id2752604"></a><p class="title"><b>&#x56FE;&#xA0;14.8.&#xA0;0.25&#x7684;&#x504F;&#x79FB;&#x6307;&#x6570;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;</b></p><div class="figure-contents"><div><img src="images/number.biasfloat025.png" alt="0.25&#x7684;&#x504F;&#x79FB;&#x6307;&#x6570;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;"></div></div></div><br class="figure-break"><p>&#x73B0;&#x5728;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x9700;&#x8981;&#x89E3;&#x51B3;&#xFF1A;&#x6BCF;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x8868;&#x793A;&#x90FD;&#x4E0D;&#x552F;&#x4E00;&#xFF0C;&#x4F8B;&#x5982;17=(0.10001)<sub>2</sub>&#xD7;2<sup>5</sup>=(0.010001)<sub>2</sub>&#xD7;2<sup>6</sup>&#xFF0C;&#x8FD9;&#x6837;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x5904;&#x7406;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x89C4;&#x5B9A;&#x5C3E;&#x6570;&#x90E8;&#x5206;&#x7684;&#x6700;&#x9AD8;&#x4F4D;&#x5FC5;&#x987B;&#x662F;1&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5C3E;&#x6570;&#x5FC5;&#x987B;&#x4EE5;0.1&#x5F00;&#x5934;&#xFF0C;&#x5BF9;&#x6307;&#x6570;&#x505A;&#x76F8;&#x5E94;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x6B63;&#x89C4;&#x5316;&#xFF08;Normalize&#xFF09;<a id="id2752639" class="indexterm"></a>&#x3002;&#x7531;&#x4E8E;&#x5C3E;&#x6570;&#x90E8;&#x5206;&#x7684;&#x6700;&#x9AD8;&#x4F4D;&#x5FC5;&#x987B;&#x662F;1&#xFF0C;&#x8FD9;&#x4E2A;1&#x5C31;&#x4E0D;&#x5FC5;&#x4FDD;&#x5B58;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x51FA;&#x4E00;&#x4F4D;&#x6765;&#x7528;&#x4E8E;&#x63D0;&#x9AD8;&#x7CBE;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x6700;&#x9AD8;&#x4F4D;&#x7684;1&#x662F;&#x9690;&#x542B;&#x7684;&#xFF08;Implied&#xFF09;<a id="id2752649" class="indexterm"></a>&#x3002;&#x8FD9;&#x6837;17&#x5C31;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x4E86;&#xFF0C;&#x6307;&#x6570;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x662F;16+5=21=(10101)<sub>2</sub>&#xFF0C;&#x5C3E;&#x6570;&#x90E8;&#x5206;&#x53BB;&#x6389;&#x6700;&#x9AD8;&#x4F4D;&#x7684;1&#x662F;0001&#xFF1A;</p><div class="figure"><a id="id2754520"></a><p class="title"><b>&#x56FE;&#xA0;14.9.&#xA0;17&#x7684;&#x6B63;&#x89C4;&#x5316;&#x5C3E;&#x6570;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;</b></p><div class="figure-contents"><div><img src="images/number.normalfloat17.png" alt="17&#x7684;&#x6B63;&#x89C4;&#x5316;&#x5C3E;&#x6570;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;"></div></div></div><br class="figure-break"><p>&#x4E24;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#x76F8;&#x52A0;&#xFF0C;&#x9996;&#x5148;&#x628A;&#x5C0F;&#x6570;&#x70B9;&#x5BF9;&#x9F50;&#x7136;&#x540E;&#x76F8;&#x52A0;&#xFF1A;</p><div class="figure"><a id="id2754538"></a><p class="title"><b>&#x56FE;&#xA0;14.10.&#xA0;&#x6D6E;&#x70B9;&#x6570;&#x76F8;&#x52A0;</b></p><div class="figure-contents"><div><img src="images/number.addfloat.png" alt="&#x6D6E;&#x70B9;&#x6570;&#x76F8;&#x52A0;"></div></div></div><br class="figure-break"><p>&#x7531;&#x4E8E;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;&#x7684;&#x7CBE;&#x5EA6;&#x6709;&#x9650;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x672B;&#x5C3E;&#x7684;10&#x4E24;&#x4F4D;&#x88AB;&#x820D;&#x53BB;&#x4E86;&#x3002;&#x505A;&#x6D6E;&#x70B9;&#x8FD0;&#x7B97;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x7CBE;&#x5EA6;&#x635F;&#x5931;&#xFF08;Significance Loss&#xFF09;<a id="id2754556" class="indexterm"></a>&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x65F6;&#x8BA1;&#x7B97;&#x987A;&#x5E8F;&#x4E0D;&#x540C;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6BD4;&#x5982;11.0010000+0.00000001+0.00000001=11.0010000+0.00000001=11.0010000&#xFF0C;&#x540E;&#x9762;&#x52A0;&#x7684;&#x4E24;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#x5168;&#x88AB;&#x820D;&#x53BB;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x5BF9;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x8C03;&#x4E00;&#x4E0B;&#x8BA1;&#x7B97;&#x987A;&#x5E8F;&#x5B83;&#x4EEC;&#x5C31;&#x80FD;&#x5F71;&#x54CD;&#x5230;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4E86;&#xFF0C;0.00000001+0.00000001+11.0010000=0.00000010+11.0010000=11.0010001&#x3002;&#x518D;&#x6BD4;&#x5982;128.25=(10000000.01)<sub>2</sub>&#xFF0C;&#x9700;&#x8981;10&#x4E2A;&#x6709;&#x6548;&#x4F4D;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x4E2D;&#x5C3E;&#x6570;&#x90E8;&#x5206;&#x662F;8&#x4F4D;&#xFF0C;&#x7B97;&#x4E0A;&#x9690;&#x542B;&#x7684;&#x6700;&#x9AD8;&#x4F4D;1&#x4E00;&#x5171;&#x6709;9&#x4E2A;&#x6709;&#x6548;&#x4F4D;&#xFF0C;&#x90A3;&#x4E48;128.25&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;&#x53EA;&#x80FD;&#x820D;&#x53BB;&#x672B;&#x5C3E;&#x7684;1&#xFF0C;&#x8868;&#x793A;&#x6210;(10000000.0)<sub>2</sub>&#xFF0C;&#x5176;&#x5B9E;&#x8DDF;128&#x76F8;&#x7B49;&#x4E86;&#x3002;&#x5728;<a class="xref" href="ch04s02.html#cond.ifelse">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;if/else&#x8BED;&#x53E5;&#x201D;</a>&#x8BB2;&#x8FC7;&#x6D6E;&#x70B9;&#x6570;&#x4E0D;&#x80FD;&#x505A;&#x7CBE;&#x786E;&#x6BD4;&#x8F83;&#xFF0C;&#x73B0;&#x5728;&#x8BFB;&#x8005;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x7CBE;&#x786E;&#x6BD4;&#x8F83;&#x4E86;&#x3002;</p><p>&#x6574;&#x6570;&#x8FD0;&#x7B97;&#x4F1A;&#x4EA7;&#x751F;&#x6EA2;&#x51FA;&#xFF0C;&#x6D6E;&#x70B9;&#x8FD0;&#x7B97;&#x4E5F;&#x4F1A;&#x4EA7;&#x751F;&#x6EA2;&#x51FA;&#xFF0C;&#x6D6E;&#x70B9;&#x8FD0;&#x7B97;&#x7684;&#x6EA2;&#x51FA;&#x4E5F;&#x5206;&#x4E0A;&#x6EA2;&#x548C;&#x4E0B;&#x6EA2;&#x4E24;&#x79CD;&#xFF0C;&#x4F46;&#x548C;&#x6574;&#x6570;&#x8FD0;&#x7B97;&#x7684;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#x3002;&#x5047;&#x8BBE;&#x6574;&#x6570;&#x91C7;&#x7528;8&#x4F4D;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;-128~127&#xFF0C;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x662F;-130&#x5219;&#x79F0;&#x4E3A;&#x4E0B;&#x6EA2;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x662F;130&#x5219;&#x79F0;&#x4E3A;&#x4E0A;&#x6EA2;&#x3002;&#x5047;&#x8BBE;&#x6309;&#x672C;&#x8282;&#x4ECB;&#x7ECD;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;-(0.111111111)<sub>2</sub>&#xD7;2<sup>15</sup>~(0.111111111)<sub>2</sub>&#xD7;2<sup>15</sup>&#xFF0C;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x8D85;&#x51FA;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x5219;&#x79F0;&#x4E3A;&#x4E0A;&#x6EA2;&#xFF1B;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x672A;&#x8D85;&#x51FA;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x4F46;&#x7EDD;&#x5BF9;&#x503C;&#x592A;&#x5C0F;&#x4E86;&#xFF0C;&#x5728;-(0.1)<sub>2</sub>&#xD7;2<sup>-16</sup>~(0.1)<sub>2</sub>&#xD7;2<sup>-16</sup>&#x4E4B;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x540C;&#x6837;&#x65E0;&#x6CD5;&#x8868;&#x793A;&#xFF0C;&#x79F0;&#x4E3A;&#x4E0B;&#x6EA2;&#x3002;</p><p>&#x6D6E;&#x70B9;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;&#x548C;&#x6D6E;&#x70B9;&#x8FD0;&#x7B97;&#x4E5F;&#x6709;&#x8F83;&#x5927;&#x5DEE;&#x5F02;&#xFF0C;&#x672C;&#x8282;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x800C;&#x4E0D;&#x6DF1;&#x5165;&#x8BA8;&#x8BBA;&#xFF0C;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x6709;&#x52A9;&#x4E8E;&#x4F60;&#x7406;&#x89E3;&#x6D6E;&#x70B9;&#x6570;&#x6807;&#x51C6;&#xFF0C;&#x76EE;&#x524D;&#x4E1A;&#x754C;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x7684;&#x7B26;&#x70B9;&#x6570;&#x6807;&#x51C6;&#x662F;&#x7531;IEEE&#xFF08;Institute of Electrical and Electronics Engineers&#xFF09;<a id="id2754656" class="indexterm"></a>&#x5236;&#x5B9A;&#x7684;IEEE 754<a id="id2754663" class="indexterm"></a>&#x3002;</p><p>&#x6700;&#x540E;&#x8BA8;&#x8BBA;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5B9A;&#x4E49;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x65F6;&#x5982;&#x679C;&#x6CA1;&#x6709;Initializer&#x5C31;&#x7528;0&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;&#x65F6;&#x5982;&#x679C;Initializer&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x5143;&#x7D20;&#x4E0D;&#x591F;&#x90A3;&#x4E48;&#x5269;&#x4E0B;&#x7684;&#x5143;&#x7D20;&#x4E5F;&#x7528;0&#x521D;&#x59CB;&#x5316;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int i;
double d;
double a[10] = { 1.0 };</pre><p>&#x201C;<span class="quote">&#x7528;0&#x521D;&#x59CB;&#x5316;</span>&#x201D;&#x7684;&#x610F;&#x601D;&#x662F;&#x53D8;&#x91CF;<code class="literal">i</code>&#x3001;&#x53D8;&#x91CF;<code class="literal">d</code>&#x548C;&#x6570;&#x7EC4;&#x5143;&#x7D20;<code class="literal">a[1]~a[9]</code>&#x7684;&#x6240;&#x6709;&#x5B57;&#x8282;&#x90FD;&#x7528;0&#x586B;&#x5145;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6240;&#x6709;bit&#x90FD;&#x662F;0&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x7528;Sign and Magnitude&#x8868;&#x793A;&#x6CD5;&#x3001;1&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#x8FD8;&#x662F;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x7684;&#x6240;&#x6709;bit&#x662F;0&#x90FD;&#x8868;&#x793A;0&#x503C;&#xFF0C;&#x4F46;&#x4E00;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x6240;&#x6709;bit&#x662F;0&#x4E00;&#x5B9A;&#x8868;&#x793A;0&#x503C;&#x5417;&#xFF1F;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x67D0;&#x79CD;&#x5E73;&#x53F0;&#x53EF;&#x80FD;&#x4F1A;&#x89C4;&#x5B9A;&#x4E00;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x6240;&#x6709;bit&#x662F;0&#x5E76;&#x4E0D;&#x8868;&#x793A;0&#x503C;&#xFF0C;&#x4F46;<a class="xref" href="bi01.html#bibli.rationale" title="Rationale for International Standard &#xFF0D; Programming Languages &#xFF0D; C">[<abbr class="abbrev">C99 Rationale</abbr>]</a>&#x7B2C;6.7.8&#x8282;&#x7684;&#x6761;&#x6B3E;25&#x63D0;&#x5230;&#xFF1A;As far as the committee knows, all machines treat all bits zero as a representation of floating-point zero. But, all bits zero might not be the canonical representation of zero. &#x56E0;&#x6B64;&#x5728;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x6240;&#x6709;bit&#x662F;0&#x5C31;&#x8868;&#x793A;0&#x503C;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch14s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch14.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch15.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;&#x6574;&#x6570;&#x7684;&#x52A0;&#x51CF;&#x8FD0;&#x7B97;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;15&#xA0;&#x7AE0;&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;</td></tr></tbody></table></div>
</body></html>