<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x6574;&#x578B;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch15.html" title="&#x7B2C;&#xA0;15&#xA0;&#x7AE0;&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;"><link rel="prev" href="ch15.html" title="&#x7B2C;&#xA0;15&#xA0;&#x7AE0;&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;"><link rel="next" href="ch15s02.html" title="2.&#xA0;&#x6D6E;&#x70B9;&#x578B;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x6574;&#x578B;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch15.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;15&#xA0;&#x7AE0;&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch15s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2756569"></a>1.&#xA0;&#x6574;&#x578B;</h2></div></div></div><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;<code class="literal">char</code>&#x578B;&#x5360;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x901A;&#x5E38;&#x662F;8&#x4E2A;bit&#x3002;&#x5982;&#x679C;&#x8FD9;8&#x4E2A;bit&#x6309;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x6765;&#x89E3;&#x91CA;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;0~255&#xFF0C;&#x5982;&#x679C;&#x6309;&#x6709;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x6765;&#x89E3;&#x91CA;&#xFF0C;&#x91C7;&#x7528;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;-128~127&#x3002;C&#x8BED;&#x8A00;&#x89C4;&#x5B9A;&#x4E86;<code class="literal">signed</code>&#x548C;<code class="literal">unsigned</code>&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;<code class="literal">unsigned char</code>&#x578B;&#x8868;&#x793A;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#xFF0C;<code class="literal">signed char</code>&#x578B;&#x8868;&#x793A;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x3002;</p><p>&#x90A3;&#x4E48;&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;&#x4E0D;&#x5E26;<code class="literal">signed</code>&#x6216;<code class="literal">unsigned</code>&#x5173;&#x952E;&#x5B57;&#x7684;<code class="literal">char</code>&#x578B;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x8FD8;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x5462;&#xFF1F;C&#x6807;&#x51C6;&#x89C4;&#x5B9A;&#x8FD9;&#x662F;Implementation Defined&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;<code class="literal">char</code>&#x578B;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;<code class="literal">char</code>&#x578B;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x7684;&#xFF0C;&#x5728;&#x8BE5;&#x7F16;&#x8BD1;&#x5668;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E0A;&#x54EA;&#x79CD;&#x5B9E;&#x73B0;&#x6548;&#x7387;&#x9AD8;&#x5C31;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x54EA;&#x79CD;&#x5B9E;&#x73B0;&#xFF0C;x86&#x5E73;&#x53F0;&#x7684;<code class="literal">gcc</code>&#x5B9A;&#x4E49;<code class="literal">char</code>&#x578B;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x7684;&#x3002;&#x8FD9;&#x4E5F;&#x662F;C&#x6807;&#x51C6;&#x7684;Rationale&#x4E4B;&#x4E00;&#xFF1A;<span class="emphasis"><em>&#x4F18;&#x5148;&#x8003;&#x8651;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x5C1A;&#x5728;&#x5176;&#x6B21;</em></span>&#x3002;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x7A0B;&#x5E8F;&#x5458;&#x975E;&#x5E38;&#x6E05;&#x695A;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x5199;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x6E05;&#x695A;&#x54EA;&#x4E9B;&#x5199;&#x6CD5;&#x662F;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#xFF0C;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5199;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x4EE3;&#x7801;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x6BD4;&#x5982;Linux&#x5185;&#x6838;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x4E86;&#x5F88;&#x591A;&#x53EA;&#x6709;<code class="literal">gcc</code>&#x652F;&#x6301;&#x7684;&#x8BED;&#x6CD5;&#x7279;&#x6027;&#x4EE5;&#x5F97;&#x5230;&#x6700;&#x4F73;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x5728;&#x5199;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6CA1;&#x6253;&#x7B97;&#x7528;&#x522B;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#xFF0C;&#x4E5F;&#x5C31;&#x6CA1;&#x8003;&#x8651;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x8981;&#x5199;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x4E5F;&#x5FC5;&#x987B;&#x6E05;&#x695A;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x662F;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x6837;&#x5199;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x6548;&#x7387;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x5C31;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x6545;&#x610F;&#x5199;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x63A5;&#x89E6;&#x5230;&#x5F88;&#x591A;Implementation Defined&#x7684;&#x7279;&#x6027;&#xFF0C;C&#x8BED;&#x8A00;&#x4E0E;&#x5E73;&#x53F0;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x662F;&#x5BC6;&#x4E0D;&#x53EF;&#x5206;&#x7684;&#xFF0C;&#x79BB;&#x5F00;&#x4E86;&#x5177;&#x4F53;&#x7684;&#x5E73;&#x53F0;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x8BA8;&#x8BBA;C&#x8BED;&#x8A00;&#xFF0C;&#x5C31;&#x53EA;&#x80FD;&#x8BA8;&#x8BBA;&#x5230;&#x672C;&#x4E66;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x7A0B;&#x5EA6;&#x4E86;&#x3002;&#x6CE8;&#x610F;&#xFF0C;ASCII&#x7801;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;0~127&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7BA1;<code class="literal">char</code>&#x578B;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x7684;&#x8FD8;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x7684;&#xFF0C;&#x5B58;&#x4E00;&#x4E2A;ASCII&#x7801;&#x90FD;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x7528;<code class="literal">char</code>&#x578B;&#x5B58;ASCII&#x7801;&#x5B57;&#x7B26;&#xFF0C;&#x5C31;&#x4E0D;&#x5FC5;&#x660E;&#x786E;&#x5199;&#x662F;<code class="literal">signed</code>&#x8FD8;&#x662F;<code class="literal">unsigned</code>&#xFF0C;&#x5982;&#x679C;&#x7528;<code class="literal">char</code>&#x578B;&#x8868;&#x793A;8&#x4F4D;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x4E3A;&#x4E86;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x5C31;&#x5FC5;&#x987B;&#x5199;&#x660E;&#x662F;<code class="literal">signed</code>&#x8FD8;&#x662F;<code class="literal">unsigned</code>&#x3002;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Implementation-defined&#x3001;Unspecified&#x548C;Undefined</h3><p>&#x5728;C&#x6807;&#x51C6;&#x4E2D;&#x6CA1;&#x6709;&#x505A;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x7684;&#x5730;&#x65B9;&#x4F1A;&#x7528;Implementation-defined<a id="id2756724" class="indexterm"></a>&#x3001;Unspecified<a id="id2756731" class="indexterm"></a>&#x6216;Undefined<a id="id2756738" class="indexterm"></a>&#x6765;&#x8868;&#x8FF0;&#xFF0C;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x6709;&#x65F6;&#x628A;&#x8FD9;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x7EDF;&#x79F0;&#x4E3A;&#x201C;<span class="quote">&#x672A;&#x660E;&#x786E;&#x5B9A;&#x4E49;</span>&#x201D;&#x7684;&#x3002;&#x8FD9;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x5230;&#x5E95;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x5462;&#xFF1F;</p><p>&#x6211;&#x4EEC;&#x521A;&#x624D;&#x770B;&#x5230;&#x4E00;&#x79CD;Implementation-defined&#x7684;&#x60C5;&#x51B5;&#xFF0C;C&#x6807;&#x51C6;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x89C4;&#x5B9A;<code class="literal">char</code>&#x662F;&#x6709;&#x7B26;&#x53F7;&#x7684;&#x8FD8;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6C42;&#x7F16;&#x8BD1;&#x5668;&#x5FC5;&#x987B;&#x5BF9;&#x6B64;&#x505A;&#x51FA;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#xFF0C;&#x5E76;&#x5199;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x6587;&#x6863;&#x4E2D;&#x3002;</p><p>&#x800C;&#x5BF9;&#x4E8E;Unspecified&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5F80;&#x5F80;&#x6709;&#x51E0;&#x79CD;&#x53EF;&#x9009;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;C&#x6807;&#x51C6;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x6309;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#x5904;&#x7406;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x4E0D;&#x5FC5;&#x5199;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x6587;&#x6863;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5373;&#x4FBF;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x6765;&#x7F16;&#x8BD1;&#x4E5F;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x6CA1;&#x6709;&#x5728;&#x6587;&#x6863;&#x4E2D;&#x660E;&#x786E;&#x5199;&#x5B83;&#x4F1A;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x4E00;&#x7AE0;&#x6211;&#x4EEC;&#x4F1A;&#x8BB2;&#x5230;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x5404;&#x4E2A;&#x5B9E;&#x53C2;&#x8868;&#x8FBE;&#x5F0F;&#x6309;&#x4EC0;&#x4E48;&#x987A;&#x5E8F;&#x6C42;&#x503C;&#x662F;Unspecified&#x7684;&#x3002;</p><p>Undefined&#x7684;&#x60C5;&#x51B5;&#x5219;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;C&#x6807;&#x51C6;&#x6CA1;&#x89C4;&#x5B9A;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5F88;&#x53EF;&#x80FD;&#x4E5F;&#x6CA1;&#x89C4;&#x5B9A;&#xFF0C;&#x751A;&#x81F3;&#x4E5F;&#x6CA1;&#x505A;&#x51FA;&#x9519;&#x5904;&#x7406;&#xFF0C;&#x6709;&#x5F88;&#x591A;Undefined&#x7684;&#x60C5;&#x51B5;&#x7F16;&#x8BD1;&#x5668;&#x662F;&#x68C0;&#x67E5;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6700;&#x7EC8;&#x4F1A;&#x5BFC;&#x81F4;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#xFF0C;&#x6BD4;&#x5982;&#x6570;&#x7EC4;&#x8BBF;&#x95EE;&#x8D8A;&#x754C;&#x5C31;&#x662F;Undefined&#x7684;&#x3002;</p><p>&#x521D;&#x5B66;&#x8005;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x901A;&#x5E38;&#x4F1A;&#x5F88;&#x4E0D;&#x8212;&#x670D;&#xFF0C;&#x89C9;&#x5F97;&#x8FD9;&#x4E0D;&#x662F;&#x5728;&#x5B66;&#x7F16;&#x7A0B;&#x800C;&#x662F;&#x5728;&#x5543;&#x6CD5;&#x5F8B;&#x6761;&#x6587;&#xFF0C;&#x7ED3;&#x679C;&#x8D8A;&#x5B66;&#x8D8A;&#x6CC4;&#x6C14;&#x3002;&#x662F;&#x7684;&#xFF0C;C&#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x50CF;&#x4E00;&#x4E2A;&#x6570;&#x5B66;&#x5B9A;&#x7406;&#x90A3;&#x4E48;&#x5B8C;&#x7F8E;&#xFF0C;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x4E1C;&#x897F;&#x603B;&#x662F;&#x4E0D;&#x591F;&#x5B8C;&#x7F8E;&#x7684;&#x3002;&#x4F46;&#x8FD8;&#x597D;&#x5566;&#xFF0C;C&#x7A0B;&#x5E8F;&#x5458;&#x5DF2;&#x7ECF;&#x5F88;&#x5E78;&#x798F;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x4E25;&#x683C;&#x9075;&#x7167;C&#x6807;&#x51C6;&#x6765;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x8981;&#x53BB;&#x89E6;&#x78B0;&#x90A3;&#x4E9B;&#x9634;&#x6697;&#x89D2;&#x843D;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x6709;&#x5F88;&#x597D;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x3002;&#x60F3;&#x60F3;&#x90A3;&#x4E9B;&#x53EF;&#x601C;&#x7684;JavaScript&#x7A0B;&#x5E8F;&#x5458;&#x5427;&#xFF0C;&#x4ED6;&#x4EEC;&#x751A;&#x81F3;&#x8FDE;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x9075;&#x7167;&#x7684;&#x6807;&#x51C6;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x4E00;&#x4E2A;&#x6837;&#xFF0C;&#x751A;&#x81F3;&#x540C;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x4E5F;&#x5DEE;&#x522B;&#x5F88;&#x5927;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x5F97;&#x4E0D;&#x4E3A;&#x6BCF;&#x4E00;&#x79CD;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x5206;&#x522B;&#x5199;&#x4E0D;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x3002;</p></div><p>&#x9664;&#x4E86;<code class="literal">char</code>&#x578B;&#x4E4B;&#x5916;&#xFF0C;&#x6574;&#x578B;&#x8FD8;&#x5305;&#x62EC;<code class="literal">short int</code>&#xFF08;&#x6216;&#x8005;&#x7B80;&#x5199;&#x4E3A;<code class="literal">short</code>&#xFF09;&#x3001;<code class="literal">int</code>&#x3001;<code class="literal">long int</code>&#xFF08;&#x6216;&#x8005;&#x7B80;&#x5199;&#x4E3A;<code class="literal">long</code>&#xFF09;&#x3001;<code class="literal">long long int</code>&#xFF08;&#x6216;&#x8005;&#x7B80;&#x5199;&#x4E3A;<code class="literal">long long</code>&#xFF09;&#x7B49;&#x51E0;&#x79CD;<sup>[<a id="id2756873" href="#ftn.id2756873" class="footnote">25</a>]</sup>&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x90FD;&#x53EF;&#x4EE5;&#x52A0;&#x4E0A;<code class="literal">signed</code>&#x6216;<code class="literal">unsigned</code>&#x5173;&#x952E;&#x5B57;&#x8868;&#x793A;&#x6709;&#x7B26;&#x53F7;&#x6216;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x8868;&#x793A;&#x662F;Sign and Magnitude&#x3001;1&apos;s Complement&#x8FD8;&#x662F;2&apos;s Complement&#xFF0C;C&#x6807;&#x51C6;&#x4E5F;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#xFF0C;&#x4E5F;&#x662F;Implementation Defined&#x3002;&#x5927;&#x591A;&#x6570;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x90FD;&#x91C7;&#x7528;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#xFF0C;x86&#x5E73;&#x53F0;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x6211;&#x4EEC;&#x53EA;&#x8BA8;&#x8BBA;2&apos;s Complement&#x8868;&#x793A;&#x6CD5;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x9664;&#x4E86;<code class="literal">char</code>&#x578B;&#x4EE5;&#x5916;&#x7684;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x5982;&#x679C;&#x4E0D;&#x660E;&#x786E;&#x5199;<code class="literal">signed</code>&#x6216;<code class="literal">unsigned</code>&#x5173;&#x952E;&#x5B57;&#x90FD;&#x8868;&#x793A;<code class="literal">signed</code>&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x662F;C&#x6807;&#x51C6;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x7684;&#xFF0C;&#x4E0D;&#x662F;Implementation Defined&#x3002;</p><p>&#x9664;&#x4E86;<code class="literal">char</code>&#x578B;&#x5728;C&#x6807;&#x51C6;&#x4E2D;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x5360;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x5B83;&#x6574;&#x578B;&#x5360;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#x90FD;&#x662F;Implementation Defined&#x3002;&#x901A;&#x5E38;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x5B9E;&#x73B0;&#x9075;&#x5B88;ILP32<a id="id2756951" class="indexterm"></a>&#x6216;LP64<a id="id2756958" class="indexterm"></a>&#x89C4;&#x8303;&#xFF0C;&#x5982;&#x4E0B;&#x8868;&#x6240;&#x793A;&#x3002;</p><div class="table"><a id="id2756966"></a><p class="title"><b>&#x8868;&#xA0;15.1.&#xA0;ILP32&#x548C;LP64</b></p><div class="table-contents"><table summary="ILP32&#x548C;LP64" border="1"><colgroup><col><col><col></colgroup><thead><tr><th>&#x7C7B;&#x578B;</th><th>ILP32&#xFF08;&#x4F4D;&#x6570;&#xFF09;</th><th>LP64&#xFF08;&#x4F4D;&#x6570;&#xFF09;</th></tr></thead><tbody><tr><td>char</td><td>8</td><td>8</td></tr><tr><td>short</td><td>16</td><td>16</td></tr><tr><td>int</td><td>32</td><td>32</td></tr><tr><td>long</td><td>32</td><td>64</td></tr><tr><td>long long</td><td>64</td><td>64</td></tr><tr><td>&#x6307;&#x9488;</td><td>32</td><td>64</td></tr></tbody></table></div></div><br class="table-break"><p>ILP32&#x8FD9;&#x4E2A;&#x7F29;&#x5199;&#x7684;&#x610F;&#x601D;&#x662F;<code class="literal">int</code>&#xFF08;I&#xFF09;&#x3001;<code class="literal">long</code>&#xFF08;L&#xFF09;&#x548C;&#x6307;&#x9488;&#xFF08;P&#xFF09;&#x7C7B;&#x578B;&#x90FD;&#x5360;32&#x4F4D;&#xFF0C;&#x901A;&#x5E38;32&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x7684;C&#x7F16;&#x8BD1;&#x5668;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x89C4;&#x8303;&#xFF0C;x86&#x5E73;&#x53F0;&#x7684;<code class="literal">gcc</code>&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;LP64&#x662F;&#x6307;<code class="literal">long</code>&#xFF08;L&#xFF09;&#x548C;&#x6307;&#x9488;&#x5360;64&#x4F4D;&#xFF0C;&#x901A;&#x5E38;64&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x7684;C&#x7F16;&#x8BD1;&#x5668;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x89C4;&#x8303;&#x3002;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x957F;&#x5EA6;&#x603B;&#x662F;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4F4D;&#x6570;&#x4E00;&#x81F4;&#xFF0C;&#x81F3;&#x4E8E;&#x4EC0;&#x4E48;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4F4D;&#x6570;&#xFF0C;&#x6307;&#x9488;&#x53C8;&#x662F;&#x4E00;&#x79CD;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5230;<a class="xref" href="ch17.html#arch">&#x7B2C;&#xA0;17&#xA0;&#x7AE0; <i>&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;</i></a>&#x548C;<a class="xref" href="ch23.html#pointer">&#x7B2C;&#xA0;23&#xA0;&#x7AE0; <i>&#x6307;&#x9488;</i></a>&#x518D;&#x5206;&#x522B;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x3002;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x672C;&#x4E66;&#x505A;&#x4EE5;&#x4E0B;&#x7EA6;&#x5B9A;&#xFF1A;<span class="emphasis"><em>&#x5728;&#x4EE5;&#x540E;&#x7684;&#x9648;&#x8FF0;&#x4E2D;&#xFF0C;&#x7F3A;&#x7701;&#x5E73;&#x53F0;&#x662F;x86/Linux/gcc&#xFF0C;&#x9075;&#x5FAA;ILP32&#xFF0C;&#x5E76;&#x4E14;<code class="literal">char</code>&#x662F;&#x6709;&#x7B26;&#x53F7;&#x7684;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x6BCF;&#x6B21;&#x90FD;&#x52A0;&#x4EE5;&#x8BF4;&#x660E;&#xFF0C;&#x4F46;&#x8BF4;&#x5230;&#x5176;&#x5B83;&#x5E73;&#x53F0;&#x65F6;&#x6211;&#x4F1A;&#x660E;&#x786E;&#x6307;&#x51FA;&#x662F;&#x4EC0;&#x4E48;&#x5E73;&#x53F0;</em></span>&#x3002;</p><p>&#x5728;<a class="xref" href="ch02s02.html#expr.constant">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;&#x5E38;&#x91CF;&#x201D;</a>&#x8BB2;&#x8FC7;C&#x8BED;&#x8A00;&#x7684;&#x5E38;&#x91CF;&#x6709;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x3001;&#x5B57;&#x7B26;&#x5E38;&#x91CF;&#x3001;&#x679A;&#x4E3E;&#x5E38;&#x91CF;&#x548C;&#x6D6E;&#x70B9;&#x6570;&#x5E38;&#x91CF;&#x56DB;&#x79CD;&#xFF0C;&#x5176;&#x5B9E;&#x5B57;&#x7B26;&#x5E38;&#x91CF;&#x548C;&#x679A;&#x4E3E;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x90FD;&#x662F;<code class="literal">int</code>&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x524D;&#x4E09;&#x79CD;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x90FD;&#x5C5E;&#x4E8E;&#x6574;&#x578B;&#x3002;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4E0D;&#x5168;&#x662F;<code class="literal">int</code>&#x578B;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x3002;</p><p>&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x53EA;&#x7528;&#x5230;&#x5341;&#x8FDB;&#x5236;&#x7684;&#x6574;&#x6570;&#x5E38;&#x91CF;&#xFF0C;&#x5176;&#x5B9E;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x516B;&#x8FDB;&#x5236;&#x548C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x7684;&#x6574;&#x6570;&#x5E38;&#x91CF;<sup>[<a id="id2757137" href="#ftn.id2757137" class="footnote">26</a>]</sup>&#x3002;&#x516B;&#x8FDB;&#x5236;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x4EE5;0&#x5F00;&#x5934;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x6570;&#x5B57;&#x53EA;&#x80FD;&#x662F;0~7&#xFF0C;&#x4F8B;&#x5982;022&#xFF0C;&#x56E0;&#x6B64;&#x5341;&#x8FDB;&#x5236;&#x7684;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x5C31;&#x4E0D;&#x80FD;&#x4EE5;0&#x5F00;&#x5934;&#x4E86;&#xFF0C;&#x5426;&#x5219;&#x65E0;&#x6CD5;&#x548C;&#x516B;&#x8FDB;&#x5236;&#x533A;&#x5206;&#x3002;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x4EE5;0x&#x6216;0X&#x5F00;&#x5934;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x662F;0~9&#x3001;a~f&#x548C;A~F&#x3002;&#x5728;<a class="xref" href="ch02s06.html#expr.charencoding">&#x7B2C;&#xA0;6&#xA0;&#x8282; &#x201C;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x4E0E;&#x5B57;&#x7B26;&#x7F16;&#x7801;&#x201D;</a>&#x8BB2;&#x8FC7;&#x4E00;&#x79CD;&#x8F6C;&#x4E49;&#x5E8F;&#x5217;&#xFF0C;&#x4EE5;\&#x6216;\x&#x52A0;&#x516B;&#x8FDB;&#x5236;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x76F8;&#x5F53;&#x4E8E;&#x628A;&#x516B;&#x8FDB;&#x5236;&#x548C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x5F00;&#x5934;&#x7684;0&#x66FF;&#x6362;&#x6210;\&#x4E86;&#x3002;</p><p>&#x6574;&#x6570;&#x5E38;&#x91CF;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x672B;&#x5C3E;&#x52A0;u&#x6216;U&#x8868;&#x793A;&#x201C;<span class="quote">unsigned</span>&#x201D;&#xFF0C;&#x52A0;l&#x6216;L&#x8868;&#x793A;&#x201C;<span class="quote">long</span>&#x201D;&#xFF0C;&#x52A0;ll&#x6216;LL&#x8868;&#x793A;&#x201C;<span class="quote">long long</span>&#x201D;&#xFF0C;&#x4F8B;&#x5982;0x1234U&#xFF0C;98765ULL&#x7B49;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;u&#x3001;l&#x3001;ll&#x8FD9;&#x51E0;&#x79CD;&#x540E;&#x7F00;&#x548C;&#x4E0A;&#x9762;&#x8BB2;&#x7684;<code class="literal">unsigned</code>&#x3001;<code class="literal">long</code>&#x3001;<code class="literal">long long</code>&#x5173;&#x952E;&#x5B57;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x51C6;&#x786E;&#x7684;&#x63CF;&#x8FF0;&#x5982;&#x4E0B;&#x8868;&#x6240;&#x793A;&#xFF08;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.c99" title="ISO/IEC 9899: Programming Languages &#xFF0D; C">[<abbr class="abbrev">C99</abbr>]</a>&#x6761;&#x6B3E;6.4.4.1&#xFF09;&#x3002;</p><div class="table"><a id="id2757215"></a><p class="title"><b>&#x8868;&#xA0;15.2.&#xA0;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;</b></p><div class="table-contents"><table summary="&#x6574;&#x6570;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;" border="1"><colgroup><col><col><col></colgroup><thead><tr><th>&#x540E;&#x7F00;</th><th>&#x5341;&#x8FDB;&#x5236;&#x5E38;&#x91CF;</th><th>&#x516B;&#x8FDB;&#x5236;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5E38;&#x91CF;</th></tr></thead><tbody><tr><td>&#x65E0;</td><td><div class="literallayout"><p>int<br>
long&#xA0;int<br>
long&#xA0;long&#xA0;int</p></div></td><td><div class="literallayout"><p>int<br>
unsigned&#xA0;int<br>
long&#xA0;int<br>
unsigned&#xA0;long&#xA0;int<br>
long&#xA0;long&#xA0;int<br>
unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td></tr><tr><td>u&#x6216;U</td><td><div class="literallayout"><p>unsigned&#xA0;int<br>
unsigned&#xA0;long&#xA0;int<br>
unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td><td><div class="literallayout"><p>unsigned&#xA0;int<br>
unsigned&#xA0;long&#xA0;int<br>
unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td></tr><tr><td>l&#x6216;L</td><td><div class="literallayout"><p>long&#xA0;int<br>
long&#xA0;long&#xA0;int</p></div></td><td><div class="literallayout"><p>long&#xA0;int<br>
unsigned&#xA0;long&#xA0;int<br>
long&#xA0;long&#xA0;int<br>
unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td></tr><tr><td>&#x65E2;&#x6709;u&#x6216;U&#xFF0C;&#x53C8;&#x6709;l&#x6216;L</td><td><div class="literallayout"><p>unsigned&#xA0;long&#xA0;int<br>
unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td><td><div class="literallayout"><p>unsigned&#xA0;long&#xA0;int<br>
unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td></tr><tr><td>ll&#x6216;LL</td><td><div class="literallayout"><p>long&#xA0;long&#xA0;int</p></div></td><td><div class="literallayout"><p>long&#xA0;long&#xA0;int<br>
unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td></tr><tr><td>&#x65E2;&#x6709;u&#x6216;U&#xFF0C;&#x53C8;&#x6709;ll&#x6216;LL</td><td><div class="literallayout"><p>unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td><td><div class="literallayout"><p>unsigned&#xA0;long&#xA0;long&#xA0;int</p></div></td></tr></tbody></table></div></div><br class="table-break"><p>&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x5E38;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;1234U&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5E94;&#x8BE5;&#x5C5E;&#x4E8E;&#x201C;<span class="quote">u&#x6216;U</span>&#x201D;&#x8FD9;&#x4E00;&#x884C;&#x7684;&#x201C;<span class="quote">&#x5341;&#x8FDB;&#x5236;&#x5E38;&#x91CF;</span>&#x201D;&#x8FD9;&#x4E00;&#x5217;&#xFF0C;&#x8FD9;&#x4E2A;&#x8868;&#x683C;&#x5355;&#x5143;&#x4E2D;&#x5217;&#x4E86;&#x4E09;&#x79CD;&#x7C7B;&#x578B;<code class="literal">unsigned int</code>&#x3001;<code class="literal">unsigned long int</code>&#x3001;<code class="literal">unsigned long long int</code>&#xFF0C;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x627E;&#x51FA;&#x7B2C;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x957F;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x8868;&#x793A;1234&#x8FD9;&#x4E2A;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x679C;<code class="literal">int</code>&#x662F;32&#x4F4D;&#x7684;&#x90A3;&#x4E48;<code class="literal">unsigned int</code>&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x3002;</p><p>&#x518D;&#x6BD4;&#x5982;0xffff0000&#xFF0C;&#x5E94;&#x8BE5;&#x5C5E;&#x4E8E;&#x7B2C;&#x4E00;&#x884C;&#x201C;<span class="quote">&#x65E0;</span>&#x201D;&#x7684;&#x7B2C;&#x4E8C;&#x5217;&#x201C;<span class="quote">&#x516B;&#x8FDB;&#x5236;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5E38;&#x91CF;</span>&#x201D;&#xFF0C;&#x8FD9;&#x4E00;&#x5217;&#x6709;&#x516D;&#x79CD;&#x7C7B;&#x578B;<code class="literal">int</code>&#x3001;<code class="literal">unsigned int</code>&#x3001;<code class="literal">long int</code>&#x3001;<code class="literal">unsigned long int</code>&#x3001;<code class="literal">long long int</code>&#x3001;<code class="literal">unsigned long long int</code>&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;<code class="literal">int</code>&#x8868;&#x793A;&#x4E0D;&#x4E86;0xffff0000&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5199;&#x8FD9;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5E38;&#x91CF;&#x662F;&#x8981;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x6B63;&#x6570;&#xFF0C;&#x800C;&#x5B83;&#x7684;MSB&#xFF08;&#x7B2C;31&#x4F4D;&#xFF09;&#x662F;1&#xFF0C;&#x5982;&#x679C;&#x6309;&#x6709;&#x7B26;&#x53F7;<code class="literal">int</code>&#x7C7B;&#x578B;&#x6765;&#x89E3;&#x91CA;&#x5C31;&#x6210;&#x4E86;&#x8D1F;&#x6570;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7C7B;&#x578B;<code class="literal">unsigned int</code>&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x5E94;&#x8BE5;&#x7B97;<code class="literal">unsigned int</code>&#x3002;&#x6240;&#x4EE5;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;0x7fffffff&#x548C;0xffff0000&#x8FD9;&#x4E24;&#x4E2A;&#x5E38;&#x91CF;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x524D;&#x8005;&#x662F;<code class="literal">int</code>&#x578B;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x662F;<code class="literal">unsigned int</code>&#x578B;&#x3002;</p><p>&#x8BB2;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;x86&#x5E73;&#x53F0;&#x4E0A;<code class="literal">int</code>&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;-2147483648~2147483647&#xFF0C;&#x90A3;&#x4E48;&#x7528;<code class="literal">printf(&quot;%d\n&quot;, -2147483648);</code>&#x6253;&#x5370;<code class="literal">int</code>&#x7C7B;&#x578B;&#x7684;&#x4E0B;&#x754C;&#x6709;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x7528;<code class="literal">gcc main.c -std=c99</code>&#x7F16;&#x8BD1;&#x4F1A;&#x6709;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#xFF1A;<code class="literal">warning: format &#x2018;%d&#x2019; expects type &#x2018;int&#x2019;, but argument 2 has type &#x2018;long long int&#x2019;</code>&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x867D;&#x7136;-2147483648&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x80FD;&#x591F;&#x7528;<code class="literal">int</code>&#x578B;&#x8868;&#x793A;&#xFF0C;&#x4F46;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x5374;&#x6CA1;&#x6CD5;&#x5199;&#x51FA;&#x5BF9;&#x5E94;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x7684;<code class="literal">int</code>&#x578B;&#x5E38;&#x91CF;&#xFF0C;C&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x628A;&#x5B83;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x5E38;&#x91CF;2147483648&#x548C;&#x4E00;&#x4E2A;&#x8D1F;&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#x7EC4;&#x6210;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x800C;&#x6574;&#x6570;&#x5E38;&#x91CF;2147483648&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;&#x4E86;<code class="literal">int</code>&#x578B;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x5728;x86&#x5E73;&#x53F0;&#x4E0A;<code class="literal">int</code>&#x548C;<code class="literal">long</code>&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x76F8;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5E38;&#x91CF;&#x4E5F;&#x8D85;&#x8FC7;&#x4E86;<code class="literal">long</code>&#x578B;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x6839;&#x636E;&#x4E0A;&#x8868;&#x7B2C;&#x4E00;&#x884C;&#x201C;<span class="quote">&#x65E0;</span>&#x201D;&#x7684;&#x7B2C;&#x4E00;&#x5217;<code class="literal">&#x5341;&#x8FDB;&#x5236;&#x5E38;&#x91CF;</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x5E94;&#x8BE5;&#x7B97;<code class="literal">long long</code>&#x578B;&#x7684;&#xFF0C;&#x524D;&#x9762;&#x518D;&#x52A0;&#x4E2A;&#x8D1F;&#x53F7;&#x7EC4;&#x6210;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4ECD;&#x7136;&#x662F;<code class="literal">long long</code>&#x578B;&#xFF0C;&#x800C;<code class="literal">printf</code>&#x7684;<code class="literal">%d</code>&#x8F6C;&#x6362;&#x8BF4;&#x660E;&#x8981;&#x6C42;&#x540E;&#x9762;&#x7684;&#x53C2;&#x6570;&#x662F;<code class="literal">int</code>&#x578B;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x5668;&#x62A5;&#x8B66;&#x544A;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x547D;&#x4EE4;&#x8981;&#x52A0;<code class="literal">-std=c99</code>&#x9009;&#x9879;&#x662F;&#x56E0;&#x4E3A;C99&#x4EE5;&#x524D;&#x5BF9;&#x4E8E;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x89C4;&#x5B9A;&#x548C;&#x4E0A;&#x8868;&#x6709;&#x4E00;&#x4E9B;&#x51FA;&#x5165;&#xFF0C;&#x5373;&#x4F7F;&#x4E0D;&#x52A0;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x4E5F;&#x4F1A;&#x62A5;&#x8B66;&#x544A;&#xFF0C;&#x4F46;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x4E0D;&#x51C6;&#x786E;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x6539;&#x6210;<code class="literal">printf(&quot;%d\n&quot;, -2147483647-1);</code>&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x4E0D;&#x4F1A;&#x62A5;&#x8B66;&#x544A;&#x4E86;&#xFF0C;-&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;-2147483647&#x548C;1&#x90FD;&#x662F;<code class="literal">int</code>&#x578B;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4E5F;&#x5E94;&#x8BE5;&#x662F;<code class="literal">int</code>&#x578B;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x7684;&#x503C;&#x4E5F;&#x6CA1;&#x6709;&#x8D85;&#x51FA;<code class="literal">int</code>&#x578B;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF1B;&#x6216;&#x8005;&#x6539;&#x6210;<code class="literal">printf(&quot;%lld\n&quot;, -2147483648);</code>&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x8F6C;&#x6362;&#x8BF4;&#x660E;<code class="literal">%lld</code>&#x544A;&#x8BC9;<code class="literal">printf</code>&#x540E;&#x9762;&#x7684;&#x53C2;&#x6570;&#x662F;<code class="literal">long long</code>&#x578B;&#xFF0C;&#x6709;&#x4E9B;&#x8F6C;&#x6362;&#x8BF4;&#x660E;&#x683C;&#x5F0F;&#x76EE;&#x524D;&#x8FD8;&#x6CA1;&#x8BB2;&#x5230;&#xFF0C;&#x8BE6;&#x89C1;<a class="xref" href="ch25s02.html#stdlib.formatio">&#x7B2C;&#xA0;2.9&#xA0;&#x8282; &#x201C;&#x683C;&#x5F0F;&#x5316;I/O&#x51FD;&#x6570;&#x201D;</a>&#x3002;</p><p>&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x6CA1;&#x6709;&#x4F60;&#x539F;&#x6765;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x5427;&#x3002;&#x518D;&#x770B;&#x4E00;&#x4E2A;&#x4E0D;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#x3002;<code class="literal">long long i = 1234567890 * 1234567890;</code>&#x7F16;&#x8BD1;&#x65F6;&#x4F1A;&#x6709;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#xFF1A;<code class="literal">warning: integer overflow in expression</code>&#x3002;1234567890&#x662F;<code class="literal">int</code>&#x578B;&#xFF0C;&#x4E24;&#x4E2A;<code class="literal">int</code>&#x578B;&#x76F8;&#x4E58;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4ECD;&#x7136;&#x662F;<code class="literal">int</code>&#x578B;&#xFF0C;&#x800C;&#x4E58;&#x79EF;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;<code class="literal">int</code>&#x578B;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x63D0;&#x793A;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x6EA2;&#x51FA;&#x3002;&#x5982;&#x679C;&#x6539;&#x6210;<code class="literal">long long i = 1234567890LL * 1234567890;</code>&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x662F;<code class="literal">long long</code>&#x578B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x4E5F;&#x4F1A;&#x5148;&#x8F6C;&#x6362;&#x6210;<code class="literal">long long</code>&#x578B;&#x518D;&#x505A;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#xFF0C;&#x4E24;&#x6570;&#x76F8;&#x4E58;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x662F;<code class="literal">long long</code>&#x578B;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x4E0D;&#x4F1A;&#x62A5;&#x8B66;&#x544A;&#x4E86;&#x3002;&#x6709;&#x5173;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7684;&#x89C4;&#x5219;&#x5C06;&#x5728;<a class="xref" href="ch15s03.html#type.conversion">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x201D;</a>&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2756873" href="#id2756873" class="para">25</a>] </sup>&#x6211;&#x4EEC;&#x5728;<a class="xref" href="ch19s04.html#asmc.structunion">&#x7B2C;&#xA0;4&#xA0;&#x8282; &#x201C;&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x8054;&#x5408;&#x4F53;&#x201D;</a>&#x8FD8;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x6574;&#x578B;&#xFF0D;&#xFF0D;Bit-field&#x3002;</p></div><div class="footnote"><p><sup>[<a id="ftn.id2757137" href="#id2757137" class="para">26</a>] </sup>&#x6709;&#x4E9B;&#x7F16;&#x8BD1;&#x5668;&#xFF08;&#x6BD4;&#x5982;<code class="literal">gcc</code>&#xFF09;&#x4E5F;&#x652F;&#x6301;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x6574;&#x6570;&#x5E38;&#x91CF;&#xFF0C;&#x4EE5;0b&#x6216;0B&#x5F00;&#x5934;&#xFF0C;&#x6BD4;&#x5982;0b0001111&#xFF0C;&#x4F46;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x4ECE;&#x672A;&#x8FDB;&#x5165;C&#x6807;&#x51C6;&#xFF0C;&#x53EA;&#x662F;&#x67D0;&#x4E9B;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#xFF0C;&#x7531;&#x4E8E;&#x4E8C;&#x8FDB;&#x5236;&#x548C;&#x516B;&#x8FDB;&#x5236;&#x3001;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x975E;&#x5E38;&#x660E;&#x663E;&#xFF0C;&#x7528;&#x516B;&#x8FDB;&#x5236;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5E38;&#x91CF;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x4F7F;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x5E38;&#x91CF;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch15.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch15.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch15s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;15&#xA0;&#x7AE0;&#xA0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x6D6E;&#x70B9;&#x578B;</td></tr></tbody></table></div>
</body></html>