<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x4F4D;&#x8FD0;&#x7B97;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch16.html" title="&#x7B2C;&#xA0;16&#xA0;&#x7AE0;&#xA0;&#x8FD0;&#x7B97;&#x7B26;&#x8BE6;&#x89E3;"><link rel="prev" href="ch16.html" title="&#x7B2C;&#xA0;16&#xA0;&#x7AE0;&#xA0;&#x8FD0;&#x7B97;&#x7B26;&#x8BE6;&#x89E3;"><link rel="next" href="ch16s02.html" title="2.&#xA0;&#x5176;&#x5B83;&#x8FD0;&#x7B97;&#x7B26;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x4F4D;&#x8FD0;&#x7B97;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch16.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;16&#xA0;&#x7AE0;&#xA0;&#x8FD0;&#x7B97;&#x7B26;&#x8BE6;&#x89E3;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch16s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2761666"></a>1.&#xA0;&#x4F4D;&#x8FD0;&#x7B97;</h2></div></div></div><p>&#x6574;&#x6570;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x4F4D;&#x6765;&#x8868;&#x793A;&#xFF0C;C&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x6574;&#x6570;&#x4E2D;&#x7684;&#x4F4D;&#xFF0C;&#x79F0;&#x4E3A;&#x4F4D;&#x8FD0;&#x7B97;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x90FD;&#x5FC5;&#x987B;&#x662F;&#x6574;&#x578B;&#x7684;&#x3002;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x4E9B;&#x4FE1;&#x606F;&#x5229;&#x7528;&#x6574;&#x6570;&#x4E2D;&#x7684;&#x67D0;&#x51E0;&#x4E2A;&#x4F4D;&#x6765;&#x5B58;&#x50A8;&#xFF0C;&#x8981;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x4F4D;&#xFF0C;&#x4EC5;&#x4EC5;&#x6709;&#x5BF9;&#x6574;&#x6570;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x5FC5;&#x987B;&#x501F;&#x52A9;&#x4F4D;&#x8FD0;&#x7B97;&#xFF0C;&#x4F8B;&#x5982;<a class="xref" href="apas02.html#app-encoding.utf8">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;Unicode&#x548C;UTF-8&#x201D;</a>&#x4ECB;&#x7ECD;&#x7684;UTF-8&#x7F16;&#x7801;&#x5C31;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5B66;&#x5B8C;&#x672C;&#x8282;&#x4E4B;&#x540E;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x81EA;&#x5DF1;&#x5199;&#x51FA;UTF-8&#x7684;&#x7F16;&#x7801;&#x548C;&#x89E3;&#x7801;&#x7A0B;&#x5E8F;&#x3002;&#x672C;&#x8282;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x5404;&#x79CD;&#x4F4D;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x7136;&#x540E;&#x4ECB;&#x7ECD;&#x4E0E;&#x4F4D;&#x8FD0;&#x7B97;&#x6709;&#x5173;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x5DE7;&#x3002;</p><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2761062"></a>1.1.&#xA0;&#x6309;&#x4F4D;&#x4E0E;&#x3001;&#x6216;&#x3001;&#x5F02;&#x6216;&#x3001;&#x53D6;&#x53CD;&#x8FD0;&#x7B97;</h3></div></div></div><p>&#x5728;<a class="xref" href="ch04s03.html#cond.bool">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x5E03;&#x5C14;&#x4EE3;&#x6570;&#x201D;</a>&#x8BB2;&#x8FC7;&#x903B;&#x8F91;&#x4E0E;&#x3001;&#x6216;&#x3001;&#x975E;&#x8FD0;&#x7B97;&#xFF0C;&#x5E76;&#x5217;&#x51FA;&#x4E86;&#x771F;&#x503C;&#x8868;&#xFF0C;&#x5BF9;&#x4E8E;&#x6574;&#x6570;&#x4E2D;&#x7684;&#x4F4D;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x4E0E;&#x3001;&#x6216;&#x3001;&#x975E;&#x8FD0;&#x7B97;&#xFF0C;C&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x6309;&#x4F4D;&#x4E0E;&#xFF08;Bitwise AND&#xFF09;<a id="id2761684" class="indexterm"></a>&#x8FD0;&#x7B97;&#x7B26;&amp;&#x3001;&#x6309;&#x4F4D;&#x6216;&#xFF08;Bitwise OR&#xFF09;<a id="id2761693" class="indexterm"></a>&#x8FD0;&#x7B97;&#x7B26;|&#x548C;&#x6309;&#x4F4D;&#x53D6;&#x53CD;&#xFF08;Bitwise NOT&#xFF09;<a id="id2761700" class="indexterm"></a>&#x8FD0;&#x7B97;&#x7B26;~&#xFF0C;&#x6B64;&#x5916;&#x8FD8;&#x6709;&#x6309;&#x4F4D;&#x5F02;&#x6216;&#xFF08;Bitwise XOR&#xFF09;<a id="id2761708" class="indexterm"></a>&#x8FD0;&#x7B97;&#x7B26;^&#xFF0C;&#x6211;&#x4EEC;&#x5728;<a class="xref" href="ch14s01.html#number.binary">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#x8BA1;&#x7B97;&#x673A;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x201D;</a>&#x8BB2;&#x8FC7;&#x5F02;&#x6216;&#x8FD0;&#x7B97;&#x3002;&#x4E0B;&#x9762;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x5F62;&#x5F0F;&#x4E3E;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p><div class="figure"><a id="id2761724"></a><p class="title"><b>&#x56FE;&#xA0;16.1.&#xA0;&#x4F4D;&#x8FD0;&#x7B97;</b></p><div class="figure-contents"><div><img src="images/op.bitwise.png" alt="&#x4F4D;&#x8FD0;&#x7B97;"></div></div></div><br class="figure-break"><p>&#x6CE8;&#x610F;&#xFF0C;&amp;&#x3001;|&#x3001;^&#x8FD0;&#x7B97;&#x7B26;&#x90FD;&#x662F;&#x8981;&#x505A;Usual Arithmetic Conversion&#x7684;&#xFF08;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x6B65;&#x662F;Integer Promotion&#xFF09;&#xFF0C;~&#x8FD0;&#x7B97;&#x7B26;&#x4E5F;&#x8981;&#x505A;Integer Promotion&#xFF0C;&#x6240;&#x4EE5;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x5B58;&#x5728;8&#x4F4D;&#x6574;&#x6570;&#x7684;&#x4F4D;&#x8FD0;&#x7B97;&#xFF0C;&#x64CD;&#x4F5C;&#x6570;&#x5728;&#x505A;&#x4F4D;&#x8FD0;&#x7B97;&#x4E4B;&#x524D;&#x90FD;&#x81F3;&#x5C11;&#x88AB;&#x63D0;&#x5347;&#x4E3A;<code class="literal">int</code>&#x578B;&#x4E86;&#xFF0C;&#x4E0A;&#x9762;&#x7528;8&#x4F4D;&#x6574;&#x6570;&#x4E3E;&#x4F8B;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x4E66;&#x5199;&#x65B9;&#x4FBF;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p><pre class="programlisting">unsigned char c = 0xfc;
unsigned int i = ~c;</pre><p>&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5E38;&#x91CF;0xfc&#x662F;<code class="literal">int</code>&#x578B;&#x7684;&#xFF0C;&#x8D4B;&#x7ED9;<code class="literal">c</code>&#x8981;&#x8F6C;&#x6210;<code class="literal">unsigned char</code>&#xFF0C;&#x503C;&#x4E0D;&#x53D8;&#xFF1B;<code class="literal">c</code>&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x662F;fc&#xFF0C;&#x8BA1;&#x7B97;<code class="literal">~c</code>&#x65F6;&#x5148;&#x63D0;&#x5347;&#x4E3A;&#x6574;&#x578B;&#xFF08;000000fc&#xFF09;&#x7136;&#x540E;&#x53D6;&#x53CD;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x662F;ffffff03&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x628A;<code class="literal">~c</code>&#x770B;&#x6210;&#x662F;8&#x4F4D;&#x6574;&#x6570;&#x7684;&#x53D6;&#x53CD;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x5C31;&#x5F97;3&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x9519;&#x4E86;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x51FA;&#x9519;&#xFF0C;&#x4E00;&#x662F;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x8D4B;&#x503C;&#xFF0C;&#x4E8C;&#x662F;&#x6BCF;&#x4E00;&#x6B65;&#x8BA1;&#x7B97;&#x90FD;&#x8981;&#x6309;&#x4E0A;&#x4E00;&#x7AE0;&#x8BB2;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x89C4;&#x5219;&#x4ED4;&#x7EC6;&#x68C0;&#x67E5;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2761805"></a>1.2.&#xA0;&#x79FB;&#x4F4D;&#x8FD0;&#x7B97;</h3></div></div></div><p>&#x79FB;&#x4F4D;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;Bitwise Shift&#xFF09;<a id="id2761813" class="indexterm"></a>&#x5305;&#x62EC;&#x5DE6;&#x79FB;&lt;&lt;&#x548C;&#x53F3;&#x79FB;&gt;&gt;&#x3002;&#x5DE6;&#x79FB;&#x5C06;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x7684;&#x5404;&#x4E8C;&#x8FDB;&#x5236;&#x4F4D;&#x5168;&#x90E8;&#x5DE6;&#x79FB;&#x82E5;&#x5E72;&#x4F4D;&#xFF0C;&#x4F8B;&#x5982;0xcfffffff3&lt;&lt;2&#x5F97;&#x5230;0x3fffffcc&#xFF1A;</p><div class="figure"><a id="id2761824"></a><p class="title"><b>&#x56FE;&#xA0;16.2.&#xA0;&#x5DE6;&#x79FB;&#x8FD0;&#x7B97;</b></p><div class="figure-contents"><div><img src="images/op.shiftleft.png" alt="&#x5DE6;&#x79FB;&#x8FD0;&#x7B97;"></div></div></div><br class="figure-break"><p>&#x6700;&#x9AD8;&#x4E24;&#x4F4D;&#x7684;11&#x88AB;&#x79FB;&#x51FA;&#x53BB;&#x4E86;&#xFF0C;&#x6700;&#x4F4E;&#x4E24;&#x4F4D;&#x53C8;&#x8865;&#x4E86;&#x4E24;&#x4E2A;0&#xFF0C;&#x5176;&#x5B83;&#x4F4D;&#x4F9D;&#x6B21;&#x5DE6;&#x79FB;&#x4E24;&#x4F4D;&#x3002;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x79FB;&#x52A8;&#x7684;&#x4F4D;&#x6570;&#x5FC5;&#x987B;&#x5C0F;&#x4E8E;&#x5DE6;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x603B;&#x4F4D;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5DE6;&#x8FB9;&#x662F;<code class="literal">unsigned int</code>&#x578B;&#xFF0C;&#x5982;&#x679C;&#x5DE6;&#x79FB;&#x7684;&#x4F4D;&#x6570;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;32&#x4F4D;&#xFF0C;&#x5219;&#x7ED3;&#x679C;&#x662F;Undefined&#x3002;&#x79FB;&#x4F4D;&#x8FD0;&#x7B97;&#x7B26;&#x4E0D;&#x540C;&#x4E8E;+ - * / ==&#x7B49;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4E24;&#x8FB9;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x8981;&#x6C42;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x4E24;&#x8FB9;&#x64CD;&#x4F5C;&#x6570;&#x90FD;&#x8981;&#x505A;Integer Promotion&#xFF0C;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x5DE6;&#x64CD;&#x4F5C;&#x6570;&#x63D0;&#x5347;&#x540E;&#x7684;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;</p><p>&#x590D;&#x4E60;&#x4E00;&#x4E0B;<a class="xref" href="ch14s02.html#number.convert">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;&#x4E0D;&#x540C;&#x8FDB;&#x5236;&#x4E4B;&#x95F4;&#x7684;&#x6362;&#x7B97;&#x201D;</a>&#x8BB2;&#x8FC7;&#x7684;&#x77E5;&#x8BC6;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;<span class="emphasis"><em>&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x5DE6;&#x79FB;1&#x4F4D;&#x76F8;&#x5F53;&#x4E8E;&#x4E58;&#x4EE5;2</em></span>&#x3002;&#x6BD4;&#x5982;&#x4E8C;&#x8FDB;&#x5236;11&#xFF08;&#x5341;&#x8FDB;&#x5236;3&#xFF09;&#x5DE6;&#x79FB;&#x4E00;&#x4F4D;&#x53D8;&#x6210;110&#xFF0C;&#x5C31;&#x662F;6&#xFF0C;&#x518D;&#x5DE6;&#x79FB;&#x4E00;&#x4F4D;&#x53D8;&#x6210;1100&#xFF0C;&#x5C31;&#x662F;12&#x3002;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x9A8C;&#x8BC1;&#x8FD9;&#x6761;&#x89C4;&#x5F8B;&#x5BF9;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x548C;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x90FD;&#x6210;&#x7ACB;&#xFF0C;&#x5BF9;&#x8D1F;&#x6570;&#x4E5F;&#x6210;&#x7ACB;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x5DE6;&#x79FB;&#x6539;&#x53D8;&#x4E86;&#x6700;&#x9AD8;&#x4F4D;&#xFF08;&#x7B26;&#x53F7;&#x4F4D;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x7ED3;&#x679C;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x4E58;&#x4EE5;2&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x52A0;&#x4E86;&#x4E2A;&#x524D;&#x63D0;&#x201C;<span class="quote">&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5185;</span>&#x201D;&#x3002;&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x79FB;&#x4F4D;&#x6BD4;&#x505A;&#x4E58;&#x6CD5;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E00;&#x70B9;&#x505A;&#x4F18;&#x5316;&#xFF0C;&#x6BD4;&#x5982;&#x770B;&#x5230;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x6709;<code class="literal">i * 8</code>&#xFF0C;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1;&#x6210;&#x79FB;&#x4F4D;&#x6307;&#x4EE4;&#x800C;&#x4E0D;&#x662F;&#x4E58;&#x6CD5;&#x6307;&#x4EE4;&#x3002;</p><p>&#x5F53;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x65F6;&#xFF0C;&#x53F3;&#x79FB;&#x8FD0;&#x7B97;&#x7684;&#x89C4;&#x5219;&#x548C;&#x5DE6;&#x79FB;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F8B;&#x5982;0xcfffffff3&gt;&gt;2&#x5F97;&#x5230;0x33fffffc&#xFF1A;</p><div class="figure"><a id="id2761899"></a><p class="title"><b>&#x56FE;&#xA0;16.3.&#xA0;&#x53F3;&#x79FB;&#x8FD0;&#x7B97;</b></p><div class="figure-contents"><div><img src="images/op.shiftright.png" alt="&#x53F3;&#x79FB;&#x8FD0;&#x7B97;"></div></div></div><br class="figure-break"><p>&#x6700;&#x4F4E;&#x4E24;&#x4F4D;&#x7684;11&#x88AB;&#x79FB;&#x51FA;&#x53BB;&#x4E86;&#xFF0C;&#x6700;&#x9AD8;&#x4E24;&#x4F4D;&#x53C8;&#x8865;&#x4E86;&#x4E24;&#x4E2A;0&#xFF0C;&#x5176;&#x5B83;&#x4F4D;&#x4F9D;&#x6B21;&#x53F3;&#x79FB;&#x4E24;&#x4F4D;&#x3002;&#x548C;&#x5DE6;&#x79FB;&#x7C7B;&#x4F3C;&#xFF0C;&#x79FB;&#x52A8;&#x7684;&#x4F4D;&#x6570;&#x4E5F;&#x5FC5;&#x987B;&#x5C0F;&#x4E8E;&#x5DE6;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x603B;&#x4F4D;&#x6570;&#xFF0C;&#x5426;&#x5219;&#x7ED3;&#x679C;&#x662F;Undefined&#x3002;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x53F3;&#x79FB;1&#x4F4D;&#x76F8;&#x5F53;&#x4E8E;&#x9664;&#x4EE5;2&#xFF0C;&#x5C0F;&#x6570;&#x90E8;&#x5206;&#x622A;&#x6389;&#x3002;</p><p>&#x5F53;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x65F6;&#xFF0C;&#x53F3;&#x79FB;&#x8FD0;&#x7B97;&#x7684;&#x89C4;&#x5219;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x5982;&#x679C;&#x662F;&#x6B63;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x9AD8;&#x4F4D;&#x79FB;&#x5165;0</p></li><li><p>&#x5982;&#x679C;&#x662F;&#x8D1F;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x9AD8;&#x4F4D;&#x79FB;&#x5165;1&#x8FD8;&#x662F;0&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x8FD9;&#x662F;Implementation-defined&#x7684;&#x3002;&#x5BF9;&#x4E8E;x86&#x5E73;&#x53F0;&#x7684;<code class="literal">gcc</code>&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x6700;&#x9AD8;&#x4F4D;&#x79FB;&#x5165;1&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4ECD;&#x4FDD;&#x6301;&#x8D1F;&#x6570;&#x7684;&#x7B26;&#x53F7;&#x4F4D;&#xFF0C;&#x8FD9;&#x79CD;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5BF9;&#x8D1F;&#x6570;&#x4ECD;&#x7136;&#x4FDD;&#x6301;&#x4E86;&#x201C;<span class="quote">&#x53F3;&#x79FB;1&#x4F4D;&#x76F8;&#x5F53;&#x4E8E;&#x9664;&#x4EE5;2</span>&#x201D;&#x7684;&#x6027;&#x8D28;&#x3002;</p></li></ul></div><p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x7531;&#x4E8E;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x548C;&#x79FB;&#x4F4D;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x505A;&#x4F4D;&#x8FD0;&#x7B97;&#x662F;&#x5F88;&#x4E0D;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;<span class="emphasis"><em>&#x5EFA;&#x8BAE;&#x53EA;&#x5BF9;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x505A;&#x4F4D;&#x8FD0;&#x7B97;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x51FA;&#x9519;&#x7684;&#x53EF;&#x80FD;</em></span>&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a id="id2761960"></a>&#x4E60;&#x9898;</h4></div></div></div><p>1&#x3001;&#x4E0B;&#x9762;&#x4E24;&#x884C;<code class="literal">printf</code>&#x6253;&#x5370;&#x7684;&#x7ED3;&#x679C;&#x6709;&#x4F55;&#x4E0D;&#x540C;&#xFF1F;&#x8BF7;&#x8BFB;&#x8005;&#x6BD4;&#x8F83;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x3002;<code class="literal">%x</code>&#x8F6C;&#x6362;&#x8BF4;&#x660E;&#x7684;&#x542B;&#x4E49;&#x8BE6;&#x89C1;<a class="xref" href="ch25s02.html#stdlib.formatio">&#x7B2C;&#xA0;2.9&#xA0;&#x8282; &#x201C;&#x683C;&#x5F0F;&#x5316;I/O&#x51FD;&#x6570;&#x201D;</a>&#x3002;</p><pre class="programlisting">int i = 0xcffffff3;
printf(&quot;%x\n&quot;, 0xcffffff3&gt;&gt;2);
printf(&quot;%x\n&quot;, i&gt;&gt;2);</pre></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2761995"></a>1.3.&#xA0;&#x63A9;&#x7801;</h3></div></div></div><p>&#x5982;&#x679C;&#x8981;&#x5BF9;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x4F4D;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x600E;&#x6837;&#x8868;&#x793A;&#x8FD9;&#x4E9B;&#x4F4D;&#x5728;&#x6574;&#x6570;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x7528;&#x63A9;&#x7801;&#xFF08;Mask&#xFF09;<a id="id2762004" class="indexterm"></a>&#x6765;&#x8868;&#x793A;&#x3002;&#x6BD4;&#x5982;&#x63A9;&#x7801;0x0000ff00&#x8868;&#x793A;&#x5BF9;&#x4E00;&#x4E2A;32&#x4F4D;&#x6574;&#x6570;&#x7684;8~15&#x4F4D;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4E3E;&#x4F8B;&#x5982;&#x4E0B;&#x3002;</p><p>1&#x3001;&#x53D6;&#x51FA;8~15&#x4F4D;&#x3002;</p><pre class="programlisting">unsigned int a, b, mask = 0x0000ff00;
a = 0x12345678;
b = (a &amp; mask) &gt;&gt; 8; /* 0x00000056 */</pre><p>&#x8FD9;&#x6837;&#x4E5F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF1A;</p><pre class="programlisting">b = (a &gt;&gt; 8) &amp; ~(~0U &lt;&lt; 8);</pre><p>2&#x3001;&#x5C06;8~15&#x4F4D;&#x6E05;0&#x3002;</p><pre class="programlisting">unsigned int a, b, mask = 0x0000ff00;
a = 0x12345678;
b = a &amp; ~mask; /* 0x12340078 */</pre><p>3&#x3001;&#x5C06;8~15&#x4F4D;&#x7F6E;1&#x3002;</p><pre class="programlisting">unsigned int a, b, mask = 0x0000ff00;
a = 0x12345678;
b = a | mask; /* 0x1234ff78 */</pre><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a id="id2762050"></a>&#x4E60;&#x9898;</h4></div></div></div><p>1&#x3001;&#x7EDF;&#x8BA1;&#x4E00;&#x4E2A;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x4E2D;1&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x51FD;&#x6570;&#x539F;&#x578B;&#x662F;<code class="literal">int countbit(unsigned int x);</code>&#x3002;</p><p>2&#x3001;&#x7528;&#x4F4D;&#x64CD;&#x4F5C;&#x5B9E;&#x73B0;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x7684;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#xFF0C;&#x51FD;&#x6570;&#x539F;&#x578B;&#x662F;<code class="literal">unsigned int multiply(unsigned int x, unsigned int y);</code>&#x3002;&#x4F8B;&#x5982;&#xFF1A;(11011)<sub>2</sub>&#xD7;(10010)<sub>2</sub>=((11011)<sub>2</sub>&lt;&lt;1)+((11011)<sub>2</sub>&lt;&lt;4)&#x3002;</p><p>3&#x3001;&#x5BF9;&#x4E00;&#x4E2A;32&#x4F4D;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x505A;&#x5FAA;&#x73AF;&#x53F3;&#x79FB;&#xFF0C;&#x51FD;&#x6570;&#x539F;&#x578B;&#x662F;<code class="literal">unsigned int rotate_right(unsigned int x);</code>&#x3002;&#x6240;&#x8C13;&#x5FAA;&#x73AF;&#x53F3;&#x79FB;&#x5C31;&#x662F;&#x628A;&#x4F4E;&#x4F4D;&#x79FB;&#x51FA;&#x53BB;&#x7684;&#x90E8;&#x5206;&#x518D;&#x8865;&#x5230;&#x9AD8;&#x4F4D;&#x4E0A;&#x53BB;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">rotate_right(0xdeadbeef, 16)</code>&#x7684;&#x503C;&#x5E94;&#x8BE5;&#x662F;0xefdeadbe&#x3002;</p></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2762114"></a>1.4.&#xA0;&#x5F02;&#x6216;&#x8FD0;&#x7B97;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;</h3></div></div></div><p>1&#x3001;&#x4E00;&#x4E2A;&#x6570;&#x548C;&#x81EA;&#x5DF1;&#x505A;&#x5F02;&#x6216;&#x7684;&#x7ED3;&#x679C;&#x662F;0&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5E38;&#x6570;0&#xFF0C;x86&#x5E73;&#x53F0;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x751F;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x6307;&#x4EE4;&#xFF1A;<code class="literal">xorl %eax, %eax</code>&#x3002;&#x4E0D;&#x7BA1;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x91CC;&#x7684;&#x503C;&#x539F;&#x6765;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x505A;&#x5F02;&#x6216;&#x8FD0;&#x7B97;&#x90FD;&#x80FD;&#x5F97;&#x5230;0&#xFF0C;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x6BD4;&#x540C;&#x6837;&#x6548;&#x679C;&#x7684;<code class="literal">movl $0, %eax</code>&#x6307;&#x4EE4;&#x5FEB;&#xFF0C;&#x56E0;&#x4E3A;&#x524D;&#x8005;&#x53EA;&#x9700;&#x8981;&#x5728;CPU&#x5185;&#x90E8;&#x8BA1;&#x7B97;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;<a class="xref" href="ch17s05.html#arch.memh">&#x7B2C;&#xA0;5&#xA0;&#x8282; &#x201C;Memory Hierarchy&#x201D;</a>&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;</p><p>2&#x3001;&#x4ECE;&#x5F02;&#x6216;&#x7684;&#x771F;&#x503C;&#x8868;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;0&#x8FD8;&#x662F;1&#xFF0C;&#x548C;0&#x505A;&#x5F02;&#x6216;&#x4FDD;&#x6301;&#x539F;&#x503C;&#x4E0D;&#x53D8;&#xFF0C;&#x548C;1&#x505A;&#x5F02;&#x6216;&#x5F97;&#x5230;&#x539F;&#x503C;&#x7684;&#x76F8;&#x53CD;&#x503C;&#x3002;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x914D;&#x5408;&#x63A9;&#x7801;&#x5B9E;&#x73B0;&#x67D0;&#x4E9B;&#x4F4D;&#x7684;&#x7FFB;&#x8F6C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">unsigned int a, b, mask = 1U &lt;&lt; 6;
a = 0x12345678;
b = a ^ mask; /* flip the 6th bit */</pre><p>3&#x3001;&#x5982;&#x679C;a<sub>1</sub> ^ a<sub>2</sub> ^ a<sub>3</sub> ^ ... ^ a<sub>n</sub>&#x7684;&#x7ED3;&#x679C;&#x662F;1&#xFF0C;&#x5219;&#x8868;&#x793A;a<sub>1</sub>&#x3001;a<sub>2</sub>&#x3001;a<sub>3</sub>...a<sub>n</sub>&#x4E4B;&#x4E2D;1&#x7684;&#x4E2A;&#x6570;&#x4E3A;&#x5947;&#x6570;&#x4E2A;&#xFF0C;&#x5426;&#x5219;&#x4E3A;&#x5076;&#x6570;&#x4E2A;&#x3002;&#x8FD9;&#x6761;&#x6027;&#x8D28;&#x53EF;&#x7528;&#x4E8E;&#x5947;&#x5076;&#x6821;&#x9A8C;&#xFF08;Parity Check&#xFF09;<a id="id2762202" class="indexterm"></a>&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x4E32;&#x53E3;&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#x90FD;&#x8BA1;&#x7B97;&#x4E00;&#x4E2A;&#x6821;&#x9A8C;&#x4F4D;&#xFF0C;&#x6570;&#x636E;&#x548C;&#x6821;&#x9A8C;&#x4F4D;&#x4E00;&#x8D77;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x63A5;&#x6536;&#x65B9;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6821;&#x9A8C;&#x4F4D;&#x7C97;&#x7565;&#x5730;&#x5224;&#x65AD;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x5426;&#x6709;&#x8BEF;&#x3002;</p><p>4&#x3001;x ^ x ^ y == y&#xFF0C;&#x56E0;&#x4E3A;x ^ x == 0&#xFF0C;0 ^ y == y&#x3002;&#x8FD9;&#x4E2A;&#x6027;&#x8D28;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4EA4;&#x6362;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x4E0D;&#x5F97;&#x501F;&#x52A9;&#x989D;&#x5916;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E0D;&#x80FD;&#x91C7;&#x7528;<code class="literal">temp = a; a = b; b = temp;</code>&#x7684;&#x529E;&#x6CD5;&#x4E86;&#x3002;&#x5229;&#x7528;&#x4F4D;&#x8FD0;&#x7B97;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#x4EA4;&#x6362;&#xFF1A;</p><pre class="programlisting">a = a ^ b;
b = b ^ a;
a = a ^ b;</pre><p>&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x6DF7;&#x6DC6;&#xFF0C;&#x628A;a&#x548C;b&#x7684;&#x521D;&#x503C;&#x5206;&#x522B;&#x8BB0;&#x4E3A;a<sub>0</sub>&#x548C;b<sub>0</sub>&#x3002;&#x7B2C;&#x4E00;&#x884C;&#xFF0C;<code class="literal">a = a<sub>0</sub> ^ b<sub>0</sub></code>&#xFF1B;&#x7B2C;&#x4E8C;&#x884C;&#xFF0C;&#x628A;a&#x7684;&#x65B0;&#x503C;&#x4EE3;&#x5165;&#xFF0C;&#x5F97;&#x5230;<code class="literal">b = b<sub>0</sub> ^ a<sub>0</sub> ^ b<sub>0</sub></code>&#xFF0C;&#x7B49;&#x53F7;&#x53F3;&#x8FB9;&#x7684;b<sub>0</sub>&#x76F8;&#x5F53;&#x4E8E;&#x4E0A;&#x9762;&#x516C;&#x5F0F;&#x4E2D;&#x7684;x&#xFF0C;a<sub>0</sub>&#x76F8;&#x5F53;&#x4E8E;y&#xFF0C;&#x6240;&#x4EE5;&#x7ED3;&#x679C;&#x4E3A;a<sub>0</sub>&#xFF1B;&#x7B2C;&#x4E09;&#x884C;&#xFF0C;&#x628A;a&#x548C;b&#x7684;&#x65B0;&#x503C;&#x4EE3;&#x5165;&#xFF0C;&#x5F97;&#x5230;<code class="literal">a = a<sub>0</sub> ^ b<sub>0</sub> ^ a<sub>0</sub></code>&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;b<sub>0</sub>&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E0D;&#x80FD;&#x628A;&#x540C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x81EA;&#x5DF1;&#x8DDF;&#x81EA;&#x5DF1;&#x4EA4;&#x6362;&#xFF0C;&#x800C;&#x5229;&#x7528;&#x4E2D;&#x95F4;&#x53D8;&#x91CF;<code class="literal">temp</code>&#x5219;&#x53EF;&#x4EE5;&#x4EA4;&#x6362;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a id="id2762311"></a>&#x4E60;&#x9898;</h4></div></div></div><p>1&#x3001;&#x8BF7;&#x5728;&#x7F51;&#x4E0A;&#x67E5;&#x627E;&#x6709;&#x5173;RAID&#xFF08;Redundant Array of Independent Disks&#xFF0C;&#x72EC;&#x7ACB;&#x78C1;&#x76D8;&#x5197;&#x4F59;&#x9635;&#x5217;&#xFF09;<a id="id2762322" class="indexterm"></a>&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x7406;&#x89E3;&#x5176;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5229;&#x7528;&#x4E86;&#x672C;&#x8282;&#x7684;&#x6027;&#x8D28;3&#x548C;4&#x3002;</p><p>2&#x3001;&#x4EA4;&#x6362;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x4E0D;&#x5F97;&#x501F;&#x52A9;&#x989D;&#x5916;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x9664;&#x4E86;&#x672C;&#x8282;&#x8BB2;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x5916;&#x4F60;&#x8FD8;&#x80FD;&#x60F3;&#x51FA;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF1F;&#x672C;&#x8282;&#x8BB2;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x80FD;&#x628A;&#x540C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x81EA;&#x5DF1;&#x8DDF;&#x81EA;&#x5DF1;&#x4EA4;&#x6362;&#xFF0C;&#x4F60;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5C40;&#x9650;&#x6027;&#xFF1F;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch16.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch16.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch16s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;16&#xA0;&#x7AE0;&#xA0;&#x8FD0;&#x7B97;&#x7B26;&#x8BE6;&#x89E3;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x5176;&#x5B83;&#x8FD0;&#x7B97;&#x7B26;</td></tr></tbody></table></div>
</body></html>