<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x8BBE;&#x5907;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch17.html" title="&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;"><link rel="prev" href="ch17s02.html" title="2.&#xA0;CPU"><link rel="next" href="ch17s04.html" title="4.&#xA0;MMU"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x8BBE;&#x5907;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch17s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch17s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2766608"></a>3.&#xA0;&#x8BBE;&#x5907;</h2></div></div></div><p>CPU&#x6267;&#x884C;&#x6307;&#x4EE4;&#x9664;&#x4E86;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E4B;&#x5916;&#x8FD8;&#x8981;&#x8BBF;&#x95EE;&#x5F88;&#x591A;&#x8BBE;&#x5907;&#xFF08;Device&#xFF09;<a id="id2766617" class="indexterm"></a>&#xFF0C;&#x5982;&#x952E;&#x76D8;&#x3001;&#x9F20;&#x6807;&#x3001;&#x786C;&#x76D8;&#x3001;&#x663E;&#x793A;&#x5668;&#x7B49;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x548C;CPU&#x4E4B;&#x95F4;&#x5982;&#x4F55;&#x8FDE;&#x63A5;&#x5462;&#xFF1F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2766627"></a><p class="title"><b>&#x56FE;&#xA0;17.4.&#xA0;&#x8BBE;&#x5907;</b></p><div class="figure-contents"><div><img src="images/arch.box.png" alt="&#x8BBE;&#x5907;"></div></div></div><br class="figure-break"><p>&#x6709;&#x4E9B;&#x8BBE;&#x5907;&#x50CF;&#x5185;&#x5B58;&#x82AF;&#x7247;&#x4E00;&#x6837;&#x8FDE;&#x63A5;&#x5230;&#x5904;&#x7406;&#x5668;&#x7684;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x548C;&#x6570;&#x636E;&#x603B;&#x7EBF;&#xFF0C;&#x6B63;&#x56E0;&#x4E3A;&#x5730;&#x5740;&#x7EBF;&#x548C;&#x6570;&#x636E;&#x7EBF;&#x4E0A;&#x53EF;&#x4EE5;&#x6302;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#x548C;&#x5185;&#x5B58;&#x82AF;&#x7247;&#x6240;&#x4EE5;&#x624D;&#x53EB;&#x201C;<span class="quote">&#x603B;&#x7EBF;</span>&#x201D;&#xFF0C;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x5907;&#x548C;&#x5185;&#x5B58;&#x82AF;&#x7247;&#x5E94;&#x8BE5;&#x5360;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x5740;&#x8303;&#x56F4;&#x3002;&#x8BBF;&#x95EE;&#x8FD9;&#x79CD;&#x8BBE;&#x5907;&#x5C31;&#x50CF;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E00;&#x6837;&#xFF0C;&#x6309;&#x5730;&#x5740;&#x8BFB;&#x5199;&#x5373;&#x53EF;&#xFF0C;&#x4F46;&#x548C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x5F80;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x5199;&#x6570;&#x636E;&#x53EA;&#x662F;&#x7ED9;&#x8BBE;&#x5907;&#x53D1;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#xFF0C;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x4FDD;&#x5B58;&#xFF0C;&#x800C;&#x4ECE;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x8BFB;&#x6570;&#x636E;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x8BFB;&#x5148;&#x524D;&#x4FDD;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x662F;&#x5F97;&#x5230;&#x8BBE;&#x5907;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x3002;&#x8BBE;&#x5907;&#x4E2D;&#x53EF;&#x4F9B;&#x8BFB;&#x5199;&#x8BBF;&#x95EE;&#x7684;&#x5355;&#x5143;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#xFF08;&#x6CE8;&#x610F;&#x548C;CPU&#x5BC4;&#x5B58;&#x5668;&#x4E0D;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF09;&#xFF0C;&#x64CD;&#x4F5C;&#x8BBE;&#x5907;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x8BFB;&#x5199;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;&#x5411;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x5BC4;&#x5B58;&#x5668;&#x91CC;&#x5199;&#x6570;&#x636E;&#xFF0C;&#x4E32;&#x53E3;&#x8BBE;&#x5907;&#x5C31;&#x4F1A;&#x628A;&#x6570;&#x636E;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF0C;&#x8BFB;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x4E32;&#x53E3;&#x8BBE;&#x5907;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x3002;</p><p>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8BBE;&#x5907;&#x96C6;&#x6210;&#x5728;&#x5904;&#x7406;&#x5668;&#x82AF;&#x7247;&#x4E2D;&#x3002;&#x5728;&#x4E0A;&#x56FE;&#x4E2D;&#xFF0C;&#x4ECE;CPU&#x6838;&#x5F15;&#x51FA;&#x7684;&#x5730;&#x5740;&#x548C;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x6709;&#x4E00;&#x7AEF;&#x7ECF;&#x603B;&#x7EBF;&#x63A5;&#x53E3;&#x5F15;&#x51FA;&#x5230;&#x82AF;&#x7247;&#x5F15;&#x811A;&#x4E0A;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x7AEF;&#x6CA1;&#x6709;&#x5F15;&#x51FA;&#xFF0C;&#x800C;&#x662F;&#x63A5;&#x5230;&#x82AF;&#x7247;&#x5185;&#x90E8;&#x96C6;&#x6210;&#x7684;&#x8BBE;&#x5907;&#x4E0A;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5728;CPU&#x5916;&#x90E8;&#x63A5;&#x603B;&#x7EBF;&#x7684;&#x8BBE;&#x5907;&#x8FD8;&#x662F;&#x5728;CPU&#x5185;&#x90E8;&#x63A5;&#x603B;&#x7EBF;&#x7684;&#x8BBE;&#x5907;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x5730;&#x5740;&#x8303;&#x56F4;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x50CF;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E00;&#x6837;&#x8BBF;&#x95EE;&#xFF0C;&#x5F88;&#x591A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF08;&#x6BD4;&#x5982;ARM&#xFF09;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x64CD;&#x4F5C;&#x8BBE;&#x5907;&#xFF0C;&#x79F0;&#x4E3A;&#x5185;&#x5B58;&#x6620;&#x5C04;I/O&#xFF08;Memory-mapped I/O&#xFF09;&#x3002;&#x4F46;&#x662F;x86&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#xFF0C;x86&#x5BF9;&#x4E8E;&#x8BBE;&#x5907;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;CPU&#x6838;&#x9700;&#x8981;&#x5F15;&#x51FA;&#x989D;&#x5916;&#x7684;&#x5730;&#x5740;&#x7EBF;&#x6765;&#x8FDE;&#x63A5;&#x7247;&#x5185;&#x8BBE;&#x5907;&#xFF08;&#x548C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x6240;&#x7528;&#x7684;&#x5730;&#x5740;&#x7EBF;&#x4E0D;&#x540C;&#xFF09;&#xFF0C;&#x8BBF;&#x95EE;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x65F6;&#x7528;&#x7279;&#x6B8A;&#x7684;<code class="literal">in</code>/<code class="literal">out</code>&#x6307;&#x4EE4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x548C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7528;&#x540C;&#x6837;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;&#x7AEF;&#x53E3;I/O&#xFF08;Port I/O&#xFF09;&#x3002;</p><p>&#x4ECE;CPU&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8BBF;&#x95EE;&#x8BBE;&#x5907;&#x53EA;&#x6709;&#x5185;&#x5B58;&#x6620;&#x5C04;I/O&#x548C;&#x7AEF;&#x53E3;I/O&#x4E24;&#x79CD;&#xFF0C;&#x8981;&#x4E48;&#x50CF;&#x5185;&#x5B58;&#x4E00;&#x6837;&#x8BBF;&#x95EE;&#xFF0C;&#x8981;&#x4E48;&#x7528;&#x4E00;&#x79CD;&#x4E13;&#x7528;&#x7684;&#x6307;&#x4EE4;&#x8BBF;&#x95EE;&#x3002;&#x5176;&#x5B9E;&#x8BBF;&#x95EE;&#x8BBE;&#x5907;&#x662F;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8BBE;&#x5907;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#xFF0C;&#x5404;&#x79CD;&#x8BBE;&#x5907;&#x7684;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6709;&#x7684;&#x8981;&#x6C42;&#x5E26;&#x5BBD;&#x5927;&#xFF0C;&#x6709;&#x7684;&#x8981;&#x6C42;&#x54CD;&#x5E94;&#x5FEB;&#xFF0C;&#x6709;&#x7684;&#x8981;&#x6C42;&#x70ED;&#x63D2;&#x62D4;&#xFF0C;&#x4E8E;&#x662F;&#x51FA;&#x73B0;&#x4E86;&#x5404;&#x79CD;&#x9002;&#x5E94;&#x4E0D;&#x540C;&#x8981;&#x6C42;&#x7684;&#x8BBE;&#x5907;&#x603B;&#x7EBF;&#xFF0C;&#x6BD4;&#x5982;PCI&#x3001;AGP&#x3001;USB&#x3001;1394&#x3001;SATA&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x603B;&#x7EBF;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x548C;CPU&#x76F8;&#x8FDE;&#xFF0C;CPU&#x901A;&#x8FC7;&#x5185;&#x5B58;&#x6620;&#x5C04;I/O&#x6216;&#x7AEF;&#x53E3;I/O&#x8BBF;&#x95EE;&#x76F8;&#x5E94;&#x7684;&#x603B;&#x7EBF;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x603B;&#x7EBF;&#x63A7;&#x5236;&#x5668;&#x518D;&#x53BB;&#x8BBF;&#x95EE;&#x6302;&#x5728;&#x603B;&#x7EBF;&#x4E0A;&#x7684;&#x8BBE;&#x5907;&#x3002;&#x6240;&#x4EE5;&#x4E0A;&#x56FE;&#x4E2D;&#x6807;&#x6709;&#x201C;<span class="quote">&#x8BBE;&#x5907;</span>&#x201D;&#x7684;&#x6846;&#x53EF;&#x80FD;&#x662F;&#x5B9E;&#x9645;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x8BBE;&#x5907;&#x603B;&#x7EBF;&#x7684;&#x63A7;&#x5236;&#x5668;&#x3002;</p><p>&#x5728;x86&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x786C;&#x76D8;&#x662F;&#x6302;&#x5728;IDE&#x3001;SATA&#x6216;SCSI&#x603B;&#x7EBF;&#x4E0A;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;&#x786C;&#x76D8;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x4E0D;&#x80FD;&#x88AB;CPU&#x76F4;&#x63A5;&#x53D6;&#x6307;&#x4EE4;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5728;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x65F6;&#x4F1A;&#x628A;&#x5B83;&#x4ECE;&#x786C;&#x76D8;&#x62F7;&#x8D1D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x6837;CPU&#x624D;&#x80FD;&#x53D6;&#x6307;&#x4EE4;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x52A0;&#x8F7D;&#xFF08;Load&#xFF09;<a id="id2765944" class="indexterm"></a>&#x3002;&#x7A0B;&#x5E8F;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x4E4B;&#x540E;&#xFF0C;&#x6210;&#x4E3A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x6267;&#x884C;&#x7684;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5C31;&#x79F0;&#x4E3A;&#x8FDB;&#x7A0B;&#xFF08;Process&#xFF09;<a id="id2765953" class="indexterm"></a>&#x3002;&#x8FDB;&#x7A0B;&#x548C;&#x7A0B;&#x5E8F;&#x4E0D;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x591A;&#x6B21;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x6210;&#x4E3A;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5F00;&#x591A;&#x4E2A;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#xFF0C;&#x6BCF;&#x4E2A;&#x7A97;&#x53E3;&#x90FD;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;Shell&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x78C1;&#x76D8;&#x4E0A;&#x7684;<code class="literal">/bin/bash</code>&#x6587;&#x4EF6;&#x3002;</p><p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;Operating System&#xFF09;<a id="id2765974" class="indexterm"></a>&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x4E00;&#x6BB5;&#x4FDD;&#x5B58;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x542F;&#x52A8;&#x65F6;&#x6267;&#x884C;&#x4E00;&#x6BB5;&#x56FA;&#x5B9A;&#x7684;&#x542F;&#x52A8;&#x4EE3;&#x7801;&#xFF08;&#x79F0;&#x4E3A;Bootloader&#xFF09;<a id="id2765983" class="indexterm"></a>&#x9996;&#x5148;&#x628A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4ECE;&#x78C1;&#x76D8;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x628A;&#x7528;&#x6237;&#x9700;&#x8981;&#x7684;&#x5176;&#x5B83;&#x7A0B;&#x5E8F;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x5176;&#x5B83;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF1A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x5E38;&#x9A7B;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x800C;&#x5176;&#x5B83;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x5219;&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x7528;&#x6237;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x54EA;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C31;&#x628A;&#x5B83;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x9700;&#x8981;&#x54EA;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C31;&#x628A;&#x5B83;&#x7EC8;&#x6B62;&#x6389;&#xFF0C;&#x91CA;&#x653E;&#x5B83;&#x6240;&#x5360;&#x7684;&#x5185;&#x5B58;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x529F;&#x80FD;&#x662F;&#x7BA1;&#x7406;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x3001;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#x4F7F;&#x7528;&#x548C;&#x7BA1;&#x7406;&#x5404;&#x79CD;&#x8BBE;&#x5907;&#xFF0C;&#x505A;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x7684;&#x7A0B;&#x5E8F;&#x79F0;&#x4E3A;&#x5185;&#x6838;&#xFF08;Kernel&#xFF09;<a id="id2766009" class="indexterm"></a>&#xFF0C;&#x5728;&#x6211;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x5185;&#x6838;&#x7A0B;&#x5E8F;&#x662F;<code class="literal">/boot/vmlinuz-2.6.28-13-generic</code>&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x542F;&#x52A8;&#x65F6;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x5E76;&#x5E38;&#x9A7B;&#x5185;&#x5B58;&#x3002;&#x5E7F;&#x4E49;&#x4E0A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6982;&#x5FF5;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#xFF0C;&#x6BD4;&#x5982;Shell&#x662F;&#x6BCF;&#x4E2A;Linux&#x7CFB;&#x7EDF;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x800C;Office&#x529E;&#x516C;&#x5957;&#x4EF6;&#x5219;&#x662F;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x524D;&#x8005;&#x4E5F;&#x5C5E;&#x4E8E;&#x5E7F;&#x4E49;&#x4E0A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x5C5E;&#x4E8E;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x3002;</p><p>&#x8BBF;&#x95EE;&#x8BBE;&#x5907;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x548C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E0D;&#x540C;&#x3002;&#x5185;&#x5B58;&#x53EA;&#x662F;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#x800C;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;CPU&#x4E0D;&#x53BB;&#x8BFB;&#x5B83;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x4E3B;&#x52A8;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x7ED9;CPU&#xFF0C;&#x6240;&#x4EE5;&#x5185;&#x5B58;&#x603B;&#x662F;&#x88AB;&#x52A8;&#x5730;&#x7B49;&#x5F85;&#x88AB;&#x8BFB;&#x6216;&#x8005;&#x88AB;&#x5199;&#x3002;&#x800C;&#x8BBE;&#x5907;&#x5F80;&#x5F80;&#x4F1A;&#x81EA;&#x5DF1;&#x4EA7;&#x751F;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x4E3B;&#x52A8;&#x901A;&#x77E5;CPU&#x6765;&#x8BFB;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x6572;&#x952E;&#x76D8;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x5B57;&#x7B26;&#xFF0C;&#x7528;&#x6237;&#x5E0C;&#x671B;&#x8BA1;&#x7B97;&#x673A;&#x9A6C;&#x4E0A;&#x54CD;&#x5E94;&#x81EA;&#x5DF1;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x952E;&#x76D8;&#x8BBE;&#x5907;&#x4E3B;&#x52A8;&#x901A;&#x77E5;CPU&#x6765;&#x8BFB;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x5E76;&#x505A;&#x76F8;&#x5E94;&#x5904;&#x7406;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x662F;&#x7531;&#x4E2D;&#x65AD;&#xFF08;Interrupt&#xFF09;<a id="id2766036" class="indexterm"></a>&#x673A;&#x5236;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BBE;&#x5907;&#x90FD;&#x6709;&#x4E00;&#x6761;&#x4E2D;&#x65AD;&#x7EBF;&#xFF0C;&#x901A;&#x8FC7;&#x4E2D;&#x65AD;&#x63A7;&#x5236;&#x5668;&#x8FDE;&#x63A5;&#x5230;CPU&#xFF0C;&#x5F53;&#x8BBE;&#x5907;&#x9700;&#x8981;&#x4E3B;&#x52A8;&#x901A;&#x77E5;CPU&#x65F6;&#x5C31;&#x5F15;&#x53D1;&#x4E00;&#x4E2A;&#x4E2D;&#x65AD;&#x4FE1;&#x53F7;&#xFF0C;CPU&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x5C06;&#x88AB;&#x6253;&#x65AD;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4F1A;&#x6307;&#x5411;&#x67D0;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x5730;&#x5740;&#xFF08;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7531;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5B9A;&#x4E49;&#xFF09;&#xFF0C;&#x4E8E;&#x662F;CPU&#x4ECE;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x5F00;&#x59CB;&#x53D6;&#x6307;&#x4EE4;&#xFF08;&#x6216;&#x8005;&#x8BF4;&#x8DF3;&#x8F6C;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#xFF09;&#xFF0C;&#x6267;&#x884C;&#x4E2D;&#x65AD;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#xFF08;ISR&#xFF0C;Interrupt Service Routine&#xFF09;<a id="id2766043" class="indexterm"></a>&#xFF0C;&#x5B8C;&#x6210;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x4E4B;&#x540E;&#x518D;&#x8FD4;&#x56DE;&#x5148;&#x524D;&#x88AB;&#x6253;&#x65AD;&#x7684;&#x5730;&#x65B9;&#x6267;&#x884C;&#x540E;&#x7EED;&#x6307;&#x4EE4;&#x3002;&#x6BD4;&#x5982;&#x67D0;&#x79CD;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x89C4;&#x5B9A;&#x53D1;&#x751F;&#x4E2D;&#x65AD;&#x65F6;&#x8DF3;&#x8F6C;&#x5230;&#x5730;&#x5740;0x00000010&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x4E8B;&#x5148;&#x628A;&#x4E00;&#x6BB5;ISR&#x7A0B;&#x5E8F;&#x52A0;&#x8F7D;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#xFF0C;ISR&#x7A0B;&#x5E8F;&#x662F;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5728;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#x9996;&#x5148;&#x5224;&#x65AD;&#x662F;&#x54EA;&#x4E2A;&#x8BBE;&#x5907;&#x5F15;&#x53D1;&#x4E86;&#x4E2D;&#x65AD;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x8BE5;&#x8BBE;&#x5907;&#x7684;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x51FD;&#x6570;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x3002;</p><p>&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x8BBE;&#x5907;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x6BCF;&#x79CD;&#x8BBE;&#x5907;&#x90FD;&#x9700;&#x8981;&#x4E13;&#x95E8;&#x7684;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF08;Device Driver&#xFF09;<a id="id2767035" class="indexterm"></a>&#xFF0C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x5E7F;&#x6CDB;&#x7684;&#x8BBE;&#x5907;&#x5C31;&#x9700;&#x8981;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;Linux&#x5185;&#x6838;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x662F;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x662F;&#x5185;&#x6838;&#x91CC;&#x7684;&#x4E00;&#x7EC4;&#x51FD;&#x6570;&#xFF0C;&#x901A;&#x8FC7;&#x8BFB;&#x5199;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x5B9E;&#x73B0;&#x5BF9;&#x8BBE;&#x5907;&#x7684;&#x521D;&#x59CB;&#x5316;&#x3001;&#x8BFB;&#x3001;&#x5199;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x6709;&#x4E9B;&#x8BBE;&#x5907;&#x8FD8;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x51FD;&#x6570;&#x4F9B;ISR&#x8C03;&#x7528;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch17s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch17.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch17s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;CPU&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;4.&#xA0;MMU</td></tr></tbody></table></div>
</body></html>