<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>5.&#xA0;Memory Hierarchy</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch17.html" title="&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;"><link rel="prev" href="ch17s04.html" title="4.&#xA0;MMU"><link rel="next" href="ch18.html" title="&#x7B2C;&#xA0;18&#xA0;&#x7AE0;&#xA0;x86&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">5.&#xA0;Memory Hierarchy</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch17s04.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch18.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2767397"></a>5.&#xA0;Memory Hierarchy</h2></div></div></div><p>&#x786C;&#x76D8;&#x3001;&#x5185;&#x5B58;&#x3001;CPU&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x8FD8;&#x6709;&#x672C;&#x8282;&#x8981;&#x8BB2;&#x7684;Cache&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x79CD;&#x5B58;&#x50A8;&#x5668;&#x5462;&#xFF1F;&#x8FD9;&#x4E9B;&#x5B58;&#x50A8;&#x5668;&#x5404;&#x81EA;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x70B9;&#xFF1F;&#x8FD9;&#x662F;&#x672C;&#x8282;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x95EE;&#x9898;&#x3002;</p><p>&#x7531;&#x4E8E;&#x786C;&#x4EF6;&#x6280;&#x672F;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5236;&#x9020;&#x51FA;&#x5BB9;&#x91CF;&#x5F88;&#x5C0F;&#x4F46;&#x5F88;&#x5FEB;&#x7684;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5236;&#x9020;&#x51FA;&#x5BB9;&#x91CF;&#x5F88;&#x5927;&#x4F46;&#x5F88;&#x6162;&#x7684;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x80FD;&#x4E24;&#x8FB9;&#x7684;&#x597D;&#x5904;&#x90FD;&#x5360;&#x7740;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x5236;&#x9020;&#x51FA;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x53C8;&#x5FEB;&#x5BB9;&#x91CF;&#x53C8;&#x5927;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x628A;&#x5B58;&#x50A8;&#x5668;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x7EA7;&#xFF0C;&#x79F0;&#x4E3A;Memory Hierarchy<a id="id2767425" class="indexterm"></a>&#xFF0C;&#x6309;&#x7167;&#x79BB;CPU&#x7531;&#x8FD1;&#x5230;&#x8FDC;&#x7684;&#x987A;&#x5E8F;&#x4F9D;&#x6B21;&#x662F;CPU&#x5BC4;&#x5B58;&#x5668;&#x3001;Cache&#x3001;&#x5185;&#x5B58;&#x3001;&#x786C;&#x76D8;&#xFF0C;&#x8D8A;&#x9760;&#x8FD1;CPU&#x7684;&#x5B58;&#x50A8;&#x5668;&#x5BB9;&#x91CF;&#x8D8A;&#x5C0F;&#x4F46;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x8D8A;&#x5FEB;&#xFF0C;&#x4E0B;&#x56FE;&#x7ED9;&#x51FA;&#x4E86;&#x5404;&#x79CD;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x5BB9;&#x91CF;&#x548C;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x7684;&#x5178;&#x578B;&#x503C;&#x3002;</p><div class="figure"><a id="id2767436"></a><p class="title"><b>&#x56FE;&#xA0;17.8.&#xA0;Memory Hierarchy</b></p><div class="figure-contents"><div><img src="images/arch.memhie.png" alt="Memory Hierarchy"></div></div></div><br class="figure-break"><div class="table"><a id="id2767450"></a><p class="title"><b>&#x8868;&#xA0;17.1.&#xA0;Memory Hierarchy</b></p><div class="table-contents"><table summary="Memory Hierarchy" border="1"><colgroup><col><col><col><col><col><col></colgroup><thead><tr><th>&#x5B58;&#x50A8;&#x5668;&#x7C7B;&#x578B;</th><th>&#x4F4D;&#x4E8E;&#x54EA;&#x91CC;</th><th>&#x5B58;&#x50A8;&#x5BB9;&#x91CF;</th><th>&#x534A;&#x5BFC;&#x4F53;&#x5DE5;&#x827A;</th><th>&#x8BBF;&#x95EE;&#x65F6;&#x95F4;</th><th>&#x5982;&#x4F55;&#x8BBF;&#x95EE;</th></tr></thead><tbody><tr><td>CPU&#x5BC4;&#x5B58;&#x5668;</td><td>&#x4F4D;&#x4E8E;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x4E2D;&#x3002;</td><td>CPU&#x5BC4;&#x5B58;&#x5668;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x51E0;&#x4E2A;&#x5230;&#x51E0;&#x5341;&#x4E2A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5BB9;&#x91CF;&#x53D6;&#x51B3;&#x4E8E;CPU&#x7684;&#x5B57;&#x957F;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5171;&#x53EA;&#x6709;&#x51E0;&#x5341;&#x5230;&#x51E0;&#x767E;&#x5B57;&#x8282;&#x3002;</td><td>&#x201C;<span class="quote">&#x5BC4;&#x5B58;&#x5668;</span>&#x201D;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5B83;&#x7531;&#x4E00;&#x7EC4;&#x89E6;&#x53D1;&#x5668;&#xFF08;Flip-flop&#xFF09;<a id="id2767501" class="indexterm"></a>&#x7EC4;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x89E6;&#x53D1;&#x5668;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;Bit&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5B58;&#x53D6;&#x548C;&#x79FB;&#x4F4D;&#x7B49;&#x64CD;&#x4F5C;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x6389;&#x7535;&#x65F6;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x4E22;&#x5931;&#x3002;</td><td>&#x5BC4;&#x5B58;&#x5668;&#x662F;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x6700;&#x5FEB;&#x7684;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x662F;&#x51E0;&#x7EB3;&#x79D2;&#x3002;</td><td>&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x7531;&#x6307;&#x4EE4;&#x51B3;&#x5B9A;&#x7684;&#x3002;</td></tr><tr><td>Cache<a id="id2767524" class="indexterm"></a></td><td>&#x548C;MMU&#x4E00;&#x6837;&#x4F4D;&#x4E8E;CPU&#x6838;&#x4E2D;&#x3002;</td><td>Cache&#x901A;&#x5E38;&#x5206;&#x4E3A;&#x51E0;&#x7EA7;&#xFF0C;&#x6700;&#x5178;&#x578B;&#x7684;&#x662F;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#x7684;&#x4E24;&#x7EA7;Cache&#xFF0C;&#x4E00;&#x7EA7;Cache&#x66F4;&#x9760;&#x8FD1;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#xFF0C;&#x4E8C;&#x7EA7;Cache&#x66F4;&#x9760;&#x8FD1;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x901A;&#x5E38;&#x4E00;&#x7EA7;Cache&#x6709;&#x51E0;&#x5341;&#x5230;&#x51E0;&#x767E;KB&#xFF0C;&#x4E8C;&#x7EA7;Cache&#x6709;&#x51E0;&#x767E;KB&#x5230;&#x51E0;MB&#x3002;</td><td>Cache&#x548C;&#x5185;&#x5B58;&#x90FD;&#x662F;&#x7531;RAM&#xFF08;Random Access Memory&#xFF09;<a id="id2767548" class="indexterm"></a>&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5730;&#x5740;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x6389;&#x7535;&#x65F6;RAM&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x4E22;&#x5931;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;Cache&#x901A;&#x5E38;&#x7531;SRAM&#xFF08;Static RAM&#xFF0C;&#x9759;&#x6001;RAM&#xFF09;<a id="id2767558" class="indexterm"></a>&#x7EC4;&#x6210;&#xFF0C;&#x800C;&#x5185;&#x5B58;&#x901A;&#x5E38;&#x7531;DRAM&#xFF08;Dynamic RAM&#xFF0C;&#x52A8;&#x6001;RAM&#xFF09;<a id="id2767566" class="indexterm"></a>&#x7EC4;&#x6210;&#x3002;DRAM&#x7535;&#x8DEF;&#x6BD4;SRAM&#x7B80;&#x5355;&#xFF0C;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x5927;&#xFF0C;&#x4F46;DRAM&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x6BD4;SRAM&#x6162;&#x3002;</td><td>&#x5178;&#x578B;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x662F;&#x51E0;&#x5341;&#x7EB3;&#x79D2;&#x3002;</td><td>Cache&#x7F13;&#x5B58;&#x6700;&#x8FD1;&#x8BBF;&#x95EE;&#x8FC7;&#x7684;&#x5185;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x7531;&#x4E8E;Cache&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x662F;&#x5185;&#x5B58;&#x7684;&#x51E0;&#x5341;&#x500D;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x6548;&#x5229;&#x7528;Cache&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x3002;&#x4E00;&#x7EA7;Cache&#x662F;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#xFF1A;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x8981;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x65F6;&#x9996;&#x5148;&#x53D1;&#x51FA;VA&#xFF0C;Cache&#x5229;&#x7528;VA&#x67E5;&#x627E;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x6709;&#x6CA1;&#x6709;&#x88AB;&#x7F13;&#x5B58;&#xFF0C;&#x5982;&#x679C;Cache&#x4E2D;&#x6709;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x8BFB;&#x64CD;&#x4F5C;&#x5C31;&#x76F4;&#x63A5;&#x5C06;Cache&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4F20;&#x7ED9;CPU&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5199;&#x64CD;&#x4F5C;&#x5C31;&#x76F4;&#x63A5;&#x6539;&#x5199;&#x5230;Cache&#x4E2D;&#xFF1B;&#x5982;&#x679C;Cache&#x6CA1;&#x6709;&#x7F13;&#x5B58;&#x8BE5;&#x6570;&#x636E;&#xFF0C;&#x5C31;&#x53BB;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x8981;&#x54EA;&#x4E2A;&#x5B57;&#x8282;&#x5C31;&#x53D6;&#x54EA;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x76F8;&#x90BB;&#x7684;&#x51E0;&#x5341;&#x4E2A;&#x5B57;&#x8282;&#x90FD;&#x53D6;&#x4E0A;&#x6765;&#x7F13;&#x5B58;&#x7740;&#xFF0C;&#x4EE5;&#x5907;&#x4E0B;&#x6B21;&#x7528;&#x5230;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;Cache Line<a id="id2767606" class="indexterm"></a>&#xFF0C;&#x5178;&#x578B;&#x7684;Cache Line&#x5927;&#x5C0F;&#x662F;32~256&#x5B57;&#x8282;&#x3002;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x673A;&#x8FD8;&#x914D;&#x7F6E;&#x4E86;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#xFF0C;&#x5219;&#x5728;&#x8BBF;&#x95EE;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E4B;&#x524D;&#x5148;&#x7528;PA&#x53BB;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#x4E2D;&#x67E5;&#x627E;&#x3002;&#x4E00;&#x7EA7;&#x7F13;&#x5B58;&#x662F;&#x7528;VA&#x5BFB;&#x5740;&#x7684;&#xFF0C;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#x662F;&#x7528;PA&#x5BFB;&#x5740;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x533A;&#x522B;&#x3002;Cache&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x7531;&#x786C;&#x4EF6;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x5BC4;&#x5B58;&#x5668;&#x4E00;&#x6837;&#x7531;&#x6307;&#x4EE4;&#x51B3;&#x5B9A;&#x5148;&#x505A;&#x4EC0;&#x4E48;&#x540E;&#x505A;&#x4EC0;&#x4E48;&#x3002;</td></tr><tr><td>&#x5185;&#x5B58;</td><td>&#x4F4D;&#x4E8E;CPU&#x5916;&#x7684;&#x82AF;&#x7247;&#xFF0C;&#x4E0E;CPU&#x901A;&#x8FC7;&#x5730;&#x5740;&#x548C;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x76F8;&#x8FDE;&#x3002;</td><td>&#x5178;&#x578B;&#x7684;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#x662F;&#x51E0;&#x767E;MB&#x5230;&#x51E0;GB&#x3002;</td><td>&#x7531;DRAM&#x7EC4;&#x6210;&#xFF0C;&#x8BE6;&#x89C1;&#x4E0A;&#x9762;&#x5173;&#x4E8E;Cache&#x7684;&#x8BF4;&#x660E;&#x3002;</td><td>&#x5178;&#x578B;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x662F;&#x51E0;&#x767E;&#x7EB3;&#x79D2;&#x3002;</td><td>&#x5185;&#x5B58;&#x662F;&#x901A;&#x8FC7;&#x5730;&#x5740;&#x6765;&#x8BBF;&#x95EE;&#x7684;&#xFF0C;&#x5728;&#x542F;&#x7528;MMU&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5730;&#x5740;&#x662F;VA&#xFF0C;&#x800C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7528;&#x7684;&#x662F;PA&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EF4;&#x62A4;&#x3002;</td></tr><tr><td>&#x786C;&#x76D8;</td><td>&#x4F4D;&#x4E8E;&#x8BBE;&#x5907;&#x603B;&#x7EBF;&#x4E0A;&#xFF0C;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x548C;CPU&#x76F8;&#x8FDE;&#xFF0C;CPU&#x901A;&#x8FC7;&#x8BBE;&#x5907;&#x603B;&#x7EBF;&#x7684;&#x63A7;&#x5236;&#x5668;&#x8BBF;&#x95EE;&#x786C;&#x76D8;&#x3002;</td><td>&#x5178;&#x578B;&#x7684;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#x662F;&#x51E0;&#x767E;GB&#x5230;&#x51E0;TB&#x3002;</td><td>&#x786C;&#x76D8;&#x7531;&#x78C1;&#x6027;&#x4ECB;&#x8D28;&#x548C;&#x78C1;&#x5934;&#x7EC4;&#x6210;&#xFF0C;&#x8BBF;&#x95EE;&#x786C;&#x76D8;&#x65F6;&#x5B58;&#x5728;&#x673A;&#x68B0;&#x8FD0;&#x52A8;&#xFF0C;&#x78C1;&#x5934;&#x8981;&#x79FB;&#x52A8;&#xFF0C;&#x78C1;&#x6027;&#x4ECB;&#x8D28;&#x8981;&#x65CB;&#x8F6C;&#xFF0C;&#x673A;&#x68B0;&#x8FD0;&#x52A8;&#x7684;&#x901F;&#x5EA6;&#x5F88;&#x96BE;&#x63D0;&#x9AD8;&#x5230;&#x7535;&#x5B50;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x5F88;&#x53D7;&#x9650;&#x5236;&#x3002;&#x4FDD;&#x5B58;&#x5728;&#x786C;&#x76D8;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x6389;&#x7535;&#x540E;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x3002;</td><td>&#x5178;&#x578B;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x662F;&#x51E0;&#x6BEB;&#x79D2;&#xFF0C;&#x662F;&#x5BC4;&#x5B58;&#x5668;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x7684;10<sup>6</sup>&#x500D;&#x3002;</td><td>&#x7531;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x64CD;&#x4F5C;&#x8BBE;&#x5907;&#x603B;&#x7EBF;&#x63A7;&#x5236;&#x5668;&#x53BB;&#x8BBF;&#x95EE;&#x3002;&#x7531;&#x4E8E;&#x786C;&#x76D8;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x4E00;&#x6B21;&#x4ECE;&#x786C;&#x76D8;&#x4E0A;&#x8BFB;&#x51E0;&#x4E2A;&#x9875;&#x9762;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x51E0;&#x4E2A;&#x9875;&#x9762;&#x540E;&#x6765;&#x90FD;&#x88AB;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x5230;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E00;&#x6B21;&#x8BFB;&#x786C;&#x76D8;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x53EF;&#x4EE5;&#x5206;&#x644A;&#xFF08;Amortize&#xFF09;<a id="id2767689" class="indexterm"></a>&#x7ED9;&#x7A0B;&#x5E8F;&#x7684;&#x591A;&#x6B21;&#x8BBF;&#x95EE;&#x4E86;&#x3002;</td></tr></tbody></table></div></div><br class="table-break"><p>&#x5BF9;&#x8FD9;&#x4E2A;&#x8868;&#x683C;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#x3002;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x5BC4;&#x5B58;&#x5668;&#x3001;Cache&#x548C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x6389;&#x7535;&#x4E22;&#x5931;&#x7684;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x6613;&#x5931;&#x6027;&#x5B58;&#x50A8;&#x5668;&#xFF08;Volatile Memory&#xFF09;<a id="id2767713" class="indexterm"></a>&#xFF0C;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#x7684;&#xFF0C;&#x786C;&#x76D8;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x6613;&#x5931;&#x6027;&#x5B58;&#x50A8;&#x5668;&#xFF08;Non-volatile Memory&#xFF09;<a id="id2767722" class="indexterm"></a>&#x3002;</p></li><li><p>&#x9664;&#x4E86;&#x8BBF;&#x95EE;&#x5BC4;&#x5B58;&#x5668;&#x7531;&#x7A0B;&#x5E8F;&#x6307;&#x4EE4;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x4E4B;&#x5916;&#xFF0C;&#x8BBF;&#x95EE;&#x5176;&#x5B83;&#x5B58;&#x50A8;&#x5668;&#x90FD;&#x4E0D;&#x662F;&#x7531;&#x6307;&#x4EE4;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x786C;&#x4EF6;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x914D;&#x5408;&#x786C;&#x4EF6;&#x5B8C;&#x6210;&#x7684;&#x3002;</p></li><li><p>Cache&#x4ECE;&#x5185;&#x5B58;&#x53D6;&#x6570;&#x636E;&#x65F6;&#x4F1A;&#x9884;&#x53D6;&#x4E00;&#x4E2A;Cache Line&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4ECE;&#x786C;&#x76D8;&#x8BFB;&#x6570;&#x636E;&#x65F6;&#x4F1A;&#x9884;&#x8BFB;&#x51E0;&#x4E2A;&#x9875;&#x9762;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x90FD;&#x662F;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4EE5;&#x540E;&#x4F1A;&#x88AB;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x5230;&#x3002;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#x90FD;&#x5177;&#x6709;&#x5C40;&#x90E8;&#x6027;&#xFF08;Locality&#xFF09;<a id="id2767749" class="indexterm"></a>&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x5B83;&#x4EEC;&#x4F1A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x53CD;&#x590D;&#x6267;&#x884C;&#x4E00;&#x5C0F;&#x6BB5;&#x4EE3;&#x7801;&#xFF08;&#x4F8B;&#x5982;&#x5FAA;&#x73AF;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x53CD;&#x590D;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x5730;&#x5740;&#x8303;&#x56F4;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF08;&#x4F8B;&#x5982;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x9884;&#x8BFB;&#x7F13;&#x5B58;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x5F88;&#x6709;&#x6548;&#x7684;&#xFF1A;CPU&#x53D6;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x6211;&#x628A;&#x548C;&#x5B83;&#x76F8;&#x90BB;&#x7684;&#x6307;&#x4EE4;&#x4E5F;&#x90FD;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;CPU&#x5F88;&#x53EF;&#x80FD;&#x9A6C;&#x4E0A;&#x5C31;&#x4F1A;&#x53D6;&#x5230;&#xFF1B;CPU&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x628A;&#x548C;&#x5B83;&#x76F8;&#x90BB;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x90FD;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;CPU&#x5F88;&#x53EF;&#x80FD;&#x9A6C;&#x4E0A;&#x5C31;&#x4F1A;&#x8BBF;&#x95EE;&#x5230;&#x3002;&#x8BBE;&#x60F3;&#x6709;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E00;&#x53F0;&#x6709;256KB&#x7684;Cache&#xFF0C;&#x53E6;&#x4E00;&#x53F0;&#x6CA1;&#x6709;Cache&#xFF0C;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x90FD;&#x662F;512MB&#x7684;&#xFF0C;&#x786C;&#x76D8;&#x90FD;&#x662F;100GB&#x7684;&#xFF0C;&#x867D;&#x7136;&#x591A;&#x51FA;&#x6765;256KB&#x7684;Cache&#x4E0E;&#x5185;&#x5B58;&#x3001;&#x786C;&#x76D8;&#x7684;&#x5BB9;&#x91CF;&#x76F8;&#x6BD4;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#xFF0C;&#x4F46;&#x8BBF;&#x95EE;Cache&#x6BD4;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x3001;&#x786C;&#x76D8;&#x5FEB;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x7531;&#x4E8E;&#x5C40;&#x90E8;&#x6027;&#x539F;&#x7406;&#xFF0C;CPU&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x662F;&#x5728;&#x548C;Cache&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x6709;Cache&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x660E;&#x663E;&#x4F1A;&#x5FEB;&#x5F88;&#x591A;&#x3002;&#x9AD8;&#x901F;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x5BB9;&#x91CF;&#x53EA;&#x80FD;&#x505A;&#x5F97;&#x5F88;&#x5C0F;&#xFF0C;&#x5374;&#x80FD;&#x663E;&#x8457;&#x63D0;&#x5347;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;Memory Hierarchy&#x7684;&#x610F;&#x4E49;&#x6240;&#x5728;&#x3002;</p></li></ul></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch17s04.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch17.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch18.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">4.&#xA0;MMU&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;18&#xA0;&#x7AE0;&#xA0;x86&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;</td></tr></tbody></table></div>
</body></html>