<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;MMU</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch17.html" title="&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;"><link rel="prev" href="ch17s03.html" title="3.&#xA0;&#x8BBE;&#x5907;"><link rel="next" href="ch17s05.html" title="5.&#xA0;Memory Hierarchy"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;MMU</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch17s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch17s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2767055"></a>4.&#xA0;MMU</h2></div></div></div><p>&#x73B0;&#x4EE3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x666E;&#x904D;&#x91C7;&#x7528;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF08;Virtual Memory Management&#xFF09;<a id="id2767066" class="indexterm"></a>&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x7684;MMU&#xFF08;Memory Management Unit&#xFF0C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5355;&#x5143;&#xFF09;<a id="id2767076" class="indexterm"></a>&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF0C;&#x672C;&#x8282;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;MMU&#x7684;&#x4F5C;&#x7528;&#x3002;</p><p>&#x9996;&#x5148;&#x5F15;&#x5165;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x548C;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;&#x5982;&#x679C;&#x5904;&#x7406;&#x5668;&#x6CA1;&#x6709;MMU&#xFF0C;&#x6216;&#x8005;&#x6709;MMU&#x4F46;&#x6CA1;&#x6709;&#x542F;&#x7528;&#xFF0C;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x53D1;&#x51FA;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x5C06;&#x76F4;&#x63A5;&#x4F20;&#x5230;&#x82AF;&#x7247;&#x5F15;&#x811A;&#x4E0A;&#xFF0C;&#x88AB;&#x5185;&#x5B58;&#x82AF;&#x7247;&#xFF08;&#x4EE5;&#x4E0B;&#x79F0;&#x4E3A;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E0E;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x533A;&#x5206;&#xFF09;&#x63A5;&#x6536;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF08;Physical Address&#xFF0C;&#x4EE5;&#x4E0B;&#x7B80;&#x79F0;PA&#xFF09;<a id="id2767100" class="indexterm"></a>&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2767109"></a><p class="title"><b>&#x56FE;&#xA0;17.5.&#xA0;&#x7269;&#x7406;&#x5730;&#x5740;</b></p><div class="figure-contents"><div><img src="images/arch.pabox.png" alt="&#x7269;&#x7406;&#x5730;&#x5740;"></div></div></div><br class="figure-break"><p>&#x5982;&#x679C;&#x5904;&#x7406;&#x5668;&#x542F;&#x7528;&#x4E86;MMU&#xFF0C;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x53D1;&#x51FA;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x5C06;&#x88AB;MMU&#x622A;&#x83B7;&#xFF0C;&#x4ECE;CPU&#x5230;MMU&#x7684;&#x5730;&#x5740;&#x79F0;&#x4E3A;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF08;Virtual Address&#xFF0C;&#x4EE5;&#x4E0B;&#x7B80;&#x79F0;VA&#xFF09;<a id="id2767128" class="indexterm"></a>&#xFF0C;&#x800C;MMU&#x5C06;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x53D1;&#x5230;CPU&#x82AF;&#x7247;&#x7684;&#x5916;&#x90E8;&#x5730;&#x5740;&#x5F15;&#x811A;&#x4E0A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5C06;VA&#x6620;&#x5C04;&#x6210;PA&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2767139"></a><p class="title"><b>&#x56FE;&#xA0;17.6.&#xA0;&#x865A;&#x62DF;&#x5730;&#x5740;</b></p><div class="figure-contents"><div><img src="images/arch.vabox.png" alt="&#x865A;&#x62DF;&#x5730;&#x5740;"></div></div></div><br class="figure-break"><p>&#x5982;&#x679C;&#x662F;32&#x4F4D;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5219;&#x5185;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x662F;32&#x4F4D;&#x7684;&#xFF0C;&#x4E0E;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x76F8;&#x8FDE;&#xFF08;&#x56FE;&#x4E2D;&#x53EA;&#x662F;&#x793A;&#x610F;&#x6027;&#x5730;&#x753B;&#x4E86;4&#x6761;&#x5730;&#x5740;&#x7EBF;&#xFF09;&#xFF0C;&#x800C;&#x7ECF;&#x8FC7;MMU&#x8F6C;&#x6362;&#x4E4B;&#x540E;&#x7684;&#x5916;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x5219;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;32&#x4F4D;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x548C;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;32&#x4F4D;&#x5904;&#x7406;&#x5668;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;4GB&#xFF0C;&#x800C;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x65E2;&#x53EF;&#x4EE5;&#x5927;&#x4E8E;&#x4E5F;&#x53EF;&#x4EE5;&#x5C0F;&#x4E8E;4GB&#x3002;</p><p>MMU&#x5C06;VA&#x6620;&#x5C04;&#x5230;PA&#x662F;&#x4EE5;&#x9875;&#xFF08;Page&#xFF09;<a id="id2767172" class="indexterm"></a>&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#xFF0C;32&#x4F4D;&#x5904;&#x7406;&#x5668;&#x7684;&#x9875;&#x5C3A;&#x5BF8;&#x901A;&#x5E38;&#x662F;4KB&#x3002;&#x4F8B;&#x5982;&#xFF0C;MMU&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6620;&#x5C04;&#x9879;&#x5C06;VA&#x7684;&#x4E00;&#x9875;0xb7001000~0xb7001fff&#x6620;&#x5C04;&#x5230;PA&#x7684;&#x4E00;&#x9875;0x2000~0x2fff&#xFF0C;&#x5982;&#x679C;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x8981;&#x8BBF;&#x95EE;&#x865A;&#x62DF;&#x5730;&#x5740;0xb7001008&#xFF0C;&#x5219;&#x5B9E;&#x9645;&#x8BBF;&#x95EE;&#x5230;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x662F;0x2008&#x3002;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x9875;&#x79F0;&#x4E3A;&#x7269;&#x7406;&#x9875;&#x9762;&#x6216;&#x8005;&#x9875;&#x5E27;&#xFF08;Page Frame&#xFF09;<a id="id2767190" class="indexterm"></a>&#x3002;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x54EA;&#x4E2A;&#x9875;&#x9762;&#x6620;&#x5C04;&#x5230;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x54EA;&#x4E2A;&#x9875;&#x5E27;&#x662F;&#x901A;&#x8FC7;&#x9875;&#x8868;&#xFF08;Page Table&#xFF09;<a id="id2767199" class="indexterm"></a>&#x6765;&#x63CF;&#x8FF0;&#x7684;&#xFF0C;&#x9875;&#x8868;&#x4FDD;&#x5B58;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;MMU&#x4F1A;&#x67E5;&#x627E;&#x9875;&#x8868;&#x6765;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;VA&#x5E94;&#x8BE5;&#x6620;&#x5C04;&#x5230;&#x4EC0;&#x4E48;PA&#x3002;</p><p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;MMU&#x662F;&#x8FD9;&#x6837;&#x914D;&#x5408;&#x7684;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5728;&#x521D;&#x59CB;&#x5316;&#x6216;&#x5206;&#x914D;&#x3001;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x65F6;&#x4F1A;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x6307;&#x4EE4;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x586B;&#x5199;&#x9875;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6307;&#x4EE4;&#x8BBE;&#x7F6E;MMU&#xFF0C;&#x544A;&#x8BC9;MMU&#x9875;&#x8868;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x4EC0;&#x4E48;&#x4F4D;&#x7F6E;&#x3002;</p></li><li><p>&#x8BBE;&#x7F6E;&#x597D;&#x4E4B;&#x540E;&#xFF0C;CPU&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x6307;&#x4EE4;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x5F15;&#x53D1;MMU&#x505A;&#x67E5;&#x8868;&#x548C;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x64CD;&#x4F5C;&#xFF0C;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x64CD;&#x4F5C;&#x7531;&#x786C;&#x4EF6;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7528;&#x6307;&#x4EE4;&#x63A7;&#x5236;MMU&#x53BB;&#x505A;&#x3002;</p></li></ol></div><p>&#x6211;&#x4EEC;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x7A0B;&#x5E8F;&#x88AB;&#x7F16;&#x8BD1;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#x5C31;&#x6210;&#x4E86;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5730;&#x5740;&#x88AB;CPU&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x6210;&#x4E86;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x53D1;&#x51FA;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x542F;&#x7528;MMU&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5730;&#x5740;&#x90FD;&#x662F;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x90FD;&#x4F1A;&#x5F15;&#x53D1;MMU&#x505A;&#x67E5;&#x8868;&#x548C;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x64CD;&#x4F5C;&#x3002;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8BBE;&#x8BA1;&#x8FD9;&#x4E48;&#x590D;&#x6742;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x5462;&#xFF1F;&#x591A;&#x4E86;&#x4E00;&#x5C42;VA&#x5230;PA&#x7684;&#x8F6C;&#x6362;&#x5230;&#x5E95;&#x6362;&#x6765;&#x4E86;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF1F;All problems in computer science can be solved by another level of indirection.&#x8FD8;&#x8BB0;&#x5F97;&#x8FD9;&#x53E5;&#x8BDD;&#x5417;&#xFF1F;&#x591A;&#x4E86;&#x4E00;&#x5C42;&#x95F4;&#x63A5;&#x5FC5;&#x7136;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x7B49;&#x8BB2;&#x5B8C;&#x4E86;&#x5FC5;&#x8981;&#x7684;&#x9884;&#x5907;&#x77E5;&#x8BC6;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x5728;<a class="xref" href="ch20s05.html#link.vm">&#x7B2C;&#xA0;5&#xA0;&#x8282; &#x201C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x201D;</a>&#x8BA8;&#x8BBA;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x7684;&#x4F5C;&#x7528;&#x3002;</p><p>MMU&#x9664;&#x4E86;&#x505A;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x63D0;&#x4F9B;&#x5185;&#x5B58;&#x4FDD;&#x62A4;&#x673A;&#x5236;&#x3002;&#x5404;&#x79CD;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x90FD;&#x6709;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#xFF08;User Mode&#xFF09;<a id="id2767273" class="indexterm"></a>&#x548C;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#xFF08;Privileged Mode&#xFF09;<a id="id2767280" class="indexterm"></a>&#x4E4B;&#x5206;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5728;&#x9875;&#x8868;&#x4E2D;&#x8BBE;&#x7F6E;&#x6BCF;&#x4E2A;&#x5185;&#x5B58;&#x9875;&#x9762;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x6709;&#x4E9B;&#x9875;&#x9762;&#x4E0D;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#xFF0C;&#x6709;&#x4E9B;&#x9875;&#x9762;&#x53EA;&#x6709;&#x5728;CPU&#x5904;&#x4E8E;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#x65F6;&#x624D;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#xFF0C;&#x6709;&#x4E9B;&#x9875;&#x9762;&#x5728;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x548C;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x53C8;&#x5206;&#x4E3A;&#x53EF;&#x8BFB;&#x3001;&#x53EF;&#x5199;&#x548C;&#x53EF;&#x6267;&#x884C;&#x4E09;&#x79CD;&#x3002;&#x8FD9;&#x6837;&#x8BBE;&#x5B9A;&#x597D;&#x4E4B;&#x540E;&#xFF0C;&#x5F53;CPU&#x8981;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;VA&#x65F6;&#xFF0C;MMU&#x4F1A;&#x68C0;&#x67E5;CPU&#x5F53;&#x524D;&#x5904;&#x4E8E;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x8FD8;&#x662F;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#xFF0C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8BFB;&#x6570;&#x636E;&#x3001;&#x5199;&#x6570;&#x636E;&#x8FD8;&#x662F;&#x53D6;&#x6307;&#x4EE4;&#xFF0C;&#x5982;&#x679C;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BBE;&#x5B9A;&#x7684;&#x9875;&#x9762;&#x6743;&#x9650;&#x76F8;&#x7B26;&#xFF0C;&#x5C31;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#xFF0C;&#x628A;&#x5B83;&#x8F6C;&#x6362;&#x6210;PA&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#xFF0C;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#xFF08;Exception&#xFF09;<a id="id2767307" class="indexterm"></a>&#x3002;&#x5F02;&#x5E38;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x548C;&#x4E2D;&#x65AD;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x4E2D;&#x65AD;&#x7531;&#x5916;&#x90E8;&#x8BBE;&#x5907;&#x4EA7;&#x751F;&#x800C;&#x5F02;&#x5E38;&#x7531;CPU&#x5185;&#x90E8;&#x4EA7;&#x751F;&#xFF0C;&#x4E2D;&#x65AD;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x548C;CPU&#x5F53;&#x524D;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x65E0;&#x5173;&#xFF0C;&#x800C;&#x5F02;&#x5E38;&#x7684;&#x4EA7;&#x751F;&#x5C31;&#x662F;&#x7531;&#x4E8E;CPU&#x5F53;&#x524D;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x6307;&#x4EE4;&#x88AB;MMU&#x68C0;&#x67E5;&#x51FA;&#x6743;&#x9650;&#x9519;&#x8BEF;&#xFF0C;&#x9664;&#x6CD5;&#x6307;&#x4EE4;&#x7684;&#x9664;&#x6570;&#x4E3A;0&#x7B49;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x5F02;&#x5E38;&#x3002;</p><div class="figure"><a id="id2767327"></a><p class="title"><b>&#x56FE;&#xA0;17.7.&#xA0;&#x5904;&#x7406;&#x5668;&#x6A21;&#x5F0F;</b></p><div class="figure-contents"><div><img src="images/arch.cpumode.png" alt="&#x5904;&#x7406;&#x5668;&#x6A21;&#x5F0F;"></div></div></div><br class="figure-break"><p>&#x901A;&#x5E38;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x628A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5212;&#x5206;&#x4E3A;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x548C;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#xFF0C;&#x4F8B;&#x5982;x86&#x5E73;&#x53F0;&#x7684;Linux&#x7CFB;&#x7EDF;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;0x00000000~0xffffffff&#xFF0C;&#x524D;3GB&#xFF08;0x00000000~0xbfffffff&#xFF09;&#x662F;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF0C;&#x540E;1GB&#xFF08;0xc0000000~0xffffffff&#xFF09;&#x662F;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x3002;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x52A0;&#x8F7D;&#x5230;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x4E0B;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x8DF3;&#x8F6C;&#x5230;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x4E2D;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4FDD;&#x62A4;&#x5185;&#x6838;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x4E86;&#x975E;&#x6CD5;&#x5730;&#x5740;&#xFF0C;&#x9876;&#x591A;&#x8FD9;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5D29;&#x6E83;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5185;&#x6838;&#x548C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;CPU&#x5728;&#x4EA7;&#x751F;&#x4E2D;&#x65AD;&#x6216;&#x5F02;&#x5E38;&#x65F6;&#x4E0D;&#x4EC5;&#x4F1A;&#x8DF3;&#x8F6C;&#x5230;&#x4E2D;&#x65AD;&#x6216;&#x5F02;&#x5E38;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD8;&#x4F1A;&#x81EA;&#x52A8;&#x5207;&#x6362;&#x6A21;&#x5F0F;&#xFF0C;&#x4ECE;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x5207;&#x6362;&#x5230;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x4ECE;&#x4E2D;&#x65AD;&#x6216;&#x5F02;&#x5E38;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8DF3;&#x8F6C;&#x5230;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x4E2D;&#x6267;&#x884C;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6574;&#x4E2A;&#x5185;&#x6838;&#x5C31;&#x662F;&#x7531;&#x5404;&#x79CD;&#x4E2D;&#x65AD;&#x548C;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF1A;&#x5728;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x5904;&#x7406;&#x5668;&#x5728;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x6267;&#x884C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#xFF0C;&#x5728;&#x4E2D;&#x65AD;&#x6216;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x5904;&#x7406;&#x5668;&#x5207;&#x6362;&#x5230;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#x6267;&#x884C;&#x5185;&#x6838;&#x7A0B;&#x5E8F;&#xFF0C;&#x5904;&#x7406;&#x5B8C;&#x4E2D;&#x65AD;&#x6216;&#x5F02;&#x5E38;&#x4E4B;&#x540E;&#x518D;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x3002;</p><p>&#x6BB5;&#x9519;&#x8BEF;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x9047;&#x5230;&#x8FC7;&#x5F88;&#x591A;&#x6B21;&#x4E86;&#xFF0C;&#x5B83;&#x662F;&#x8FD9;&#x6837;&#x4EA7;&#x751F;&#x7684;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x4E00;&#x4E2A;VA&#xFF0C;&#x7ECF;MMU&#x68C0;&#x67E5;&#x65E0;&#x6743;&#x8BBF;&#x95EE;&#x3002;</p></li><li><p>MMU&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#xFF0C;CPU&#x4ECE;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x5207;&#x6362;&#x5230;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#xFF0C;&#x8DF3;&#x8F6C;&#x5230;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x4E2D;&#x6267;&#x884C;&#x5F02;&#x5E38;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x3002;</p></li><li><p>&#x5185;&#x6838;&#x628A;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x89E3;&#x91CA;&#x4E3A;&#x6BB5;&#x9519;&#x8BEF;&#xFF0C;&#x628A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x7684;&#x8FDB;&#x7A0B;&#x7EC8;&#x6B62;&#x6389;&#x3002;</p></li></ol></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch17s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch17.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch17s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;&#x8BBE;&#x5907;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;5.&#xA0;Memory Hierarchy</td></tr></tbody></table></div>
</body></html>