<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>2.&#xA0;CPU</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch17.html" title="&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;"><link rel="prev" href="ch17s01.html" title="1.&#xA0;&#x5185;&#x5B58;&#x4E0E;&#x5730;&#x5740;"><link rel="next" href="ch17s03.html" title="3.&#xA0;&#x8BBE;&#x5907;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">2.&#xA0;CPU</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch17s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;17&#xA0;&#x7AE0;&#xA0;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x57FA;&#x7840;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch17s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2766148"></a>2.&#xA0;CPU</h2></div></div></div><p>CPU&#x603B;&#x662F;&#x5468;&#x800C;&#x590D;&#x59CB;&#x5730;&#x505A;&#x540C;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;&#x4ECE;&#x5185;&#x5B58;&#x53D6;&#x6307;&#x4EE4;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53D6;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x518D;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x3002;CPU&#x6700;&#x6838;&#x5FC3;&#x7684;&#x529F;&#x80FD;&#x5355;&#x5143;&#x5305;&#x62EC;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x5BC4;&#x5B58;&#x5668;&#xFF08;Register&#xFF09;<a id="id2766167" class="indexterm"></a>&#xFF0C;&#x662F;CPU&#x5185;&#x90E8;&#x7684;&#x9AD8;&#x901F;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x50CF;&#x5185;&#x5B58;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x5B58;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x6BD4;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x5FEB;&#x5F97;&#x591A;&#x3002;&#x968F;&#x540E;&#x7684;&#x51E0;&#x7AE0;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;x86&#x7684;&#x5BC4;&#x5B58;&#x5668;<code class="literal">eax</code>&#x3001;<code class="literal">esp</code>&#x3001;<code class="literal">eip</code>&#x7B49;&#x7B49;&#xFF0C;&#x6709;&#x4E9B;&#x5BC4;&#x5B58;&#x5668;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x67D0;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x6BD4;&#x5982;<code class="literal">eip</code>&#x7528;&#x4F5C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x7279;&#x6B8A;&#x5BC4;&#x5B58;&#x5668;&#xFF08;Special-purpose Register&#xFF09;<a id="id2766202" class="indexterm"></a>&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x5BC4;&#x5B58;&#x5668;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x5404;&#x79CD;&#x8FD0;&#x7B97;&#x548C;&#x8BFB;&#x5199;&#x5185;&#x5B58;&#x7684;&#x6307;&#x4EE4;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#xFF08;General-purpose Register&#xFF09;<a id="id2766217" class="indexterm"></a>&#x3002;</p></li><li><p>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF08;PC&#xFF0C;Program Counter&#xFF09;<a id="id2766230" class="indexterm"></a>&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4FDD;&#x5B58;&#x7740;CPU&#x53D6;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#xFF0C;CPU&#x6309;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4FDD;&#x5B58;&#x7684;&#x5730;&#x5740;&#x53BB;&#x5185;&#x5B58;&#x4E2D;&#x53D6;&#x6307;&#x4EE4;&#x7136;&#x540E;&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x65F6;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4FDD;&#x5B58;&#x7684;&#x5730;&#x5740;&#x4F1A;&#x81EA;&#x52A8;&#x52A0;&#x4E0A;&#x8BE5;&#x6307;&#x4EE4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x6307;&#x5411;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x3002;</p></li><li><p>&#x6307;&#x4EE4;&#x8BD1;&#x7801;&#x5668;&#xFF08;Instruction Decoder&#xFF09;<a id="id2766246" class="indexterm"></a>&#x3002;CPU&#x53D6;&#x4E0A;&#x6765;&#x7684;&#x6307;&#x4EE4;&#x7531;&#x82E5;&#x5E72;&#x4E2A;&#x5B57;&#x8282;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B57;&#x8282;&#x4E2D;&#x6709;&#x4E9B;&#x4F4D;&#x8868;&#x793A;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x6709;&#x4E9B;&#x4F4D;&#x8868;&#x793A;&#x5BC4;&#x5B58;&#x5668;&#x7F16;&#x53F7;&#xFF0C;&#x6709;&#x4E9B;&#x4F4D;&#x8868;&#x793A;&#x8FD9;&#x79CD;&#x6307;&#x4EE4;&#x505A;&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#xFF0C;&#x662F;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x8FD8;&#x662F;&#x8BFB;&#x5199;&#x5185;&#x5B58;&#xFF0C;&#x6307;&#x4EE4;&#x8BD1;&#x7801;&#x5668;&#x8D1F;&#x8D23;&#x89E3;&#x91CA;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x52A8;&#x76F8;&#x5E94;&#x7684;&#x6267;&#x884C;&#x5355;&#x5143;&#x53BB;&#x6267;&#x884C;&#x5B83;&#x3002;</p></li><li><p>&#x7B97;&#x672F;&#x903B;&#x8F91;&#x5355;&#x5143;&#xFF08;ALU&#xFF0C;Arithmetic and Logic Unit&#xFF09;&#x3002;&#x5982;&#x679C;&#x8BD1;&#x7801;&#x5668;&#x5C06;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x89E3;&#x91CA;&#x4E3A;&#x8FD0;&#x7B97;&#x6307;&#x4EE4;&#xFF0C;&#x5C31;&#x8C03;&#x52A8;&#x7B97;&#x672F;&#x903B;&#x8F91;&#x5355;&#x5143;&#x53BB;&#x505A;&#x8FD0;&#x7B97;&#xFF0C;&#x6BD4;&#x5982;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x3001;&#x4F4D;&#x8FD0;&#x7B97;&#x3001;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x3002;&#x6307;&#x4EE4;&#x4E2D;&#x4F1A;&#x6307;&#x793A;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x4FDD;&#x5B58;&#x5230;&#x54EA;&#x91CC;&#xFF0C;&#x53EF;&#x80FD;&#x4FDD;&#x5B58;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4FDD;&#x5B58;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p></li><li><p>&#x5730;&#x5740;&#x548C;&#x6570;&#x636E;&#x603B;&#x7EBF;&#xFF08;Bus&#xFF09;<a id="id2766284" class="indexterm"></a>&#x3002;CPU&#x548C;&#x5185;&#x5B58;&#x4E4B;&#x95F4;&#x7528;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x3001;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x548C;&#x63A7;&#x5236;&#x7EBF;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x4E0A;&#x6709;1&#x548C;0&#x4E24;&#x79CD;&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x5728;&#x6267;&#x884C;&#x6307;&#x4EE4;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF0C;&#x6BD4;&#x5982;&#x4ECE;&#x5185;&#x5B58;&#x8BFB;&#x4E00;&#x4E2A;&#x6570;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x60F3;&#x50CF;&#x6210;&#x8FD9;&#x6837;&#xFF1A;</p><div class="figure"><a id="id2766295"></a><p class="title"><b>&#x56FE;&#xA0;17.2.&#xA0;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x8BFB;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/arch.readmem.png" alt="&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x8BFB;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><div class="orderedlist"><ol type="1"><li><p>CPU&#x5185;&#x90E8;&#x5C06;&#x5BC4;&#x5B58;&#x5668;&#x5BF9;&#x63A5;&#x5230;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x4E0A;&#xFF0C;&#x4F7F;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x6BCF;&#x4E00;&#x4F4D;&#x5BF9;&#x63A5;&#x5230;&#x4E00;&#x6761;&#x6570;&#x636E;&#x7EBF;&#xFF0C;&#x7B49;&#x5F85;&#x63A5;&#x6536;&#x6570;&#x636E;&#x3002;</p></li><li><p>CPU&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x7EBF;&#x53D1;&#x4E00;&#x4E2A;&#x8BFB;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x5185;&#x5B58;&#x5730;&#x5740;&#x901A;&#x8FC7;&#x5730;&#x5740;&#x7EBF;&#x53D1;&#x7ED9;&#x5185;&#x5B58;&#x3002;</p></li><li><p>&#x5185;&#x5B58;&#x6536;&#x5230;&#x5730;&#x5740;&#x548C;&#x8BFB;&#x8BF7;&#x6C42;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#x5BF9;&#x63A5;&#x5230;&#x6570;&#x636E;&#x603B;&#x7EBF;&#x7684;&#x53E6;&#x4E00;&#x7AEF;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5185;&#x5B58;&#x5355;&#x5143;&#x6BCF;&#x4E00;&#x4F4D;&#x7684;1&#x6216;0&#x72B6;&#x6001;&#x901A;&#x8FC7;&#x4E00;&#x6761;&#x6570;&#x636E;&#x7EBF;&#x5230;&#x8FBE;CPU&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#xFF0C;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x6570;&#x636E;&#x4F20;&#x9001;&#x3002;</p></li></ol></div><p>&#x5F80;&#x5185;&#x5B58;&#x91CC;&#x5199;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;&#x4E0E;&#x6B64;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x6570;&#x636E;&#x7EBF;&#x4E0A;&#x7684;&#x4F20;&#x8F93;&#x65B9;&#x5411;&#x76F8;&#x53CD;&#x3002;</p></li></ul></div><p>&#x4E0A;&#x56FE;&#x4E2D;&#x753B;&#x4E86;32&#x6761;&#x5730;&#x5740;&#x7EBF;&#x548C;32&#x6761;&#x6570;&#x636E;&#x7EBF;&#xFF0C;CPU&#x5BC4;&#x5B58;&#x5668;&#x4E5F;&#x662F;32&#x4F4D;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x8FD9;&#x79CD;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x662F;32&#x4F4D;&#x7684;&#xFF0C;&#x6BD4;&#x5982;x86&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x5904;&#x7406;&#x5668;&#x662F;32&#x4F4D;&#x6216;64&#x4F4D;&#x7684;&#x3002;&#x5730;&#x5740;&#x7EBF;&#x3001;&#x6570;&#x636E;&#x7EBF;&#x548C;CPU&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4F4D;&#x6570;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4ECE;&#x4E0A;&#x56FE;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6570;&#x636E;&#x7EBF;&#x548C;CPU&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4F4D;&#x6570;&#x5E94;&#x8BE5;&#x4E00;&#x81F4;&#xFF0C;&#x53E6;&#x5916;&#x6709;&#x4E9B;&#x5BC4;&#x5B58;&#x5668;&#xFF08;&#x6BD4;&#x5982;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF09;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x56E0;&#x800C;&#x5730;&#x5740;&#x7EBF;&#x548C;CPU&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4F4D;&#x6570;&#x4E5F;&#x5E94;&#x8BE5;&#x4E00;&#x81F4;&#x3002;&#x5904;&#x7406;&#x5668;&#x7684;&#x4F4D;&#x6570;&#x4E5F;&#x79F0;&#x4E3A;&#x5B57;&#x957F;&#xFF0C;&#x5B57;&#xFF08;Word&#xFF09;<a id="id2766367" class="indexterm"></a>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x7528;&#x5F97;&#x6BD4;&#x8F83;&#x6DF7;&#x4E71;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x6307;16&#x4F4D;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x6307;32&#x4F4D;&#xFF08;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;16&#x4F4D;&#x88AB;&#x79F0;&#x4E3A;&#x534A;&#x5B57;Half Word<a id="id2766376" class="indexterm"></a>&#xFF09;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x6307;&#x5904;&#x7406;&#x5668;&#x7684;&#x5B57;&#x957F;&#xFF0C;&#x5982;&#x679C;&#x5904;&#x7406;&#x5668;&#x662F;32&#x4F4D;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x5B57;&#x5C31;&#x662F;32&#x4F4D;&#xFF0C;&#x5982;&#x679C;&#x5904;&#x7406;&#x5668;&#x662F;64&#x4F4D;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x5B57;&#x5C31;&#x662F;64&#x4F4D;&#x3002;32&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x6709;32&#x6761;&#x5730;&#x5740;&#x7EBF;&#xFF0C;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF08;Address Space&#xFF09;<a id="id2766387" class="indexterm"></a>&#x4ECE;0x00000000&#x5230;0xffffffff&#xFF0C;&#x5171;4GB&#xFF0C;&#x800C;64&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x6709;&#x66F4;&#x5927;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;</p><p>&#x6700;&#x540E;&#x8FD8;&#x8981;&#x8BF4;&#x660E;&#x4E00;&#x70B9;&#xFF0C;&#x672C;&#x8282;&#x6240;&#x8BF4;&#x7684;&#x5730;&#x5740;&#x7EBF;&#x3001;&#x6570;&#x636E;&#x7EBF;&#x662F;&#x6307;CPU&#x7684;&#x5185;&#x603B;&#x7EBF;&#xFF0C;&#x662F;&#x76F4;&#x63A5;&#x548C;CPU&#x7684;&#x6267;&#x884C;&#x5355;&#x5143;&#x76F8;&#x8FDE;&#x7684;&#xFF0C;&#x5185;&#x603B;&#x7EBF;&#x7ECF;&#x8FC7;MMU&#x548C;&#x603B;&#x7EBF;&#x63A5;&#x53E3;&#x7684;&#x8F6C;&#x6362;&#x4E4B;&#x540E;&#x5F15;&#x51FA;&#x5230;&#x82AF;&#x7247;&#x5F15;&#x811A;&#x624D;&#x662F;&#x5916;&#x603B;&#x7EBF;&#xFF0C;&#x5916;&#x5730;&#x5740;&#x7EBF;&#x548C;&#x5916;&#x6570;&#x636E;&#x7EBF;&#x7684;&#x4F4D;&#x6570;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x548C;&#x5185;&#x603B;&#x7EBF;&#x4E0D;&#x540C;&#xFF0C;&#x4F8B;&#x5982;32&#x4F4D;&#x5904;&#x7406;&#x5668;&#x7684;&#x5916;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x53EF;&#x5BFB;&#x5740;&#x7684;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x5927;&#x4E8E;4GB&#xFF0C;&#x5230;<a class="xref" href="ch17s04.html#arch.mmu">&#x7B2C;&#xA0;4&#xA0;&#x8282; &#x201C;MMU&#x201D;</a>&#x518D;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x3002;</p><p>&#x6211;&#x4EEC;&#x7ED3;&#x5408;<a class="xref" href="intro.program.html#intro.instruction">&#x8868;&#xA0;1.1 &#x201C;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x4E09;&#x79CD;&#x8868;&#x793A;&#x201D;</a>&#x770B;&#x4E00;&#x4E0B;CPU&#x53D6;&#x6307;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p><div class="figure"><a id="id2766429"></a><p class="title"><b>&#x56FE;&#xA0;17.3.&#xA0;CPU&#x7684;&#x53D6;&#x6307;&#x6267;&#x884C;&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/arch.von.png" alt="CPU&#x7684;&#x53D6;&#x6307;&#x6267;&#x884C;&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><div class="orderedlist"><ol type="1"><li><p><code class="literal"><code class="literal">eip</code>&#x5BC4;&#x5B58;&#x5668;&#x6307;&#x5411;&#x5730;&#x5740;0x80483a2&#xFF0C;CPU&#x4ECE;&#x8FD9;&#x91CC;&#x5F00;&#x59CB;&#x53D6;&#x4E00;&#x6761;5&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x7136;&#x540E;<code class="literal">eip</code>&#x5BC4;&#x5B58;&#x5668;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;0x80483a7&#x3002;</code></p></li><li><p>CPU&#x5BF9;&#x8FD9;5&#x4E2A;&#x5B57;&#x8282;&#x8BD1;&#x7801;&#xFF0C;&#x5F97;&#x77E5;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x8981;&#x6C42;&#x4ECE;&#x5730;&#x5740;0x804a01c&#x5F00;&#x59CB;&#x53D6;4&#x4E2A;&#x5B57;&#x8282;&#x4FDD;&#x5B58;&#x5230;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x3002;</p></li><li><p>&#x6267;&#x884C;&#x6307;&#x4EE4;&#xFF0C;&#x8BFB;&#x5185;&#x5B58;&#xFF0C;&#x53D6;&#x4E0A;&#x6765;&#x7684;&#x6570;&#x662F;3&#xFF0C;&#x4FDD;&#x5B58;&#x5230;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5730;&#x5740;0x804a01c~0x804a01f&#x91CC;&#x5B58;&#x50A8;&#x7684;&#x56DB;&#x4E2A;&#x5B57;&#x8282;&#x4E0D;&#x80FD;&#x6309;&#x5730;&#x5740;&#x4ECE;&#x4F4E;&#x5230;&#x9AD8;&#x7684;&#x987A;&#x5E8F;&#x770B;&#x6210;0x03000000&#xFF0C;&#x800C;&#x8981;&#x6309;&#x5730;&#x5740;&#x4ECE;&#x9AD8;&#x5230;&#x4F4E;&#x7684;&#x987A;&#x5E8F;&#x770B;&#x6210;0x00000003&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x591A;&#x5B57;&#x8282;&#x7684;&#x6574;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x4F4E;&#x5730;&#x5740;&#x4FDD;&#x5B58;&#x7684;&#x662F;&#x6574;&#x6570;&#x7684;&#x4F4E;&#x4F4D;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x5C0F;&#x7AEF;&#xFF08;Little Endian&#xFF09;<a id="id2766497" class="indexterm"></a>&#x5B57;&#x8282;&#x5E8F;&#xFF08;Byte Order&#xFF09;<a id="id2766505" class="indexterm"></a>&#x3002;x86&#x5E73;&#x53F0;&#x662F;&#x5C0F;&#x7AEF;&#x5B57;&#x8282;&#x5E8F;&#x7684;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x5E73;&#x53F0;&#x89C4;&#x5B9A;&#x4F4E;&#x5730;&#x5740;&#x4FDD;&#x5B58;&#x6574;&#x6570;&#x7684;&#x9AD8;&#x4F4D;&#xFF0C;&#x79F0;&#x4E3A;&#x5927;&#x7AEF;&#xFF08;Big Endian&#xFF09;<a id="id2766514" class="indexterm"></a>&#x5B57;&#x8282;&#x5E8F;&#x3002;</p></li><li><p>CPU&#x4ECE;<code class="literal">eip</code>&#x5BC4;&#x5B58;&#x5668;&#x6307;&#x5411;&#x7684;&#x5730;&#x5740;&#x53D6;&#x4E00;&#x6761;3&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x7136;&#x540E;<code class="literal">eip</code>&#x5BC4;&#x5B58;&#x5668;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;0x80483aa&#x3002;</p></li><li><p>CPU&#x5BF9;&#x8FD9;3&#x4E2A;&#x5B57;&#x8282;&#x8BD1;&#x7801;&#xFF0C;&#x5F97;&#x77E5;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x8981;&#x6C42;&#x628A;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x52A0;1&#xFF0C;&#x7ED3;&#x679C;&#x4ECD;&#x4FDD;&#x5B58;&#x5230;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x3002;</p></li><li><p>&#x6267;&#x884C;&#x6307;&#x4EE4;&#xFF0C;&#x73B0;&#x5728;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x6570;&#x662F;4&#x3002;</p></li><li><p>CPU&#x4ECE;<code class="literal">eip</code>&#x5BC4;&#x5B58;&#x5668;&#x6307;&#x5411;&#x7684;&#x5730;&#x5740;&#x53D6;&#x4E00;&#x6761;5&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x7136;&#x540E;<code class="literal">eip</code>&#x5BC4;&#x5B58;&#x5668;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;0x80483af&#x3002;</p></li><li><p>CPU&#x5BF9;&#x8FD9;5&#x4E2A;&#x5B57;&#x8282;&#x8BD1;&#x7801;&#xFF0C;&#x5F97;&#x77E5;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x8981;&#x6C42;&#x628A;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x4FDD;&#x5B58;&#x5230;&#x4ECE;&#x5730;&#x5740;0x804a018&#x5F00;&#x59CB;&#x7684;4&#x4E2A;&#x5B57;&#x8282;&#x3002;</p></li><li><p>&#x6267;&#x884C;&#x6307;&#x4EE4;&#xFF0C;&#x628A;4&#x8FD9;&#x4E2A;&#x503C;&#x4FDD;&#x5B58;&#x5230;&#x4ECE;&#x5730;&#x5740;0x804a018&#x5F00;&#x59CB;&#x7684;4&#x4E2A;&#x5B57;&#x8282;&#xFF08;&#x6309;&#x5C0F;&#x7AEF;&#x5B57;&#x8282;&#x5E8F;&#x4FDD;&#x5B58;&#xFF09;&#x3002;</p></li></ol></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch17s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch17.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch17s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">1.&#xA0;&#x5185;&#x5B58;&#x4E0E;&#x5730;&#x5740;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;3.&#xA0;&#x8BBE;&#x5907;</td></tr></tbody></table></div>
</body></html>