<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch18.html" title="&#x7B2C;&#xA0;18&#xA0;&#x7AE0;&#xA0;x86&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;"><link rel="prev" href="ch18.html" title="&#x7B2C;&#xA0;18&#xA0;&#x7AE0;&#xA0;x86&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;"><link rel="next" href="ch18s02.html" title="2.&#xA0;x86&#x7684;&#x5BC4;&#x5B58;&#x5668;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch18.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;18&#xA0;&#x7AE0;&#xA0;x86&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch18s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2769131"></a>1.&#xA0;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;</h2></div></div></div><div class="example"><a id="id2769136"></a><p class="title"><b>&#x4F8B;&#xA0;18.1.&#xA0;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;</b></p><div class="example-contents"><pre class="programlisting">#PURPOSE: Simple program that exits and returns a
#	  status code back to the Linux kernel
#
#INPUT:   none
#
#OUTPUT:  returns a status code. This can be viewed
#	  by typing
#
#	  echo $?
#
#	  after running the program
#
#VARIABLES:
#	  %eax holds the system call number
#	  %ebx holds the return status
#
 .section .data

 .section .text
 .globl _start
_start:
 movl $1, %eax	# this is the linux kernel command
		# number (system call) for exiting
		# a program

 movl $4, %ebx	# this is the status number we will
		# return to the operating system.
		# Change this around and it will
		# return different things to
		# echo $?

 int $0x80	# this wakes up the kernel to run
		# the exit command</pre></div></div><br class="example-break"><p>&#x628A;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4FDD;&#x5B58;&#x6210;&#x6587;&#x4EF6;<code class="literal">hello.s</code>&#xFF08;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x4EE5;<code class="literal">.s</code>&#x4F5C;&#x4E3A;&#x6587;&#x4EF6;&#x540D;&#x540E;&#x7F00;&#xFF09;&#xFF0C;&#x7528;&#x6C47;&#x7F16;&#x5668;&#xFF08;Assembler&#xFF09;<a id="id2769149" class="indexterm"></a><code class="literal">as</code>&#x628A;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x52A9;&#x8BB0;&#x7B26;&#x7FFB;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x6307;&#x4EE4;&#xFF0C;&#x751F;&#x6210;&#x76EE;&#x6807;&#x6587;&#x4EF6;<code class="literal">hello.o</code>&#xFF1A;</p><pre class="screen">$ as hello.s -o hello.o</pre><p>&#x7136;&#x540E;&#x7528;&#x94FE;&#x63A5;&#x5668;&#xFF08;Linker&#xFF0C;&#x6216;Link Editor&#xFF09;<a id="id2769187" class="indexterm"></a><code class="literal">ld</code>&#x628A;&#x76EE;&#x6807;&#x6587;&#x4EF6;<code class="literal">hello.o</code>&#x94FE;&#x63A5;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;<code class="literal">hello</code>&#xFF1A;</p><pre class="screen">$ ld hello.o -o hello</pre><p>&#x4E3A;&#x4EC0;&#x4E48;&#x7528;&#x6C47;&#x7F16;&#x5668;&#x7FFB;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x4E86;&#x8FD8;&#x4E0D;&#x884C;&#xFF0C;&#x8FD8;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x7684;&#x6B65;&#x9AA4;&#x5462;&#xFF1F;&#x94FE;&#x63A5;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x4E2A;&#x4F5C;&#x7528;&#xFF0C;&#x4E00;&#x662F;&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5BF9;&#x5730;&#x5740;&#x505A;&#x91CD;&#x5B9A;&#x4F4D;&#xFF0C;&#x5728;<a class="xref" href="ch18s05.html#asm.executable">&#x7B2C;&#xA0;5.2&#xA0;&#x8282; &#x201C;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x201D;</a>&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#xFF0C;&#x4E8C;&#x662F;&#x628A;&#x591A;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x5728;<a class="xref" href="ch19s02.html#asmc.main">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;<code class="literal">main</code>&#x51FD;&#x6570;&#x548C;&#x542F;&#x52A8;&#x4F8B;&#x7A0B;&#x201D;</a>&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x867D;&#x7136;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x4E5F;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x94FE;&#x63A5;&#x624D;&#x80FD;&#x6210;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;</p><p>&#x73B0;&#x5728;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x53EA;&#x505A;&#x4E86;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x9000;&#x51FA;&#xFF0C;&#x9000;&#x51FA;&#x72B6;&#x6001;&#x662F;4&#xFF0C;<a class="xref" href="ch03s02.html#func.ourfirstfunc">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x201D;</a>&#x8BB2;&#x8FC7;&#x5728;Shell&#x4E2D;&#x53EF;&#x4EE5;&#x7528;&#x7279;&#x6B8A;&#x53D8;&#x91CF;<code class="literal">$?</code>&#x5F97;&#x5230;&#x4E0A;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x7684;&#x9000;&#x51FA;&#x72B6;&#x6001;&#xFF1A;</p><pre class="screen">$ ./hello
$ echo $?
4</pre><p>&#x6240;&#x4EE5;&#x8FD9;&#x6BB5;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x76F8;&#x5F53;&#x4E8E;&#x5728;C&#x7A0B;&#x5E8F;&#x7684;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;<code class="literal">return 4;</code>&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x76F8;&#x5F53;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5728;<a class="xref" href="ch19s02.html#asmc.main">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;<code class="literal">main</code>&#x51FD;&#x6570;&#x548C;&#x542F;&#x52A8;&#x4F8B;&#x7A0B;&#x201D;</a>&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x3002;</p><p>&#x4E0B;&#x9762;&#x9010;&#x884C;&#x5206;&#x6790;&#x8FD9;&#x4E2A;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x3002;&#x9996;&#x5148;&#xFF0C;<code class="literal">#</code>&#x53F7;&#x8868;&#x793A;&#x5355;&#x884C;&#x6CE8;&#x91CA;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;C&#x8BED;&#x8A00;&#x7684;<code class="literal">//</code>&#x6CE8;&#x91CA;&#x3002;</p><pre class="programlisting"> .section .data</pre><p>&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x4E2D;&#x4EE5;<code class="literal">.</code>&#x5F00;&#x5934;&#x7684;&#x540D;&#x79F0;&#x5E76;&#x4E0D;&#x662F;&#x6307;&#x4EE4;&#x7684;&#x52A9;&#x8BB0;&#x7B26;&#xFF0C;&#x4E0D;&#x4F1A;&#x88AB;&#x7FFB;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x6307;&#x4EE4;&#xFF0C;&#x800C;&#x662F;&#x7ED9;&#x6C47;&#x7F16;&#x5668;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x6307;&#x793A;&#xFF0C;&#x79F0;&#x4E3A;&#x6C47;&#x7F16;&#x6307;&#x793A;&#xFF08;Assembler Directive&#xFF09;<a id="id2769314" class="indexterm"></a>&#x6216;&#x4F2A;&#x64CD;&#x4F5C;&#xFF08;Pseudo-operation&#xFF09;<a id="id2769324" class="indexterm"></a>&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x6307;&#x4EE4;&#x6240;&#x4EE5;&#x52A0;&#x4E2A;&#x201C;<span class="quote">&#x4F2A;</span>&#x201D;&#x5B57;&#x3002;<code class="literal">.section</code>&#x6307;&#x793A;&#x628A;&#x4EE3;&#x7801;&#x5212;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x6BB5;&#xFF08;Section&#xFF09;<a id="id2769345" class="indexterm"></a>&#xFF0C;&#x7A0B;&#x5E8F;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x52A0;&#x8F7D;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x6BB5;&#x88AB;&#x52A0;&#x8F7D;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x9875;&#x9762;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x8BFB;&#x3001;&#x5199;&#x3001;&#x6267;&#x884C;&#x6743;&#x9650;&#x3002;<code class="literal">.data</code>&#x6BB5;&#x4FDD;&#x5B58;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x662F;&#x53EF;&#x8BFB;&#x53EF;&#x5199;&#x7684;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;C&#x7A0B;&#x5E8F;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;&#x672C;&#x7A0B;&#x5E8F;&#x4E2D;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;<code class="literal">.data</code>&#x6BB5;&#x662F;&#x7A7A;&#x7684;&#x3002;</p><pre class="programlisting"> .section .text</pre><p><code class="literal">.text</code>&#x6BB5;&#x4FDD;&#x5B58;&#x4EE3;&#x7801;&#xFF0C;&#x662F;&#x53EA;&#x8BFB;&#x548C;&#x53EF;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x90A3;&#x4E9B;&#x6307;&#x4EE4;&#x90FD;&#x5C5E;&#x4E8E;<code class="literal">.text</code>&#x6BB5;&#x3002;</p><pre class="programlisting"> .globl _start</pre><p><code class="literal">_start</code>&#x662F;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#xFF08;Symbol&#xFF09;<a id="id2769400" class="indexterm"></a>&#xFF0C;&#x7B26;&#x53F7;&#x5728;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x4E2D;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x6307;&#x4EE4;&#x4E2D;&#xFF0C;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x7ECF;&#x8FC7;&#x6C47;&#x7F16;&#x5668;&#x7684;&#x5904;&#x7406;&#x4E4B;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7B26;&#x53F7;&#x90FD;&#x88AB;&#x66FF;&#x6362;&#x6210;&#x5B83;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x5730;&#x5740;&#x503C;&#x3002;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x53D8;&#x91CF;&#x540D;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8BFB;&#x5199;&#x67D0;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x51FD;&#x6570;&#x540D;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8DF3;&#x8F6C;&#x5230;&#x8BE5;&#x51FD;&#x6570;&#x7B2C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x6240;&#x5728;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;&#x53D8;&#x91CF;&#x540D;&#x548C;&#x51FD;&#x6570;&#x540D;&#x90FD;&#x662F;&#x7B26;&#x53F7;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4EE3;&#x8868;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x3002;</p><p><code class="literal">.globl</code>&#x6307;&#x793A;&#x544A;&#x8BC9;&#x6C47;&#x7F16;&#x5668;&#xFF0C;<code class="literal">_start</code>&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#x8981;&#x88AB;&#x94FE;&#x63A5;&#x5668;&#x7528;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x5728;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x7684;&#x7B26;&#x53F7;&#x8868;&#x4E2D;&#x6807;&#x8BB0;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7B26;&#x53F7;&#xFF08;&#x5728;<a class="xref" href="ch18s05.html#asm.relocatable">&#x7B2C;&#xA0;5.1&#xA0;&#x8282; &#x201C;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x201D;</a>&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#xFF09;&#x3002;<code class="literal">_start</code>&#x5C31;&#x50CF;C&#x7A0B;&#x5E8F;&#x7684;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E00;&#x6837;&#x7279;&#x6B8A;&#xFF0C;&#x662F;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x94FE;&#x63A5;&#x5668;&#x5728;&#x94FE;&#x63A5;&#x65F6;&#x4F1A;&#x67E5;&#x627E;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x4E2D;&#x7684;<code class="literal">_start</code>&#x7B26;&#x53F7;&#x4EE3;&#x8868;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x628A;&#x5B83;&#x8BBE;&#x7F6E;&#x4E3A;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x5165;&#x53E3;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E2A;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x90FD;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;<code class="literal">_start</code>&#x7B26;&#x53F7;&#x5E76;&#x4E14;&#x7528;<code class="literal">.globl</code>&#x58F0;&#x660E;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x6CA1;&#x6709;&#x7528;<code class="literal">.globl</code>&#x58F0;&#x660E;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#x4E0D;&#x4F1A;&#x88AB;&#x94FE;&#x63A5;&#x5668;&#x7528;&#x5230;&#x3002;</p><pre class="programlisting">_start:</pre><p>&#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x4E86;<code class="literal">_start</code>&#x7B26;&#x53F7;&#xFF0C;&#x6C47;&#x7F16;&#x5668;&#x5728;&#x7FFB;&#x8BD1;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x65F6;&#x4F1A;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x548C;&#x6BCF;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5F53;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x5B9A;&#x4E49;&#x65F6;&#xFF0C;&#x5C31;&#x628A;&#x5B83;&#x540E;&#x9762;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x5730;&#x5740;&#x3002;&#x800C;<code class="literal">_start</code>&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#x53C8;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#xFF0C;&#x5B83;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x5730;&#x5740;&#x662F;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x5165;&#x53E3;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;<code class="literal">movl $1, %eax</code>&#x5C31;&#x6210;&#x4E86;&#x7A0B;&#x5E8F;&#x4E2D;&#x7B2C;&#x4E00;&#x6761;&#x88AB;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x3002;</p><pre class="programlisting"> movl $1, %eax</pre><p>&#x8FD9;&#x662F;&#x4E00;&#x6761;&#x6570;&#x636E;&#x4F20;&#x9001;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x8981;&#x6C42;CPU&#x5185;&#x90E8;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;1&#x5E76;&#x4FDD;&#x5B58;&#x5230;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x3002;<code class="literal">mov</code>&#x7684;&#x540E;&#x7F00;l&#x8868;&#x793A;long&#xFF0C;&#x8BF4;&#x660E;&#x662F;32&#x4F4D;&#x7684;&#x4F20;&#x9001;&#x6307;&#x4EE4;&#x3002;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x4E0D;&#x8981;&#x6C42;CPU&#x8BFB;&#x5185;&#x5B58;&#xFF0C;1&#x8FD9;&#x4E2A;&#x6570;&#x662F;&#x5728;CPU&#x5185;&#x90E8;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x79F0;&#x4E3A;&#x7ACB;&#x5373;&#x6570;&#xFF08;Immediate&#xFF09;<a id="id2769538" class="indexterm"></a>&#x3002;&#x5728;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x7ACB;&#x5373;&#x6570;&#x524D;&#x9762;&#x8981;&#x52A0;$&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x540D;&#x524D;&#x9762;&#x8981;&#x52A0;%&#xFF0C;&#x4EE5;&#x4FBF;&#x8DDF;&#x7B26;&#x53F7;&#x540D;&#x533A;&#x5206;&#x5F00;&#x3002;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;<code class="literal">mov</code>&#x6307;&#x4EE4;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x51E0;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x4F20;&#x9001;&#x65B9;&#x5411;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x603B;&#x662F;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x603B;&#x662F;&#x76EE;&#x6807;&#x64CD;&#x4F5C;&#x6570;&#x3002;</p><pre class="programlisting"> movl $4, %ebx</pre><p>&#x548C;&#x4E0A;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7C7B;&#x4F3C;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7ACB;&#x5373;&#x6570;4&#x5E76;&#x4FDD;&#x5B58;&#x5230;<code class="literal">ebx</code>&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x3002;</p><pre class="programlisting"> int $0x80</pre><p>&#x524D;&#x4E24;&#x6761;&#x6307;&#x4EE4;&#x90FD;&#x662F;&#x4E3A;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x505A;&#x51C6;&#x5907;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x65F6;&#x53D1;&#x751F;&#x4EE5;&#x4E0B;&#x52A8;&#x4F5C;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p><code class="literal">int</code>&#x6307;&#x4EE4;&#x79F0;&#x4E3A;&#x8F6F;&#x4E2D;&#x65AD;&#x6307;&#x4EE4;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x6545;&#x610F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#xFF0C;&#x4E0A;&#x4E00;&#x7AE0;&#x8BB2;&#x8FC7;&#xFF0C;&#x5F02;&#x5E38;&#x7684;&#x5904;&#x7406;&#x548C;&#x4E2D;&#x65AD;&#x7C7B;&#x4F3C;&#xFF0C;CPU&#x4ECE;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x5207;&#x6362;&#x5230;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x8DF3;&#x8F6C;&#x5230;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x4E2D;&#x6267;&#x884C;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p></li><li><p><code class="literal">int</code>&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x7ACB;&#x5373;&#x6570;0x80&#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E2D;&#x8981;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF0C;&#x5728;Linux&#x5185;&#x6838;&#x4E2D;<code class="literal">int $0x80</code>&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x79F0;&#x4E3A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF08;System Call&#xFF09;<a id="id2769615" class="indexterm"></a>&#x3002;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x4F9B;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x4E0D;&#x80FD;&#x50CF;&#x5E93;&#x51FD;&#x6570;&#xFF08;&#x6BD4;&#x5982;<code class="literal">printf</code>&#xFF09;&#x90A3;&#x6837;&#x8C03;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6267;&#x884C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x65F6;CPU&#x5904;&#x4E8E;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5185;&#x6838;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5207;&#x6362;CPU&#x6A21;&#x5F0F;&#xFF0C;&#x7ECF;&#x7531;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x8FDB;&#x5165;&#x5185;&#x6838;&#xFF0C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5BC4;&#x5B58;&#x5668;&#x4F20;&#x51E0;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x8981;&#x6309;&#x5185;&#x6838;&#x8BBE;&#x8BA1;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x8DEF;&#x7EBF;&#x8D70;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x7531;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x968F;&#x5FC3;&#x6240;&#x6B32;&#xFF0C;&#x60F3;&#x8C03;&#x54EA;&#x4E2A;&#x5185;&#x6838;&#x51FD;&#x6570;&#x5C31;&#x8C03;&#x54EA;&#x4E2A;&#x5185;&#x6838;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x88AB;&#x5B89;&#x5168;&#x5730;&#x8C03;&#x7528;&#x3002;&#x5728;&#x8C03;&#x7528;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;CPU&#x518D;&#x5207;&#x6362;&#x56DE;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#xFF0C;&#x7EE7;&#x7EED;&#x6267;&#x884C;<code class="literal">int $0x80</code>&#x7684;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x770B;&#x6765;&#x5C31;&#x50CF;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x548C;&#x8FD4;&#x56DE;&#x4E00;&#x6837;&#x3002;</p></li><li><p><code class="literal">eax</code>&#x548C;<code class="literal">ebx</code>&#x7684;&#x503C;&#x662F;&#x4F20;&#x9012;&#x7ED9;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;<code class="literal">eax</code>&#x7684;&#x503C;&#x662F;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x53F7;&#xFF0C;Linux&#x7684;&#x5404;&#x79CD;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x90FD;&#x662F;&#x7531;<code class="literal">int $0x80</code>&#x6307;&#x4EE4;&#x5F15;&#x53D1;&#x7684;&#xFF0C;&#x5185;&#x6838;&#x9700;&#x8981;&#x901A;&#x8FC7;<code class="literal">eax</code>&#x5224;&#x65AD;&#x7528;&#x6237;&#x8981;&#x8C03;&#x54EA;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;<code class="literal">_exit</code>&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x53F7;&#x662F;1&#x3002;<code class="literal">ebx</code>&#x7684;&#x503C;&#x662F;&#x4F20;&#x7ED9;<code class="literal">_exit</code>&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x9000;&#x51FA;&#x72B6;&#x6001;&#x3002;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x4F1A;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x540E;&#x9762;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x800C;<code class="literal">_exit</code>&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#xFF0C;&#x5B83;&#x4F1A;&#x7EC8;&#x6B62;&#x6389;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</p></li></ol></div><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">x86&#x6C47;&#x7F16;&#x7684;&#x4E24;&#x79CD;&#x8BED;&#x6CD5;&#xFF1A;intel&#x8BED;&#x6CD5;&#x548C;AT&amp;T&#x8BED;&#x6CD5;</h3><p>x86&#x6C47;&#x7F16;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x5728;intel&#x7684;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x4E2D;&#x4F7F;&#x7528;intel&#x8BED;&#x6CD5;&#xFF0C;Windows&#x4E5F;&#x4F7F;&#x7528;intel&#x8BED;&#x6CD5;&#xFF0C;&#x800C;UNIX&#x5E73;&#x53F0;&#x7684;&#x6C47;&#x7F16;&#x5668;&#x4E00;&#x76F4;&#x4F7F;&#x7528;AT&amp;T&#x8BED;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x4E66;&#x4F7F;&#x7528;AT&amp;T&#x8BED;&#x6CD5;&#x3002;<code class="literal">movl %edx,%eax</code>&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x5982;&#x679C;&#x7528;intel&#x8BED;&#x6CD5;&#x6765;&#x5199;&#xFF0C;&#x5C31;&#x662F;<code class="literal">mov eax,edx</code>&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x540D;&#x4E0D;&#x52A0;%&#x53F7;&#xFF0C;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x548C;&#x76EE;&#x6807;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x4F4D;&#x7F6E;&#x4E92;&#x6362;&#xFF0C;&#x5B57;&#x957F;&#x4E5F;&#x4E0D;&#x662F;&#x7528;&#x6307;&#x4EE4;&#x7684;&#x540E;&#x7F00;l&#x8868;&#x793A;&#x800C;&#x662F;&#x7528;&#x53E6;&#x5916;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x3002;&#x672C;&#x4E66;&#x4E0D;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E24;&#x79CD;&#x8BED;&#x6CD5;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a class="xref" href="bi01.html#bibli.assemblyhowto" title="Linux Assembly HOWTO&#xFF08;http://tldp.org/HOWTO/Assembly-HOWTO/&#xFF09;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x76EE;&#x524D;tldp.org&#x88AB;&#x6211;&#x4EEC;&#x4F1F;&#x5927;&#x7684;&#x9632;&#x706B;&#x5899;&#x5C4F;&#x853D;&#x4E86;&#xFF0C;&#x8BF7;&#x81EA;&#x5DF1;&#x627E;&#x4EE3;&#x7406;&#x8BBF;&#x95EE;">[<abbr class="abbrev">AssemblyHOWTO</abbr>]</a>&#x3002;</p><p>&#x4ECB;&#x7ECD;x86&#x6C47;&#x7F16;&#x7684;&#x4E66;&#x5F88;&#x591A;&#xFF0C;UNIX&#x5E73;&#x53F0;&#x7684;&#x4E66;&#x90FD;&#x91C7;&#x7528;AT&amp;T&#x8BED;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;<a class="xref" href="bi01.html#bibli.groundup" title="Programming from the Ground Up: An Introduction to Programming using Linux Assembly Language">[<abbr class="abbrev">GroudUp</abbr>]</a>&#xFF0C;&#x5176;&#x5B83;&#x4E66;&#x4E00;&#x822C;&#x91C7;&#x7528;intel&#x8BED;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;<a class="xref" href="bi01.html#bibli.x86assembly" title="Introduction to 80x86 Assembly Language and Computer Architecture">[<abbr class="abbrev">x86Assembly</abbr>]</a>&#x3002;</p></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2769776"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x628A;&#x672C;&#x8282;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;<code class="literal">int $0x80</code>&#x6307;&#x4EE4;&#x53BB;&#x6389;&#xFF0C;&#x6C47;&#x7F16;&#x3001;&#x94FE;&#x63A5;&#x4E5F;&#x80FD;&#x901A;&#x8FC7;&#xFF0C;&#x4F46;&#x662F;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x6BB5;&#x9519;&#x8BEF;&#xFF0C;&#x4F60;&#x80FD;&#x89E3;&#x91CA;&#x5176;&#x539F;&#x56E0;&#x5417;&#xFF1F;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch18.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch18.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch18s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;18&#xA0;&#x7AE0;&#xA0;x86&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;x86&#x7684;&#x5BC4;&#x5B58;&#x5668;</td></tr></tbody></table></div>
</body></html>