<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x8054;&#x5408;&#x4F53;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch19.html" title="&#x7B2C;&#xA0;19&#xA0;&#x7AE0;&#xA0;&#x6C47;&#x7F16;&#x4E0E;C&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;"><link rel="prev" href="ch19s03.html" title="3.&#xA0;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;"><link rel="next" href="ch19s05.html" title="5.&#xA0;C&#x5185;&#x8054;&#x6C47;&#x7F16;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x8054;&#x5408;&#x4F53;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch19s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;19&#xA0;&#x7AE0;&#xA0;&#x6C47;&#x7F16;&#x4E0E;C&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch19s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2779313"></a>4.&#xA0;&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x8054;&#x5408;&#x4F53;</h2></div></div></div><p>&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x7528;&#x53CD;&#x6C47;&#x7F16;&#x7684;&#x65B9;&#x6CD5;&#x7814;&#x7A76;&#x4E00;&#x4E0B;C&#x8BED;&#x8A00;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF1A;</p><div class="example"><a id="id2779326"></a><p class="title"><b>&#x4F8B;&#xA0;19.3.&#xA0;&#x7814;&#x7A76;&#x7ED3;&#x6784;&#x4F53;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

int main(int argc, char** argv)
{
	struct {
		char a;
		short b;
		int c;
		char d;
	} s;

	s.a = 1;
	s.b = 2;
	s.c = 3;
	s.d = 4;
	printf(&quot;%u\n&quot;, sizeof(s));

	return 0;
}</pre></div></div><br class="example-break"><p><code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#x51E0;&#x6761;&#x8BED;&#x53E5;&#x7684;&#x53CD;&#x6C47;&#x7F16;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="screen">        s.a = 1;
 80483d5:       c6 45 f0 01             movb   $0x1,-0x10(%ebp)
        s.b = 2;
 80483d9:       66 c7 45 f2 02 00       movw   $0x2,-0xe(%ebp)
        s.c = 3;
 80483df:       c7 45 f4 03 00 00 00    movl   $0x3,-0xc(%ebp)
        s.d = 4;
 80483e6:       c6 45 f8 04             movb   $0x4,-0x8(%ebp)</pre><p>&#x4ECE;&#x8BBF;&#x95EE;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x7684;&#x6307;&#x4EE4;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x56DB;&#x4E2A;&#x6210;&#x5458;&#x5728;&#x6808;&#x4E0A;&#x662F;&#x8FD9;&#x6837;&#x6392;&#x5217;&#x7684;&#xFF1A;</p><div class="figure"><a id="id2779360"></a><p class="title"><b>&#x56FE;&#xA0;19.5.&#xA0;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;</b></p><div class="figure-contents"><div><img src="images/asmc.struct.png" alt="&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;"></div></div></div><br class="figure-break"><p>&#x867D;&#x7136;&#x6808;&#x662F;&#x4ECE;&#x9AD8;&#x5730;&#x5740;&#x5411;&#x4F4E;&#x5730;&#x5740;&#x589E;&#x957F;&#x7684;&#xFF0C;&#x4F46;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x4E5F;&#x662F;&#x4ECE;&#x4F4E;&#x5730;&#x5740;&#x5411;&#x9AD8;&#x5730;&#x5740;&#x6392;&#x5217;&#x7684;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x548C;&#x6570;&#x7EC4;&#x7C7B;&#x4F3C;&#x3002;&#x4F46;&#x6709;&#x4E00;&#x70B9;&#x548C;&#x6570;&#x7EC4;&#x4E0D;&#x540C;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5404;&#x6210;&#x5458;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7D27;&#x6328;&#x4E00;&#x4E2A;&#x6392;&#x5217;&#x7684;&#xFF0C;&#x4E2D;&#x95F4;&#x6709;&#x7A7A;&#x9699;&#xFF0C;&#x79F0;&#x4E3A;&#x586B;&#x5145;&#xFF08;Padding&#xFF09;<a id="id2779381" class="indexterm"></a>&#xFF0C;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x672B;&#x5C3E;&#x4E5F;&#x6709;&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x586B;&#x5145;&#xFF0C;&#x6240;&#x4EE5;<code class="literal">sizeof(s)</code>&#x7684;&#x503C;&#x662F;12&#x3002;&#x6CE8;&#x610F;&#xFF0C;<code class="literal">printf</code>&#x7684;<code class="literal">%u</code>&#x8F6C;&#x6362;&#x8BF4;&#x660E;&#x8868;&#x793A;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#xFF0C;<code class="literal">sizeof</code>&#x7684;&#x503C;&#x662F;<code class="literal">size_t</code>&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x662F;&#x67D0;&#x79CD;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x578B;&#x3002;</p><p>&#x4E3A;&#x4EC0;&#x4E48;&#x7F16;&#x8BD1;&#x5668;&#x8981;&#x8FD9;&#x6837;&#x5904;&#x7406;&#x5462;&#xFF1F;&#x6709;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x6211;&#x6B64;&#x524D;&#x4E00;&#x76F4;&#x56DE;&#x907F;&#x6CA1;&#x8BB2;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5927;&#x591A;&#x6570;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x5BF9;&#x4E8E;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x6307;&#x4EE4;&#x662F;&#x6709;&#x9650;&#x5236;&#x7684;&#xFF0C;&#x5728;32&#x4F4D;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x8BBF;&#x95EE;4&#x5B57;&#x8282;&#x7684;&#x6307;&#x4EE4;&#xFF08;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;<code class="literal">movl</code>&#xFF09;&#x6240;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x5E94;&#x8BE5;&#x662F;4&#x7684;&#x6574;&#x6570;&#x500D;&#xFF0C;&#x8BBF;&#x95EE;&#x4E24;&#x5B57;&#x8282;&#x7684;&#x6307;&#x4EE4;&#xFF08;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;<code class="literal">movw</code>&#xFF09;&#x6240;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x5E94;&#x8BE5;&#x662F;&#x4E24;&#x5B57;&#x8282;&#x7684;&#x6574;&#x6570;&#x500D;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x5BF9;&#x9F50;&#xFF08;Alignment&#xFF09;<a id="id2779442" class="indexterm"></a>&#x3002;&#x4EE5;&#x524D;&#x4E3E;&#x7684;&#x6240;&#x6709;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x6307;&#x4EE4;&#x90FD;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#x6761;&#x4EF6;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x56DE;&#x5934;&#x68C0;&#x9A8C;&#x4E00;&#x4E0B;&#x3002;&#x5982;&#x679C;&#x6307;&#x4EE4;&#x6240;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x5BF9;&#x9F50;&#x4F1A;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;&#x5728;&#x6709;&#x4E9B;&#x5E73;&#x53F0;&#x4E0A;&#x5C06;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF0C;&#x800C;&#x662F;&#x5F15;&#x53D1;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#xFF0C;&#x5728;x86&#x5E73;&#x53F0;&#x4E0A;&#x5012;&#x662F;&#x4ECD;&#x7136;&#x80FD;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5BF9;&#x9F50;&#x7684;&#x6307;&#x4EE4;&#x6267;&#x884C;&#x6548;&#x7387;&#x6BD4;&#x5BF9;&#x9F50;&#x7684;&#x6307;&#x4EE4;&#x8981;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x5B89;&#x6392;&#x5404;&#x79CD;&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#x65F6;&#x90FD;&#x4F1A;&#x8003;&#x8651;&#x5230;&#x5BF9;&#x9F50;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x672C;&#x4F8B;&#x4E2D;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x628A;&#x5B83;&#x7684;&#x57FA;&#x5730;&#x5740;&#x5BF9;&#x9F50;&#x5230;4&#x5B57;&#x8282;&#x8FB9;&#x754C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;<code class="literal">ebp-0x10</code>&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x4E00;&#x5B9A;&#x662F;4&#x7684;&#x6574;&#x6570;&#x500D;&#x3002;<code class="literal">s.a</code>&#x5360;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6CA1;&#x6709;&#x5BF9;&#x9F50;&#x7684;&#x95EE;&#x9898;&#x3002;<code class="literal">s.b</code>&#x5360;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5982;&#x679C;<code class="literal">s.b</code>&#x7D27;&#x6328;&#x5728;<code class="literal">s.a</code>&#x540E;&#x9762;&#xFF0C;&#x5B83;&#x7684;&#x5730;&#x5740;&#x5C31;&#x4E0D;&#x80FD;&#x662F;&#x4E24;&#x5B57;&#x8282;&#x7684;&#x6574;&#x6570;&#x500D;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x5728;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x586B;&#x5145;&#x5B57;&#x8282;&#xFF0C;&#x4F7F;<code class="literal">s.b</code>&#x7684;&#x5730;&#x5740;&#x4E5F;&#x662F;&#x4E24;&#x5B57;&#x8282;&#x7684;&#x6574;&#x6570;&#x500D;&#x3002;<code class="literal">s.c</code>&#x5360;4&#x5B57;&#x8282;&#xFF0C;&#x7D27;&#x6328;&#x5728;<code class="literal">s.b</code>&#x7684;&#x540E;&#x9762;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;<code class="literal">ebp-0xc</code>&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x4E5F;&#x662F;4&#x7684;&#x6574;&#x6570;&#x500D;&#x3002;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;<code class="literal">s.d</code>&#x7684;&#x540E;&#x9762;&#x4E5F;&#x8981;&#x6709;&#x586B;&#x5145;&#x4F4D;&#x586B;&#x5145;&#x5230;4&#x5B57;&#x8282;&#x8FB9;&#x754C;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x5B89;&#x6392;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x540E;&#x9762;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5047;&#x5982;&#x7528;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x90A3;&#x4E48;&#x540E;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x53EA;&#x9700;&#x548C;&#x524D;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7D27;&#x6328;&#x7740;&#x6392;&#x5217;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5B83;&#x7684;&#x57FA;&#x5730;&#x5740;&#x4ECD;&#x7136;&#x5BF9;&#x9F50;&#x5230;4&#x5B57;&#x8282;&#x8FB9;&#x754C;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x524D;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x672B;&#x5C3E;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x586B;&#x5145;&#x5B57;&#x8282;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;C&#x6807;&#x51C6;&#x89C4;&#x5B9A;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x5FC5;&#x987B;&#x7D27;&#x6328;&#x7740;&#x6392;&#x5217;&#xFF0C;&#x4E0D;&#x80FD;&#x6709;&#x7A7A;&#x9699;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x6309;&#x201C;<span class="quote">&#x57FA;&#x5730;&#x5740;+n&#xD7;&#x5143;&#x7D20;&#x5927;&#x5C0F;</span>&#x201D;&#x7B80;&#x5355;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x3002;</p><p>&#x5408;&#x7406;&#x8BBE;&#x8BA1;&#x7ED3;&#x6784;&#x4F53;&#x5404;&#x6210;&#x5458;&#x7684;&#x6392;&#x5217;&#x987A;&#x5E8F;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x4F8B;&#x4E2D;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#x6539;&#x6210;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4EA7;&#x751F;&#x586B;&#x5145;&#x5B57;&#x8282;&#xFF1A;</p><pre class="programlisting">struct {
	char a;
	char d;
	short b;
	int c;
} s;</pre><p>&#x6B64;&#x5916;&#xFF0C;<code class="literal">gcc</code>&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6269;&#x5C55;&#x8BED;&#x6CD5;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x7684;&#x586B;&#x5145;&#x5B57;&#x8282;&#xFF1A;</p><pre class="programlisting">struct {
	char a;
	short b;
	int c;
	char d;
} __attribute__((packed)) s;</pre><p>&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x7684;&#x5BF9;&#x9F50;&#x4E86;&#xFF0C;&#x5728;&#x8BBF;&#x95EE;<code class="literal">b</code>&#x548C;<code class="literal">c</code>&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6548;&#x7387;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x9664;&#x975E;&#x6709;&#x7279;&#x522B;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x3002;</p><p>&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x90FD;&#x662F;&#x5360;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6700;&#x5C0F;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x8981;&#x5360;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x5728;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Bit-field<a id="id2779601" class="indexterm"></a>&#x8BED;&#x6CD5;&#x5B9A;&#x4E49;&#x53EA;&#x5360;&#x51E0;&#x4E2A;bit&#x7684;&#x6210;&#x5458;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x51FA;&#x81EA;&#x738B;&#x806A;&#x7684;&#x7F51;&#x7AD9;&#xFF08;www.wangcong.org&#xFF09;&#xFF1A;</p><div class="example"><a id="id2779611"></a><p class="title"><b>&#x4F8B;&#xA0;19.4.&#xA0;Bit-field</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

typedef struct {
	unsigned int one:1;
	unsigned int two:3;
	unsigned int three:10;
	unsigned int four:5;
	unsigned int :2;
	unsigned int five:8;
	unsigned int six:8;
} demo_type;

int main(void)
{
	demo_type s = { 1, 5, 513, 17, 129, 0x81 };
	printf(&quot;sizeof demo_type = %u\n&quot;, sizeof(demo_type));
	printf(&quot;values: s=%u,%u,%u,%u,%u,%u\n&quot;,
	       s.one, s.two, s.three, s.four, s.five, s.six);

	return 0;
}</pre></div></div><br class="example-break"><p><code class="literal">s</code>&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5E03;&#x5C40;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><div class="figure"><a id="id2779629"></a><p class="title"><b>&#x56FE;&#xA0;19.6.&#xA0;Bit-field&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;</b></p><div class="figure-contents"><div><img src="images/asmc.bitfield.png" alt="Bit-field&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;"></div></div></div><br class="figure-break"><p>Bit-field&#x6210;&#x5458;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x662F;<code class="literal">int</code>&#x6216;<code class="literal">unsigned int</code>&#xFF0C;&#x8868;&#x793A;&#x6709;&#x7B26;&#x53F7;&#x6570;&#x6216;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#xFF0C;&#x4F46;&#x4E0D;&#x8868;&#x793A;&#x5B83;&#x50CF;&#x666E;&#x901A;&#x7684;<code class="literal">int</code>&#x578B;&#x4E00;&#x6837;&#x5360;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5B83;&#x540E;&#x9762;&#x7684;&#x6570;&#x5B57;&#x662F;&#x51E0;&#x5C31;&#x8868;&#x793A;&#x5B83;&#x5360;&#x591A;&#x5C11;&#x4E2A;bit&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x50CF;<code class="literal">unsigned int :2;</code>&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x672A;&#x547D;&#x540D;&#x7684;Bit-field&#xFF0C;&#x5373;&#x4F7F;&#x4E0D;&#x5199;&#x672A;&#x547D;&#x540D;&#x7684;Bit-field&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x4E24;&#x4E2A;&#x6210;&#x5458;&#x4E4B;&#x95F4;&#x63D2;&#x5165;&#x586B;&#x5145;&#x4F4D;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x7684;<code class="literal">five</code>&#x548C;<code class="literal">six</code>&#x4E4B;&#x95F4;&#xFF0C;&#x8FD9;&#x6837;<code class="literal">six</code>&#x8FD9;&#x4E2A;&#x6210;&#x5458;&#x5C31;&#x521A;&#x597D;&#x5355;&#x72EC;&#x5360;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4E86;&#xFF0C;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x4F1A;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x672B;&#x5C3E;&#x8FD8;&#x586B;&#x5145;&#x4E86;3&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BF9;&#x9F50;&#x5230;4&#x5B57;&#x8282;&#x8FB9;&#x754C;&#x3002;&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;x86&#x7684;Byte Order&#x662F;&#x5C0F;&#x7AEF;&#x7684;&#xFF0C;&#x4ECE;&#x4E0A;&#x56FE;&#x4E2D;<code class="literal">one</code>&#x548C;<code class="literal">two</code>&#x7684;&#x6392;&#x5217;&#x987A;&#x5E8F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x518D;&#x7EC6;&#x5206;&#xFF0C;&#x5219;&#x5B57;&#x8282;&#x4E2D;&#x7684;Bit Order&#x4E5F;&#x662F;&#x5C0F;&#x7AEF;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6392;&#x5728;&#x7ED3;&#x6784;&#x4F53;&#x524D;&#x9762;&#x7684;&#x6210;&#x5458;&#xFF08;&#x9760;&#x8FD1;&#x4F4E;&#x5730;&#x5740;&#x4E00;&#x8FB9;&#x7684;&#x6210;&#x5458;&#xFF09;&#x53D6;&#x5B57;&#x8282;&#x4E2D;&#x7684;&#x4F4E;&#x4F4D;&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x6392;&#x5217;Bit-field&#x5728;C&#x6807;&#x51C6;&#x4E2D;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x7684;&#x89C4;&#x5B9A;&#xFF0C;&#x8FD9;&#x8DDF;Byte Order&#x3001;Bit Order&#x3001;&#x5BF9;&#x9F50;&#x7B49;&#x95EE;&#x9898;&#x90FD;&#x6709;&#x5173;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x6392;&#x5217;&#x5F97;&#x5F88;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8981;&#x7F16;&#x5199;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x4E0D;&#x80FD;&#x5047;&#x5B9A;Bit-field&#x662F;&#x6309;&#x67D0;&#x4E00;&#x79CD;&#x56FA;&#x5B9A;&#x65B9;&#x5F0F;&#x6392;&#x5217;&#x7684;&#x3002;Bit-field&#x5728;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x4E2D;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x5355;&#x72EC;&#x64CD;&#x4F5C;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x51E0;&#x4E2A;bit&#xFF0C;&#x4F46;&#x4E00;&#x5B9A;&#x8981;&#x5C0F;&#x5FC3;&#x4F7F;&#x7528;&#xFF0C;&#x9996;&#x5148;&#x5F04;&#x6E05;&#x695A;&#x6BCF;&#x4E2A;Bit-field&#x548C;&#x5B9E;&#x9645;bit&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x3002;</p><p>&#x548C;&#x524D;&#x9762;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x4E0A;&#x4F8B;&#x4E2D;&#x6211;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x53CD;&#x6C47;&#x7F16;&#x7ED3;&#x679C;&#xFF0C;&#x76F4;&#x63A5;&#x753B;&#x4E86;&#x4E2A;&#x56FE;&#x8BF4;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5E03;&#x5C40;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x8BC1;&#x636E;&#x8FD9;&#x4E48;&#x8BF4;&#x5462;&#xFF1F;&#x4E0A;&#x4F8B;&#x7684;&#x53CD;&#x6C47;&#x7F16;&#x7ED3;&#x679C;&#x6BD4;&#x8F83;&#x7E41;&#x7410;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53E6;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x3002;C&#x8BED;&#x8A00;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x53EB;&#x8054;&#x5408;&#x4F53;&#xFF0C;&#x7528;&#x5173;&#x952E;&#x5B57;<code class="literal">union</code>&#x5B9A;&#x4E49;&#xFF0C;&#x5176;&#x8BED;&#x6CD5;&#x7C7B;&#x4F3C;&#x4E8E;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><div class="example"><a id="id2779759"></a><p class="title"><b>&#x4F8B;&#xA0;19.5.&#xA0;&#x8054;&#x5408;&#x4F53;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

typedef union {
	struct {
		unsigned int one:1;
		unsigned int two:3;
		unsigned int three:10;
		unsigned int four:5;
		unsigned int :2;
		unsigned int five:8;
		unsigned int six:8;
	} bitfield;
	unsigned char byte[8];
} demo_type;

int main(void)
{
	demo_type u = {{ 1, 5, 513, 17, 129, 0x81 }};
	printf(&quot;sizeof demo_type = %u\n&quot;, sizeof(demo_type));
	printf(&quot;values: u=%u,%u,%u,%u,%u,%u\n&quot;,
	       u.bitfield.one, u.bitfield.two, u.bitfield.three,
	       u.bitfield.four, u.bitfield.five, u.bitfield.six);
	printf(&quot;hex dump of u: %x %x %x %x %x %x %x %x \n&quot;,
	       u.byte[0], u.byte[1], u.byte[2], u.byte[3],
	       u.byte[4], u.byte[5], u.byte[6], u.byte[7]);

	return 0;
}</pre></div></div><br class="example-break"><p>&#x4E00;&#x4E2A;&#x8054;&#x5408;&#x4F53;&#x7684;&#x5404;&#x4E2A;&#x6210;&#x5458;&#x5360;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x8054;&#x5408;&#x4F53;&#x7684;&#x957F;&#x5EA6;&#x7B49;&#x4E8E;&#x5176;&#x4E2D;&#x6700;&#x957F;&#x6210;&#x5458;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x6BD4;&#x5982;<code class="literal">u</code>&#x8FD9;&#x4E2A;&#x8054;&#x5408;&#x4F53;&#x5360;8&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5982;&#x679C;&#x8BBF;&#x95EE;&#x6210;&#x5458;<code class="literal">u.bitfield</code>&#xFF0C;&#x5219;&#x628A;&#x8FD9;8&#x4E2A;&#x5B57;&#x8282;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x7531;Bit-field&#x7EC4;&#x6210;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x5982;&#x679C;&#x8BBF;&#x95EE;&#x6210;&#x5458;<code class="literal">u.byte</code>&#xFF0C;&#x5219;&#x628A;&#x8FD9;8&#x4E2A;&#x5B57;&#x8282;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x3002;&#x8054;&#x5408;&#x4F53;&#x5982;&#x679C;&#x7528;Initializer&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5219;&#x53EA;&#x521D;&#x59CB;&#x5316;&#x5B83;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">demo_type u = {{ 1, 5, 513, 17, 129, 0x81 }};</code>&#x521D;&#x59CB;&#x5316;&#x7684;&#x662F;<code class="literal">u.bitfield</code>&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;<code class="literal">u.bitfield</code>&#x7684;&#x6210;&#x5458;&#x770B;&#x4E0D;&#x51FA;&#x8FD9;8&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#xFF0C;&#x800C;&#x901A;&#x8FC7;<code class="literal">u.byte</code>&#x6570;&#x7EC4;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x5206;&#x522B;&#x662F;&#x591A;&#x5C11;&#x4E86;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2779834"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x6D4B;&#x8BD5;&#x8FD0;&#x884C;&#x5B83;&#x7684;&#x5E73;&#x53F0;&#x662F;&#x5927;&#x7AEF;&#x8FD8;&#x662F;&#x5C0F;&#x7AEF;&#x5B57;&#x8282;&#x5E8F;&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch19s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch19.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch19s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;5.&#xA0;C&#x5185;&#x8054;&#x6C47;&#x7F16;</td></tr></tbody></table></div>
</body></html>