<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>6.&#xA0;volatile&#x9650;&#x5B9A;&#x7B26;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch19.html" title="&#x7B2C;&#xA0;19&#xA0;&#x7AE0;&#xA0;&#x6C47;&#x7F16;&#x4E0E;C&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;"><link rel="prev" href="ch19s05.html" title="5.&#xA0;C&#x5185;&#x8054;&#x6C47;&#x7F16;"><link rel="next" href="ch20.html" title="&#x7B2C;&#xA0;20&#xA0;&#x7AE0;&#xA0;&#x94FE;&#x63A5;&#x8BE6;&#x89E3;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">6.&#xA0;volatile&#x9650;&#x5B9A;&#x7B26;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch19s05.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;19&#xA0;&#x7AE0;&#xA0;&#x6C47;&#x7F16;&#x4E0E;C&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch20.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2780234"></a>6.&#xA0;volatile&#x9650;&#x5B9A;&#x7B26;</h2></div></div></div><p>&#x73B0;&#x5728;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x4F1A;&#x5BF9;&#x751F;&#x6210;&#x7684;&#x6307;&#x4EE4;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x4ECB;&#x7ECD;C&#x8BED;&#x8A00;&#x7684;<code class="literal">volatile</code>&#x9650;&#x5B9A;&#x7B26;&#x3002;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p><div class="example"><a id="id2780254"></a><p class="title"><b>&#x4F8B;&#xA0;19.7.&#xA0;volatile&#x9650;&#x5B9A;&#x7B26;</b></p><div class="example-contents"><pre class="programlisting">/* artificial device registers */
unsigned char recv;
unsigned char send;

/* memory buffer */
unsigned char buf[3];

int main(void)
{
	buf[0] = recv;
	buf[1] = recv;
	buf[2] = recv;
	send = ~buf[0];
	send = ~buf[1];
	send = ~buf[2];

	return 0;
}</pre></div></div><br class="example-break"><p>&#x6211;&#x4EEC;&#x7528;<code class="literal">recv</code>&#x548C;<code class="literal">send</code>&#x8FD9;&#x4E24;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6765;&#x6A21;&#x62DF;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x3002;&#x5047;&#x8BBE;&#x67D0;&#x79CD;&#x5E73;&#x53F0;&#x91C7;&#x7528;&#x5185;&#x5B58;&#x6620;&#x5C04;I/O&#xFF0C;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x4F4D;&#x4E8E;&#x56FA;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x800C;<code class="literal">recv</code>&#x548C;<code class="literal">send</code>&#x8FD9;&#x4E24;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E5F;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x628A;&#x5B83;&#x4EEC;&#x5047;&#x60F3;&#x6210;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x5BC4;&#x5B58;&#x5668;&#x3002;&#x5728;<code class="literal">main</code>&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x4ECE;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#x5B58;&#x5230;<code class="literal">buf</code>&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#x53D6;&#x53CD;&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x51FA;&#x53BB;<sup>[<a id="id2780312" href="#ftn.id2780312" class="footnote">31</a>]</sup>&#x3002;&#x6211;&#x4EEC;&#x67E5;&#x770B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x53CD;&#x6C47;&#x7F16;&#x7ED3;&#x679C;&#xFF1A;</p><pre class="screen">        buf[0] = recv;
 80483a2:       0f b6 05 19 a0 04 08    movzbl 0x804a019,%eax
 80483a9:       a2 1a a0 04 08          mov    %al,0x804a01a
        buf[1] = recv;
 80483ae:       0f b6 05 19 a0 04 08    movzbl 0x804a019,%eax
 80483b5:       a2 1b a0 04 08          mov    %al,0x804a01b
        buf[2] = recv;
 80483ba:       0f b6 05 19 a0 04 08    movzbl 0x804a019,%eax
 80483c1:       a2 1c a0 04 08          mov    %al,0x804a01c
        send = ~buf[0];
 80483c6:       0f b6 05 1a a0 04 08    movzbl 0x804a01a,%eax
 80483cd:       f7 d0                   not    %eax
 80483cf:       a2 18 a0 04 08          mov    %al,0x804a018
        send = ~buf[1];
 80483d4:       0f b6 05 1b a0 04 08    movzbl 0x804a01b,%eax
 80483db:       f7 d0                   not    %eax
 80483dd:       a2 18 a0 04 08          mov    %al,0x804a018
        send = ~buf[2];
 80483e2:       0f b6 05 1c a0 04 08    movzbl 0x804a01c,%eax
 80483e9:       f7 d0                   not    %eax
 80483eb:       a2 18 a0 04 08          mov    %al,0x804a018</pre><p><code class="literal">movz</code>&#x6307;&#x4EE4;&#x628A;&#x5B57;&#x957F;&#x8F83;&#x77ED;&#x7684;&#x503C;&#x5B58;&#x5230;&#x5B57;&#x957F;&#x8F83;&#x957F;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x7684;&#x9AD8;&#x4F4D;&#x7528;0&#x586B;&#x5145;&#x3002;&#x8BE5;&#x6307;&#x4EE4;&#x53EF;&#x4EE5;&#x6709;<code class="literal">b</code>&#xFF08;byte&#xFF09;&#x3001;<code class="literal">w</code>&#xFF08;word&#xFF09;&#x3001;<code class="literal">l</code>&#xFF08;long&#xFF09;&#x4E09;&#x79CD;&#x540E;&#x7F00;&#xFF0C;&#x5206;&#x522B;&#x8868;&#x793A;&#x5355;&#x5B57;&#x8282;&#x3001;&#x4E24;&#x5B57;&#x8282;&#x548C;&#x56DB;&#x5B57;&#x8282;&#x3002;&#x6BD4;&#x5982;<code class="literal">movzbl 0x804a019,%eax</code>&#x8868;&#x793A;&#x628A;&#x5730;&#x5740;0x804a019&#x5904;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x5B58;&#x5230;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x800C;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x662F;&#x56DB;&#x5B57;&#x8282;&#x7684;&#xFF0C;&#x9AD8;&#x4E09;&#x5B57;&#x8282;&#x7528;0&#x586B;&#x5145;&#xFF0C;&#x800C;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;<code class="literal">mov    %al,0x804a01a</code>&#x4E2D;&#x7684;<code class="literal">al</code>&#x5BC4;&#x5B58;&#x5668;&#x6B63;&#x662F;<code class="literal">eax</code>&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4F4E;&#x5B57;&#x8282;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x5B57;&#x8282;&#x5B58;&#x5230;&#x5730;&#x5740;0x804a01a&#x5904;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4E2D;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x540D;&#x5B57;&#x5355;&#x72EC;&#x8BBF;&#x95EE;x86&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4F4E;8&#x4F4D;&#x3001;&#x6B21;&#x4F4E;8&#x4F4D;&#x3001;&#x4F4E;16&#x4F4D;&#x6216;&#x8005;&#x5B8C;&#x6574;&#x7684;32&#x4F4D;&#xFF0C;&#x4EE5;<code class="literal">eax</code>&#x4E3A;&#x4F8B;&#xFF0C;<code class="literal">al</code>&#x8868;&#x793A;&#x4F4E;8&#x4F4D;&#xFF0C;<code class="literal">ah</code>&#x8868;&#x793A;&#x6B21;&#x4F4E;8&#x4F4D;&#xFF0C;<code class="literal">ax</code>&#x8868;&#x793A;&#x4F4E;16&#x4F4D;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2780453"></a><p class="title"><b>&#x56FE;&#xA0;19.7.&#xA0;eax&#x5BC4;&#x5B58;&#x5668;</b></p><div class="figure-contents"><div><img src="images/asmc.eax.png" alt="eax&#x5BC4;&#x5B58;&#x5668;"></div></div></div><br class="figure-break"><p>&#x4F46;&#x5982;&#x679C;&#x6307;&#x5B9A;&#x4F18;&#x5316;&#x9009;&#x9879;<code class="literal">-O</code>&#x7F16;&#x8BD1;&#xFF0C;&#x53CD;&#x6C47;&#x7F16;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF1A;</p><pre class="screen">$ gcc main.c -g -O
$ objdump -dS a.out|less
...
        buf[0] = recv;
 80483ae:       0f b6 05 19 a0 04 08    movzbl 0x804a019,%eax
 80483b5:       a2 1a a0 04 08          mov    %al,0x804a01a
        buf[1] = recv;
 80483ba:       a2 1b a0 04 08          mov    %al,0x804a01b
        buf[2] = recv;
 80483bf:       a2 1c a0 04 08          mov    %al,0x804a01c
        send = ~buf[0];
        send = ~buf[1];
        send = ~buf[2];
 80483c4:       f7 d0                   not    %eax
 80483c6:       a2 18 a0 04 08          mov    %al,0x804a018
...</pre><p>&#x524D;&#x4E09;&#x6761;&#x8BED;&#x53E5;&#x4ECE;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x7F16;&#x8BD1;&#x751F;&#x6210;&#x7684;&#x6307;&#x4EE4;&#x663E;&#x7136;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x610F;&#x56FE;&#xFF1A;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x4ECE;&#x5185;&#x5B58;&#x5730;&#x5740;0x804a019&#x8BFB;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x5230;&#x5BC4;&#x5B58;&#x5668;<code class="literal">eax</code>&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x5BC4;&#x5B58;&#x5668;<code class="literal">al</code>&#x4FDD;&#x5B58;&#x5230;<code class="literal">buf[0]</code>&#xFF0C;&#x540E;&#x4E24;&#x6761;&#x8BED;&#x53E5;&#x5C31;&#x4E0D;&#x518D;&#x4ECE;&#x5185;&#x5B58;&#x5730;&#x5740;0x804a019&#x8BFB;&#x53D6;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x628A;&#x5BC4;&#x5B58;&#x5668;<code class="literal">al</code>&#x7684;&#x503C;&#x4FDD;&#x5B58;&#x5230;<code class="literal">buf[1]</code>&#x548C;<code class="literal">buf[2]</code>&#x3002;&#x540E;&#x4E09;&#x6761;&#x8BED;&#x53E5;&#x628A;<code class="literal">buf</code>&#x4E2D;&#x7684;&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#x53D6;&#x53CD;&#x518D;&#x53D1;&#x9001;&#x5230;&#x4E32;&#x53E3;&#xFF0C;&#x7F16;&#x8BD1;&#x751F;&#x6210;&#x7684;&#x6307;&#x4EE4;&#x4E5F;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x610F;&#x56FE;&#xFF1A;&#x53EA;&#x6709;&#x6700;&#x540E;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x628A;<code class="literal">eax</code>&#x7684;&#x503C;&#x53D6;&#x53CD;&#x5199;&#x5230;&#x5185;&#x5B58;&#x5730;&#x5740;0x804a018&#x4E86;&#xFF0C;&#x524D;&#x4E24;&#x6761;&#x8BED;&#x53E5;&#x5F62;&#x540C;&#x865A;&#x8BBE;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x751F;&#x6210;&#x6307;&#x4EE4;&#x3002;</p><p>&#x4E3A;&#x4EC0;&#x4E48;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x9519;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x5E76;&#x4E0D;&#x77E5;&#x9053;0x804a018&#x548C;0x804a019&#x662F;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x6210;&#x666E;&#x901A;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#x4E86;&#x3002;&#x5982;&#x679C;&#x662F;&#x666E;&#x901A;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#xFF0C;&#x53EA;&#x8981;&#x7A0B;&#x5E8F;&#x4E0D;&#x53BB;&#x6539;&#x5199;&#x5B83;&#xFF0C;&#x5B83;&#x5C31;&#x4E0D;&#x4F1A;&#x53D8;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x628A;&#x5185;&#x5B58;&#x5355;&#x5143;&#x91CC;&#x7684;&#x503C;&#x8BFB;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x4EE5;&#x540E;&#x6BCF;&#x6B21;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x503C;&#x5C31;&#x76F4;&#x63A5;&#x4ECE;&#x5BC4;&#x5B58;&#x5668;&#x8BFB;&#x53D6;&#xFF0C;&#x8FD9;&#x6837;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8BFB;&#x5BC4;&#x5B58;&#x5668;&#x8FDC;&#x6BD4;&#x8BFB;&#x5185;&#x5B58;&#x8981;&#x5FEB;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#x8FDE;&#x7EED;&#x505A;&#x4E09;&#x6B21;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x6709;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x7684;&#x503C;&#x4F1A;&#x4FDD;&#x5B58;&#x5230;&#x5185;&#x5B58;&#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x524D;&#x4E24;&#x6B21;&#x5199;&#x64CD;&#x4F5C;&#x662F;&#x591A;&#x4F59;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x6389;&#x3002;&#x8BBF;&#x95EE;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4EE3;&#x7801;&#x8FD9;&#x6837;&#x4F18;&#x5316;&#x5C31;&#x9519;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x5F80;&#x5F80;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x6027;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x9700;&#x8981;&#x6539;&#x5199;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x6BCF;&#x6B21;&#x8BFB;&#x4E0A;&#x6765;&#x7684;&#x503C;&#x90FD;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p></li><li><p>&#x8FDE;&#x7EED;&#x591A;&#x6B21;&#x5411;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x5199;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x505A;&#x65E0;&#x7528;&#x529F;&#xFF0C;&#x800C;&#x662F;&#x6709;&#x7279;&#x6B8A;&#x610F;&#x4E49;&#x7684;&#x3002;</p></li></ul></div><p>&#x7528;&#x4F18;&#x5316;&#x9009;&#x9879;&#x7F16;&#x8BD1;&#x751F;&#x6210;&#x7684;&#x6307;&#x4EE4;&#x660E;&#x663E;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x4E0D;&#x5F53;&#x4F1A;&#x51FA;&#x9519;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x4F5C;&#x806A;&#x660E;&#xFF0C;&#x628A;&#x4E0D;&#x8BE5;&#x4F18;&#x5316;&#x7684;&#x4E5F;&#x4F18;&#x5316;&#x4E86;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x8BE5;&#x660E;&#x786E;&#x544A;&#x8BC9;&#x7F16;&#x8BD1;&#x5668;&#x54EA;&#x4E9B;&#x5185;&#x5B58;&#x5355;&#x5143;&#x7684;&#x8BBF;&#x95EE;&#x662F;&#x4E0D;&#x80FD;&#x4F18;&#x5316;&#x7684;&#xFF0C;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x53EF;&#x4EE5;&#x7528;<code class="literal">volatile</code>&#x9650;&#x5B9A;&#x7B26;&#x4FEE;&#x9970;&#x53D8;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x544A;&#x8BC9;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6307;&#x5B9A;&#x4E86;&#x4F18;&#x5316;&#x9009;&#x9879;&#xFF0C;&#x6BCF;&#x6B21;&#x8BFB;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4ECD;&#x7136;&#x8981;&#x8001;&#x8001;&#x5B9E;&#x5B9E;&#x4ECE;&#x5185;&#x5B58;&#x8BFB;&#x53D6;&#xFF0C;&#x6BCF;&#x6B21;&#x5199;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4E5F;&#x4ECD;&#x7136;&#x8981;&#x8001;&#x8001;&#x5B9E;&#x5B9E;&#x5199;&#x56DE;&#x5185;&#x5B58;&#xFF0C;&#x4E0D;&#x80FD;&#x7701;&#x7565;&#x4EFB;&#x4F55;&#x6B65;&#x9AA4;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x4EE3;&#x7801;&#x7684;&#x5F00;&#x5934;&#x51E0;&#x884C;&#x6539;&#x6210;&#xFF1A;</p><pre class="programlisting">/* artificial device registers */
volatile unsigned char recv;
volatile unsigned char send;</pre><p>&#x7136;&#x540E;&#x6307;&#x5B9A;&#x4F18;&#x5316;&#x9009;&#x9879;<code class="literal">-O</code>&#x7F16;&#x8BD1;&#xFF0C;&#x67E5;&#x770B;&#x53CD;&#x6C47;&#x7F16;&#x7684;&#x7ED3;&#x679C;&#xFF1A;</p><pre class="screen">        buf[0] = recv;
 80483a2:       0f b6 05 19 a0 04 08    movzbl 0x804a019,%eax
 80483a9:       a2 1a a0 04 08          mov    %al,0x804a01a
        buf[1] = recv;
 80483ae:       0f b6 15 19 a0 04 08    movzbl 0x804a019,%edx
 80483b5:       88 15 1b a0 04 08       mov    %dl,0x804a01b
        buf[2] = recv;
 80483bb:       0f b6 0d 19 a0 04 08    movzbl 0x804a019,%ecx
 80483c2:       88 0d 1c a0 04 08       mov    %cl,0x804a01c
        send = ~buf[0];
 80483c8:       f7 d0                   not    %eax
 80483ca:       a2 18 a0 04 08          mov    %al,0x804a018
        send = ~buf[1];
 80483cf:       f7 d2                   not    %edx
 80483d1:       88 15 18 a0 04 08       mov    %dl,0x804a018
        send = ~buf[2];
 80483d7:       f7 d1                   not    %ecx
 80483d9:       88 0d 18 a0 04 08       mov    %cl,0x804a018</pre><p>&#x786E;&#x5B9E;&#x6BCF;&#x6B21;&#x8BFB;<code class="literal">recv</code>&#x90FD;&#x4ECE;&#x5185;&#x5B58;&#x5730;&#x5740;0x804a019&#x8BFB;&#x53D6;&#xFF0C;&#x6BCF;&#x6B21;&#x5199;<code class="literal">send</code>&#x4E5F;&#x90FD;&#x5199;&#x5230;&#x5185;&#x5B58;&#x5730;&#x5740;0x804a018&#x4E86;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6BCF;&#x6B21;&#x5199;<code class="literal">send</code>&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x53D6;&#x51FA;<code class="literal">buf</code>&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x53D6;&#x51FA;&#x5148;&#x524D;&#x7F13;&#x5B58;&#x5728;&#x5BC4;&#x5B58;&#x5668;<code class="literal">eax</code>&#x3001;<code class="literal">edx</code>&#x3001;<code class="literal">ecx</code>&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x505A;&#x53D6;&#x53CD;&#x8FD0;&#x7B97;&#x7136;&#x540E;&#x5199;&#x4E0B;&#x53BB;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;<code class="literal">buf</code>&#x5E76;&#x6CA1;&#x6709;&#x7528;<code class="literal">volatile</code>&#x9650;&#x5B9A;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x8BD5;&#x7740;&#x5728;<code class="literal">buf</code>&#x7684;&#x5B9A;&#x4E49;&#x524D;&#x9762;&#x4E5F;&#x52A0;&#x4E0A;<code class="literal">volatile</code>&#xFF0C;&#x518D;&#x4F18;&#x5316;&#x7F16;&#x8BD1;&#xFF0C;&#x518D;&#x67E5;&#x770B;&#x53CD;&#x6C47;&#x7F16;&#x7684;&#x7ED3;&#x679C;&#x3002;</p><p><code class="literal">gcc</code>&#x7684;&#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x9009;&#x9879;&#x6709;<code class="literal">-O0</code>&#x3001;<code class="literal">-O</code>&#x3001;<code class="literal">-O1</code>&#x3001;<code class="literal">-O2</code>&#x3001;<code class="literal">-O3</code>&#x3001;<code class="literal">-Os</code>&#x51E0;&#x79CD;&#x3002;<code class="literal">-O0</code>&#x8868;&#x793A;&#x4E0D;&#x4F18;&#x5316;&#xFF0C;&#x8FD9;&#x662F;&#x7F3A;&#x7701;&#x7684;&#x9009;&#x9879;&#x3002;<code class="literal">-O1</code>&#x3001;<code class="literal">-O2</code>&#x548C;<code class="literal">-O3</code>&#x8FD9;&#x51E0;&#x4E2A;&#x9009;&#x9879;&#x4E00;&#x4E2A;&#x6BD4;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x5F97;&#x66F4;&#x591A;&#xFF0C;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#x4E5F;&#x66F4;&#x957F;&#x3002;<code class="literal">-O</code>&#x548C;<code class="literal">-O1</code>&#x76F8;&#x540C;&#x3002;<code class="literal">-Os</code>&#x8868;&#x793A;&#x4E3A;&#x7F29;&#x5C0F;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x7684;&#x5C3A;&#x5BF8;&#x800C;&#x4F18;&#x5316;&#x3002;&#x5177;&#x4F53;&#x6BCF;&#x79CD;&#x9009;&#x9879;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x4F18;&#x5316;&#x8BF7;&#x53C2;&#x8003;<code class="literal">gcc(1)</code>&#x7684;Man Page&#x3002;</p><p>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6307;&#x5B9A;&#x4E86;&#x4F18;&#x5316;&#x9009;&#x9879;&#xFF0C;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x751F;&#x6210;&#x6307;&#x4EE4;&#x7684;&#x6B21;&#x5E8F;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x5BF9;&#x5E94;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x4E9B;&#x6E90;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4E0D;&#x5BF9;&#x5E94;&#x4EFB;&#x4F55;&#x6307;&#x4EE4;&#xFF0C;&#x88AB;&#x5F7B;&#x5E95;&#x4F18;&#x5316;&#x6389;&#x4E86;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5728;&#x7528;<code class="literal">gdb</code>&#x505A;&#x6E90;&#x7801;&#x7EA7;&#x8C03;&#x8BD5;&#x65F6;&#x5C24;&#x5176;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF08;&#x505A;&#x6307;&#x4EE4;&#x7EA7;&#x8C03;&#x8BD5;&#x6CA1;&#x5173;&#x7CFB;&#xFF09;&#xFF0C;&#x5728;&#x4E3A;&#x8C03;&#x8BD5;&#x800C;&#x7F16;&#x8BD1;&#x65F6;&#x4E0D;&#x8981;&#x6307;&#x5B9A;&#x4F18;&#x5316;&#x9009;&#x9879;&#xFF0C;&#x5426;&#x5219;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x4E00;&#x6B65;&#x6B65;&#x8DDF;&#x8E2A;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;</p><p>&#x6709;&#x4E86;<code class="literal">volatile</code>&#x9650;&#x5B9A;&#x7B26;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x5BF9;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x6709;Cache&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x4EC5;&#x4EC5;&#x8FD9;&#x6837;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x8FD8;&#x662F;&#x65E0;&#x6CD5;&#x9632;&#x6B62;Cache&#x4F18;&#x5316;&#x5BF9;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x8BBF;&#x95EE;&#x3002;&#x5728;&#x8BBF;&#x95EE;&#x666E;&#x901A;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#x65F6;&#xFF0C;Cache&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6267;&#x884C;&#x4E86;<code class="literal">movzbl 0x804a019,%eax</code>&#x8FD9;&#x6837;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;<code class="literal">eax</code>&#x7684;&#x503C;&#x662F;&#x771F;&#x7684;&#x4ECE;&#x5185;&#x5B58;&#x5730;&#x5740;0x804a019&#x8BFB;&#x5230;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x4ECE;Cache&#x4E2D;&#x8BFB;&#x5230;&#x7684;&#xFF0C;&#x5982;&#x679C;Cache&#x5DF2;&#x7ECF;&#x7F13;&#x5B58;&#x4E86;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x6570;&#x636E;&#x5C31;&#x4ECE;Cache&#x8BFB;&#xFF0C;&#x5982;&#x679C;Cache&#x6CA1;&#x6709;&#x7F13;&#x5B58;&#x5C31;&#x4ECE;&#x5185;&#x5B58;&#x8BFB;&#xFF0C;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x90FD;&#x662F;&#x786C;&#x4EF6;&#x81EA;&#x52A8;&#x505A;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;&#x6307;&#x4EE4;&#x63A7;&#x5236;Cache&#x53BB;&#x505A;&#x7684;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5199;&#x7684;&#x6307;&#x4EE4;&#x4E2D;&#x53EA;&#x6709;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x6CA1;&#x6709;Cache&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x751A;&#x81F3;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;Cache&#x7684;&#x5B58;&#x5728;&#x3002;&#x540C;&#x6837;&#x9053;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x6267;&#x884C;&#x4E86;<code class="literal">mov    %al,0x804a01a</code>&#x8FD9;&#x6837;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x662F;&#x771F;&#x7684;&#x5199;&#x56DE;&#x5185;&#x5B58;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x53EA;&#x5199;&#x5230;&#x4E86;Cache&#x4E2D;&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x7531;Cache&#x5199;&#x56DE;&#x5185;&#x5B58;&#xFF0C;&#x5373;&#x4F7F;&#x53EA;&#x5199;&#x5230;&#x4E86;Cache&#x4E2D;&#x800C;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x5199;&#x56DE;&#x5185;&#x5B58;&#xFF0C;&#x4E0B;&#x6B21;&#x8BFB;0x804a01a&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x65F6;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x4ECE;Cache&#x4E2D;&#x8BFB;&#x5230;&#x4E0A;&#x6B21;&#x5199;&#x7684;&#x6570;&#x636E;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8BFB;&#x5199;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x65F6;Cache&#x7684;&#x5B58;&#x5728;&#x5C31;&#x4E0D;&#x5BB9;&#x5FFD;&#x89C6;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x88AB;Cache&#x7F13;&#x5B58;&#x4E86;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2780881"></a><p class="title"><b>&#x56FE;&#xA0;19.8.&#xA0;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x88AB;Cache&#x7F13;&#x5B58;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;</b></p><div class="figure-contents"><div><img src="images/asmc.nocache.png" alt="&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x88AB;Cache&#x7F13;&#x5B58;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;"></div></div></div><br class="figure-break"><p>&#x5982;&#x679C;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5730;&#x5740;&#x88AB;Cahce&#x7F13;&#x5B58;&#xFF0C;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x5BF9;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x5BC4;&#x5B58;&#x5668;&#x505A;&#x5199;&#x64CD;&#x4F5C;&#x90FD;&#x5199;&#x5230;Cache&#x4E2D;&#x53BB;&#x4E86;&#xFF0C;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x5BC4;&#x5B58;&#x5668;&#x5E76;&#x6CA1;&#x6709;&#x53CA;&#x65F6;&#x5F97;&#x5230;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x80FD;&#x53CA;&#x65F6;&#x53D1;&#x9001;&#xFF0C;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x5148;&#x540E;&#x53D1;&#x51FA;&#x7684;1&#x3001;2&#x3001;3&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#x90FD;&#x4F1A;&#x5199;&#x5230;Cache&#x4E2D;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x6700;&#x540E;Cache&#x4E2D;&#x53EA;&#x4FDD;&#x5B58;&#x4E86;&#x7B2C;3&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x65F6;Cache&#x628A;&#x6570;&#x636E;&#x5199;&#x56DE;&#x5230;&#x4E32;&#x53E3;&#x53D1;&#x9001;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x53EA;&#x80FD;&#x628A;&#x7B2C;3&#x4E2A;&#x5B57;&#x8282;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#x5C31;&#x4E22;&#x5931;&#x4E86;&#x3002;&#x4E0E;&#x6B64;&#x7C7B;&#x4F3C;&#xFF0C;&#x5982;&#x679C;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5730;&#x5740;&#x88AB;Cache&#x7F13;&#x5B58;&#xFF0C;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x5728;&#x8BFB;&#x7B2C;1&#x4E2A;&#x5B57;&#x8282;&#x65F6;&#xFF0C;Cache&#x4F1A;&#x4ECE;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x8BFB;&#x4E0A;&#x6765;&#x7F13;&#x5B58;&#xFF0C;&#x7136;&#x800C;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x540E;&#x9762;&#x6536;&#x5230;&#x7684;2&#x3001;3&#x4E24;&#x4E2A;&#x5B57;&#x8282;Cache&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x56E0;&#x4E3A;Cache&#x628A;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x5F53;&#x4F5C;&#x666E;&#x901A;&#x5185;&#x5B58;&#x5355;&#x5143;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x4FE1;&#x5185;&#x5B58;&#x5355;&#x5143;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x4F1A;&#x81EA;&#x5DF1;&#x53D8;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x6BCF;&#x6B21;&#x8BFB;&#x4E32;&#x53E3;&#x63A5;&#x6536;&#x5BC4;&#x5B58;&#x5668;&#x65F6;&#xFF0C;Cache&#x90FD;&#x4F1A;&#x628A;&#x7F13;&#x5B58;&#x7684;&#x7B2C;1&#x4E2A;&#x5B57;&#x8282;&#x63D0;&#x4F9B;&#x7ED9;CPU&#x6267;&#x884C;&#x5355;&#x5143;&#x3002;</p><p>&#x901A;&#x5E38;&#xFF0C;&#x6709;Cache&#x7684;&#x5E73;&#x53F0;&#x90FD;&#x6709;&#x529E;&#x6CD5;&#x5BF9;&#x67D0;&#x4E00;&#x6BB5;&#x5730;&#x5740;&#x8303;&#x56F4;&#x7981;&#x7528;Cache&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x5728;&#x9875;&#x8868;&#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x5141;&#x8BB8;Cache&#x7F13;&#x5B58;&#xFF0C;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x4E0D;&#x5141;&#x8BB8;Cache&#x7F13;&#x5B58;&#xFF0C;MMU&#x4E0D;&#x4EC5;&#x8981;&#x505A;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x548C;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x68C0;&#x67E5;&#xFF0C;&#x4E5F;&#x8981;&#x548C;Cache&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3002;</p><p>&#x9664;&#x4E86;&#x8BBE;&#x5907;&#x5BC4;&#x5B58;&#x5668;&#x9700;&#x8981;&#x7528;<code class="literal">volatile</code>&#x9650;&#x5B9A;&#x4E4B;&#x5916;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x88AB;&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x8BBF;&#x95EE;&#x65F6;&#x4E5F;&#x8981;&#x7528;<code class="literal">volatile</code>&#x9650;&#x5B9A;&#xFF0C;&#x6BD4;&#x5982;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x51FD;&#x6570;&#x548C;&#x591A;&#x7EBF;&#x7A0B;&#x3002;</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2780312" href="#id2780312" class="para">31</a>] </sup>&#x5B9E;&#x9645;&#x7684;&#x4E32;&#x53E3;&#x8BBE;&#x5907;&#x901A;&#x5E38;&#x6709;&#x4E00;&#x4E9B;&#x6807;&#x5FD7;&#x4F4D;&#x6307;&#x793A;&#x662F;&#x5426;&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x5E38;&#x8981;&#x5148;&#x67E5;&#x8BE2;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#x4F4D;&#x518D;&#x505A;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x6293;&#x4E3B;&#x8981;&#x77DB;&#x76FE;&#xFF0C;&#x5FFD;&#x7565;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch19s05.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch19.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch20.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">5.&#xA0;C&#x5185;&#x8054;&#x6C47;&#x7F16;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;20&#xA0;&#x7AE0;&#xA0;&#x94FE;&#x63A5;&#x8BE6;&#x89E3;</td></tr></tbody></table></div>
</body></html>