<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>5.&#xA0;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch20.html" title="&#x7B2C;&#xA0;20&#xA0;&#x7AE0;&#xA0;&#x94FE;&#x63A5;&#x8BE6;&#x89E3;"><link rel="prev" href="ch20s04.html" title="4.&#xA0;&#x5171;&#x4EAB;&#x5E93;"><link rel="next" href="ch21.html" title="&#x7B2C;&#xA0;21&#xA0;&#x7AE0;&#xA0;&#x9884;&#x5904;&#x7406;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">5.&#xA0;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch20s04.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;20&#xA0;&#x7AE0;&#xA0;&#x94FE;&#x63A5;&#x8BE6;&#x89E3;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch21.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2791323"></a>5.&#xA0;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;</h2></div></div></div><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5229;&#x7528;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x63D0;&#x4F9B;&#x7684;VA&#x5230;PA&#x7684;&#x8F6C;&#x6362;&#x673A;&#x5236;&#x5B9E;&#x73B0;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x3002;&#x6709;&#x4E86;&#x5171;&#x4EAB;&#x5E93;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x4E4B;&#x540E;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x7406;&#x89E3;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E86;&#x3002;&#x9996;&#x5148;&#x5206;&#x6790;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p><pre class="screen">$ ps
  PID TTY          TIME CMD
29977 pts/0    00:00:00 bash
30032 pts/0    00:00:00 ps
$ cat /proc/29977/maps 
08048000-080f4000 r-xp 00000000 08:15 688142     /bin/bash
080f4000-080f9000 rw-p 000ac000 08:15 688142     /bin/bash
080f9000-080fe000 rw-p 080f9000 00:00 0 
09283000-09497000 rw-p 09283000 00:00 0          [heap]
b7ca8000-b7cb2000 r-xp 00000000 08:15 581665     /lib/tls/i686/cmov/libnss_files-2.8.90.so
b7cb2000-b7cb3000 r--p 00009000 08:15 581665     /lib/tls/i686/cmov/libnss_files-2.8.90.so
b7cb3000-b7cb4000 rw-p 0000a000 08:15 581665     /lib/tls/i686/cmov/libnss_files-2.8.90.so
...
b7e15000-b7f6d000 r-xp 00000000 08:15 581656     /lib/tls/i686/cmov/libc-2.8.90.so
b7f6d000-b7f6f000 r--p 00158000 08:15 581656     /lib/tls/i686/cmov/libc-2.8.90.so
b7f6f000-b7f70000 rw-p 0015a000 08:15 581656     /lib/tls/i686/cmov/libc-2.8.90.so
...
b7fbd000-b7fd7000 r-xp 00000000 08:15 565466     /lib/ld-2.8.90.so
b7fd7000-b7fd8000 r-xp b7fd7000 00:00 0          [vdso]
b7fd8000-b7fd9000 r--p 0001a000 08:15 565466     /lib/ld-2.8.90.so
b7fd9000-b7fda000 rw-p 0001b000 08:15 565466     /lib/ld-2.8.90.so
bfac5000-bfada000 rw-p bffeb000 00:00 0          [stack]</pre><p>&#x7528;<code class="literal">ps</code>&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x5F53;&#x524D;&#x7EC8;&#x7AEF;&#x4E0B;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5F97;&#x77E5;<code class="literal">bash</code>&#x8FDB;&#x7A0B;&#x7684;id&#x662F;29977&#xFF0C;&#x7136;&#x540E;&#x7528;<code class="literal">cat /proc/29977/maps</code>&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x5B83;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;<code class="literal">/proc</code>&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x5185;&#x6838;&#x865A;&#x62DF;&#x51FA;&#x6765;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;<code class="literal">/proc</code>&#x4E0B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#xFF0C;&#x76EE;&#x5F55;&#x540D;&#x5C31;&#x662F;&#x8FDB;&#x7A0B;&#x7684;id&#xFF0C;&#x67E5;&#x770B;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7528;<code class="literal">pmap 29977</code>&#x547D;&#x4EE4;&#x4E5F;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7C7B;&#x4F3C;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p><div class="figure"><a id="id2791407"></a><p class="title"><b>&#x56FE;&#xA0;20.4.&#xA0;&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;</b></p><div class="figure-contents"><div><img src="images/link.addrspace.png" alt="&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;"></div></div></div><br class="figure-break"><p>&#x5728;<a class="xref" href="ch17s04.html#arch.mmu">&#x7B2C;&#xA0;4&#xA0;&#x8282; &#x201C;MMU&#x201D;</a>&#x8BB2;&#x8FC7;&#xFF0C;x86&#x5E73;&#x53F0;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;0x0000 0000~0xffff ffff&#xFF0C;&#x5927;&#x81F4;&#x4E0A;&#x524D;3GB&#xFF08;0x0000 0000~0xbfff ffff&#xFF09;&#x662F;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF0C;&#x540E;1GB&#xFF08;0xc000 0000~0xffff ffff&#xFF09;&#x662F;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x5F97;&#x5230;&#x4E86;&#x5370;&#x8BC1;&#x3002;0x0804 8000-0x080f 4000&#x662F;&#x4ECE;<code class="literal">/bin/bash</code>&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x4E3A;<code class="literal">r-x</code>&#xFF0C;&#x8868;&#x793A;Text Segment&#xFF0C;&#x5305;&#x542B;<code class="literal">.text</code>&#x6BB5;&#x3001;<code class="literal">.rodata</code>&#x6BB5;&#x3001;<code class="literal">.plt</code>&#x6BB5;&#x7B49;&#x3002;0x080f 4000-0x080f 9000&#x4E5F;&#x662F;&#x4ECE;<code class="literal">/bin/bash</code>&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x4E3A;<code class="literal">rw-</code>&#xFF0C;&#x8868;&#x793A;Data Segment&#xFF0C;&#x5305;&#x542B;<code class="literal">.data</code>&#x6BB5;&#x3001;<code class="literal">.bss</code>&#x6BB5;&#x7B49;&#x3002;</p><p>0x0928 3000-0x0949 7000&#x4E0D;&#x662F;&#x4ECE;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x8FD9;&#x6BB5;&#x7A7A;&#x95F4;&#x79F0;&#x4E3A;&#x5806;&#xFF08;Heap&#xFF09;<a id="id2791494" class="indexterm"></a>&#xFF0C;&#x4EE5;&#x540E;&#x4F1A;&#x8BB2;&#x5230;&#x7528;<code class="literal">malloc</code>&#x51FD;&#x6570;&#x52A8;&#x6001;&#x5206;&#x914D;&#x5185;&#x5B58;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x5206;&#x914D;&#x7684;&#x3002;&#x4ECE;0xb7ca 8000&#x5F00;&#x59CB;&#x662F;&#x5171;&#x4EAB;&#x5E93;&#x7684;&#x6620;&#x5C04;&#x7A7A;&#x95F4;&#xFF0C;&#x6BCF;&#x4E2A;&#x5171;&#x4EAB;&#x5E93;&#x4E5F;&#x5206;&#x4E3A;&#x51E0;&#x4E2A;Segment&#xFF0C;&#x6BCF;&#x4E2A;Segment&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4ECE;&#x5806;&#x7A7A;&#x95F4;&#x7684;&#x7ED3;&#x675F;&#x5730;&#x5740;&#xFF08;0x0949 7000&#xFF09;&#x5230;&#x5171;&#x4EAB;&#x5E93;&#x6620;&#x5C04;&#x7A7A;&#x95F4;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;&#xFF08;0xb7ca 8000&#xFF09;&#x4E4B;&#x95F4;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x6D1E;&#xFF0C;&#x5728;&#x52A8;&#x6001;&#x5206;&#x914D;&#x5185;&#x5B58;&#x65F6;&#x5806;&#x7A7A;&#x95F4;&#x662F;&#x53EF;&#x4EE5;&#x5411;&#x9AD8;&#x5730;&#x5740;&#x589E;&#x957F;&#x7684;&#x3002;&#x5806;&#x7A7A;&#x95F4;&#x7684;&#x5730;&#x5740;&#x4E0A;&#x9650;&#xFF08;0x09497000&#xFF09;&#x79F0;&#x4E3A;Break<a id="id2791525" class="indexterm"></a>&#xFF0C;&#x5806;&#x7A7A;&#x95F4;&#x8981;&#x5411;&#x9AD8;&#x5730;&#x5740;&#x589E;&#x957F;&#x5C31;&#x8981;&#x62AC;&#x9AD8;Break&#xFF0C;&#x6620;&#x5C04;&#x65B0;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x9875;&#x9762;&#x5230;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;<code class="literal">brk</code>&#x5B9E;&#x73B0;&#x7684;&#xFF0C;<code class="literal">malloc</code>&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x8C03;&#x7528;<code class="literal">brk</code>&#x5411;&#x5185;&#x6838;&#x8BF7;&#x6C42;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x3002;</p><p><code class="literal">/lib/ld-2.8.90.so</code>&#x5C31;&#x662F;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5668;<code class="literal">/lib/ld-linux.so.2</code>&#xFF0C;&#x540E;&#x8005;&#x662F;&#x524D;&#x8005;&#x7684;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x3002;&#x6807;&#x6709;<code class="literal">[vdso]</code>&#x7684;&#x5730;&#x5740;&#x8303;&#x56F4;&#x662F;<code class="literal">linux-gate.so.1</code>&#x7684;&#x6620;&#x5C04;&#x7A7A;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x8FC7;&#x8FD9;&#x4E2A;&#x5171;&#x4EAB;&#x5E93;&#x662F;&#x7531;&#x5185;&#x6838;&#x865A;&#x62DF;&#x51FA;&#x6765;&#x7684;&#x3002;0xbfac 5000-0xbfad a000&#x662F;&#x6808;&#x7A7A;&#x95F4;&#xFF0C;&#x5176;&#x4E2D;&#x9AD8;&#x5730;&#x5740;&#x7684;&#x90E8;&#x5206;&#x4FDD;&#x5B58;&#x7740;&#x8FDB;&#x7A0B;&#x7684;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x548C;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#xFF0C;&#x4F4E;&#x5730;&#x5740;&#x7684;&#x90E8;&#x5206;&#x4FDD;&#x5B58;&#x51FD;&#x6570;&#x6808;&#x5E27;&#xFF0C;&#x6808;&#x7A7A;&#x95F4;&#x662F;&#x5411;&#x4F4E;&#x5730;&#x5740;&#x589E;&#x957F;&#x7684;&#xFF0C;&#x4F46;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x5806;&#x7A7A;&#x95F4;&#x90A3;&#x4E48;&#x5927;&#x7684;&#x53EF;&#x4F9B;&#x589E;&#x957F;&#x7684;&#x4F59;&#x5730;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x52A8;&#x6001;&#x5206;&#x914D;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x7684;&#x5E76;&#x4E0D;&#x5C11;&#x89C1;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x51E0;&#x5341;&#x5C42;&#x6DF1;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5E76;&#x4E14;&#x6BCF;&#x5C42;&#x8C03;&#x7528;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x975E;&#x5E38;&#x5C11;&#x89C1;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x6808;&#x7A7A;&#x95F4;&#x662F;&#x53EF;&#x80FD;&#x7528;&#x5C3D;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6BD4;&#x5806;&#x7A7A;&#x95F4;&#x66F4;&#x5BB9;&#x6613;&#x7528;&#x5C3D;&#xFF0C;&#x5728;<a class="xref" href="ch05s03.html#func2.recursion">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x9012;&#x5F52;&#x201D;</a>&#x8BB2;&#x8FC7;&#xFF0C;&#x65E0;&#x7A77;&#x9012;&#x5F52;&#x4F1A;&#x7528;&#x5C3D;&#x6808;&#x7A7A;&#x95F4;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x6BB5;&#x9519;&#x8BEF;&#x3002;</p><p>&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x8D77;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x4ECE;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x7406;&#x89E3;&#x3002;</p><p>&#x7B2C;&#x4E00;&#xFF0C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;&#x7269;&#x7406;&#x5185;&#x5B58;&#x672C;&#x8EAB;&#x662F;&#x4E0D;&#x9650;&#x5236;&#x8BBF;&#x95EE;&#x7684;&#xFF0C;&#x4EFB;&#x4F55;&#x5730;&#x5740;&#x90FD;&#x53EF;&#x4EE5;&#x8BFB;&#x5199;&#xFF0C;&#x800C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8981;&#x6C42;&#x4E0D;&#x540C;&#x7684;&#x9875;&#x9762;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x8FD9;&#x662F;&#x5229;&#x7528;CPU&#x6A21;&#x5F0F;&#x548C;MMU&#x7684;&#x5185;&#x5B58;&#x4FDD;&#x62A4;&#x673A;&#x5236;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Text Segment&#x88AB;&#x53EA;&#x8BFB;&#x4FDD;&#x62A4;&#x8D77;&#x6765;&#xFF0C;&#x9632;&#x6B62;&#x88AB;&#x9519;&#x8BEF;&#x7684;&#x6307;&#x4EE4;&#x610F;&#x5916;&#x6539;&#x5199;&#xFF0C;&#x5185;&#x6838;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E5F;&#x88AB;&#x4FDD;&#x62A4;&#x8D77;&#x6765;&#xFF0C;&#x9632;&#x6B62;&#x5728;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x4E0B;&#x6267;&#x884C;&#x9519;&#x8BEF;&#x7684;&#x6307;&#x4EE4;&#x610F;&#x5916;&#x6539;&#x5199;&#x5185;&#x6838;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6267;&#x884C;&#x9519;&#x8BEF;&#x6307;&#x4EE4;&#x6216;&#x6076;&#x610F;&#x4EE3;&#x7801;&#x7684;&#x7834;&#x574F;&#x80FD;&#x529B;&#x53D7;&#x5230;&#x4E86;&#x9650;&#x5236;&#xFF0C;&#x9876;&#x591A;&#x4F7F;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x56E0;&#x6BB5;&#x9519;&#x8BEF;&#x7EC8;&#x6B62;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p><p>&#x7B2C;&#x4E8C;&#xFF0C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8BA9;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;&#x6240;&#x8C13;&#x72EC;&#x7ACB;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;&#x6307;&#xFF0C;&#x4E0D;&#x540C;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x540C;&#x4E00;&#x4E2A;VA&#x88AB;MMU&#x6620;&#x5C04;&#x5230;&#x4E0D;&#x540C;&#x7684;PA&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x8BBF;&#x95EE;&#x4EFB;&#x4F55;&#x5730;&#x5740;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7531;&#x4E8E;&#x6267;&#x884C;&#x9519;&#x8BEF;&#x6307;&#x4EE4;&#x6216;&#x6076;&#x610F;&#x4EE3;&#x7801;&#x5BFC;&#x81F4;&#x7684;&#x975E;&#x6CD5;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x90FD;&#x4E0D;&#x4F1A;&#x610F;&#x5916;&#x6539;&#x5199;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x72EC;&#x5360;&#x6574;&#x4E2A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x6837;&#x94FE;&#x63A5;&#x5668;&#x548C;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#x4F1A;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#xFF0C;&#x4E0D;&#x5FC5;&#x8003;&#x8651;&#x5404;&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#x8303;&#x56F4;&#x662F;&#x5426;&#x51B2;&#x7A81;&#x3002;</p><p>&#x7EE7;&#x7EED;&#x524D;&#x9762;&#x7684;&#x5B9E;&#x9A8C;&#xFF0C;&#x518D;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#xFF0C;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;<code class="literal">bash</code>&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x548C;&#x5148;&#x524D;&#x7684;<code class="literal">bash</code>&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x5E03;&#x5C40;&#x5DEE;&#x4E0D;&#x591A;&#xFF1A;</p><pre class="screen">$ ps
  PID TTY          TIME CMD
30697 pts/1    00:00:00 bash
30749 pts/1    00:00:00 ps
$ cat /proc/30697/maps
08048000-080f4000 r-xp 00000000 08:15 688142     /bin/bash
080f4000-080f9000 rw-p 000ac000 08:15 688142     /bin/bash
080f9000-080fe000 rw-p 080f9000 00:00 0 
082d7000-084f9000 rw-p 082d7000 00:00 0          [heap]
b7cf1000-b7cfb000 r-xp 00000000 08:15 581665     /lib/tls/i686/cmov/libnss_files-2.8.90.so
b7cfb000-b7cfc000 r--p 00009000 08:15 581665     /lib/tls/i686/cmov/libnss_files-2.8.90.so
b7cfc000-b7cfd000 rw-p 0000a000 08:15 581665     /lib/tls/i686/cmov/libnss_files-2.8.90.so
...
b7e5e000-b7fb6000 r-xp 00000000 08:15 581656     /lib/tls/i686/cmov/libc-2.8.90.so
b7fb6000-b7fb8000 r--p 00158000 08:15 581656     /lib/tls/i686/cmov/libc-2.8.90.so
b7fb8000-b7fb9000 rw-p 0015a000 08:15 581656     /lib/tls/i686/cmov/libc-2.8.90.so
...
b8006000-b8020000 r-xp 00000000 08:15 565466     /lib/ld-2.8.90.so
b8020000-b8021000 r-xp b8020000 00:00 0          [vdso]
b8021000-b8022000 r--p 0001a000 08:15 565466     /lib/ld-2.8.90.so
b8022000-b8023000 rw-p 0001b000 08:15 565466     /lib/ld-2.8.90.so
bff0e000-bff23000 rw-p bffeb000 00:00 0          [stack]</pre><p>&#x8BE5;&#x8FDB;&#x7A0B;&#x4E5F;&#x5360;&#x7528;&#x4E86;0x0000 0000-0xbfff ffff&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;Text Segment&#x4E5F;&#x662F;0x0804 8000-0x080f 4000&#xFF0C;Data Segment&#x4E5F;&#x662F;0x080f 4000-0x080f 9000&#xFF0C;&#x548C;&#x5148;&#x524D;&#x7684;&#x8FDB;&#x7A0B;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x94FE;&#x63A5;&#x65F6;&#x5199;&#x8FDB;<code class="literal">/bin/bash</code>&#x8FD9;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#xFF0C;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x52A0;&#x8F7D;&#x5B83;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7740;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;Data Segment&#x5360;&#x7528;&#x76F8;&#x540C;&#x7684;VA&#xFF0C;&#x4F46;&#x662F;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x5404;&#x81EA;&#x5E72;&#x5404;&#x81EA;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x663E;&#x7136;Data Segment&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x76F8;&#x540C;&#x7684;VA&#x600E;&#x4E48;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x88AB;&#x6620;&#x5C04;&#x5230;&#x4E0D;&#x540C;&#x7684;PA&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2791724"></a><p class="title"><b>&#x56FE;&#xA0;20.5.&#xA0;&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;&#x72EC;&#x7ACB;&#x7684;</b></p><div class="figure-contents"><div><img src="images/link.sepva.png" alt="&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;&#x72EC;&#x7ACB;&#x7684;"></div></div></div><br class="figure-break"><p>&#x4ECE;&#x56FE;&#x4E2D;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x662F;<code class="literal">bash</code>&#x8FDB;&#x7A0B;&#xFF0C;Text Segment&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5E76;&#x4E14;Text Segment&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x88AB;&#x6539;&#x5199;&#xFF0C;&#x56E0;&#x6B64;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5B89;&#x6392;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;Text Segment&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x7269;&#x7406;&#x9875;&#x9762;&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5957;VA&#x5230;PA&#x7684;&#x6620;&#x5C04;&#x8868;&#xFF0C;&#x6574;&#x4E2A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;VA&#x90FD;&#x5728;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x81EA;&#x5DF1;&#x7684;&#x6620;&#x5C04;&#x8868;&#x4E2D;&#x67E5;&#x627E;&#x76F8;&#x5E94;&#x7684;PA&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x53EF;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x53EF;&#x80FD;&#x610F;&#x5916;&#x6539;&#x5199;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x636E;&#x3002;</p><p>&#x53E6;&#x5916;&#xFF0C;&#x6CE8;&#x610F;&#x5230;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5171;&#x4EAB;&#x5E93;&#x52A0;&#x8F7D;&#x5730;&#x5740;&#x5E76;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x5171;&#x4EAB;&#x5E93;&#x7684;&#x52A0;&#x8F7D;&#x5730;&#x5740;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5199;&#x5728;<code class="literal">/bin/bash</code>&#x8FD9;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x4F46;&#x5373;&#x4F7F;&#x5982;&#x6B64;&#xFF0C;&#x4E5F;&#x4E0D;&#x5F71;&#x54CD;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7269;&#x7406;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x5171;&#x4EAB;&#x5E93;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x53EA;&#x6709;&#x53EA;&#x8BFB;&#x7684;&#x90E8;&#x5206;&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF0C;&#x53EF;&#x8BFB;&#x53EF;&#x5199;&#x7684;&#x90E8;&#x5206;&#x4E0D;&#x5171;&#x4EAB;&#x3002;</p><p>&#x4F7F;&#x7528;&#x5171;&#x4EAB;&#x5E93;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x8282;&#x7701;&#x5185;&#x5B58;&#x3002;&#x6BD4;&#x5982;<code class="literal">libc</code>&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x8FDB;&#x7A0B;&#x90FD;&#x6620;&#x5C04;<code class="literal">libc</code>&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;<code class="literal">libc</code>&#x7684;&#x53EA;&#x8BFB;&#x90E8;&#x5206;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x53EA;&#x9700;&#x8981;&#x5B58;&#x5728;&#x4E00;&#x4EFD;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x5171;&#x4EAB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x201C;<span class="quote">&#x5171;&#x4EAB;&#x5E93;</span>&#x201D;&#x8FD9;&#x4E2A;&#x540D;&#x79F0;&#x7684;&#x7531;&#x6765;&#x4E86;&#x3002;</p><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x5171;&#x4EAB;&#x5E93;&#x5FC5;&#x987B;&#x662F;&#x4F4D;&#x7F6E;&#x65E0;&#x5173;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x6BD4;&#x5982;<code class="literal">libc</code>&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8FDB;&#x7A0B;&#x867D;&#x7136;&#x5171;&#x4EAB;<code class="literal">libc</code>&#x6240;&#x5728;&#x7684;&#x7269;&#x7406;&#x9875;&#x9762;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x7269;&#x7406;&#x9875;&#x9762;&#x88AB;&#x6620;&#x5C04;&#x5230;&#x5404;&#x8FDB;&#x7A0B;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x65F6;&#x5374;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x6C42;<code class="literal">libc</code>&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x7BA1;&#x52A0;&#x8F7D;&#x5230;&#x4EC0;&#x4E48;&#x5730;&#x5740;&#x90FD;&#x80FD;&#x6B63;&#x786E;&#x6267;&#x884C;&#x3002;</p><p>&#x7B2C;&#x4E09;&#xFF0C;VA&#x5230;PA&#x7684;&#x6620;&#x5C04;&#x4F1A;&#x7ED9;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x5E26;&#x6765;&#x65B9;&#x4FBF;&#xFF0C;&#x7269;&#x7406;&#x5730;&#x5740;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;&#x51E0;&#x5757;&#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x6210;&#x865A;&#x62DF;&#x5730;&#x5740;&#x8FDE;&#x7EED;&#x7684;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x3002;&#x6BD4;&#x5982;&#x8981;&#x7528;<code class="literal">malloc</code>&#x5206;&#x914D;&#x4E00;&#x5757;&#x5F88;&#x5927;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x7A7A;&#x95F2;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x5927;&#x7684;<span class="emphasis"><em>&#x8FDE;&#x7EED;</em></span>&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x5206;&#x914D;&#x591A;&#x4E2A;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;&#x7269;&#x7406;&#x9875;&#x9762;&#x800C;&#x6620;&#x5C04;&#x5230;&#x8FDE;&#x7EED;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x8303;&#x56F4;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2791851"></a><p class="title"><b>&#x56FE;&#xA0;20.6.&#xA0;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;PA&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x4E3A;&#x8FDE;&#x7EED;&#x7684;VA</b></p><div class="figure-contents"><div><img src="images/link.discontpa.png" alt="&#x4E0D;&#x8FDE;&#x7EED;&#x7684;PA&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x4E3A;&#x8FDE;&#x7EED;&#x7684;VA"></div></div></div><br class="figure-break"><p>&#x7B2C;&#x56DB;&#xFF0C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5982;&#x679C;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7740;&#x5F88;&#x591A;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E3A;&#x5404;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x4E4B;&#x548C;&#x53EF;&#x80FD;&#x4F1A;&#x5927;&#x4E8E;&#x5B9E;&#x9645;&#x53EF;&#x7528;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4F7F;&#x5F97;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5404;&#x8FDB;&#x7A0B;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;&#x56E0;&#x4E3A;&#x5404;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x8FD9;&#x4E9B;&#x9875;&#x9762;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x5230;&#x7269;&#x7406;&#x9875;&#x9762;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E34;&#x65F6;&#x4FDD;&#x5B58;&#x5230;&#x78C1;&#x76D8;&#x4E0A;&#x800C;&#x4E0D;&#x5360;&#x7528;&#x7269;&#x7406;&#x9875;&#x9762;&#xFF0C;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x4E34;&#x65F6;&#x4FDD;&#x5B58;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x9875;&#x9762;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x5206;&#x533A;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#xFF0C;&#x79F0;&#x4E3A;&#x4EA4;&#x6362;&#x8BBE;&#x5907;&#xFF08;Swap Device&#xFF09;<a id="id2791885" class="indexterm"></a>&#x3002;&#x5F53;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x7528;&#x65F6;&#xFF0C;&#x5C06;&#x4E00;&#x4E9B;&#x4E0D;&#x5E38;&#x7528;&#x7684;&#x7269;&#x7406;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E34;&#x65F6;&#x4FDD;&#x5B58;&#x5230;&#x4EA4;&#x6362;&#x8BBE;&#x5907;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x7269;&#x7406;&#x9875;&#x9762;&#x5C31;&#x8BA4;&#x4E3A;&#x662F;&#x7A7A;&#x95F2;&#x7684;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x7ED9;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x6362;&#x51FA;&#xFF08;Page out&#xFF09;<a id="id2791897" class="indexterm"></a>&#x3002;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x8981;&#x7528;&#x5230;&#x88AB;&#x6362;&#x51FA;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5C31;&#x4ECE;&#x4EA4;&#x6362;&#x8BBE;&#x5907;&#x518D;&#x52A0;&#x8F7D;&#x56DE;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x6362;&#x5165;&#xFF08;Page in&#xFF09;<a id="id2791906" class="indexterm"></a>&#x3002;&#x6362;&#x51FA;&#x548C;&#x6362;&#x5165;&#x64CD;&#x4F5C;&#x7EDF;&#x79F0;&#x4E3A;&#x6362;&#x9875;&#xFF08;Paging&#xFF09;<a id="id2791913" class="indexterm"></a>&#xFF0C;&#x56E0;&#x6B64;&#xFF1A;</p><div class="literallayout"><p>&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x603B;&#x91CF;&#xA0;=&#xA0;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#xA0;+&#xA0;&#x4EA4;&#x6362;&#x8BBE;&#x5907;&#x7684;&#x5927;&#x5C0F;</p></div><p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;&#x7B2C;&#x4E00;&#x5F20;&#x56FE;&#x662F;&#x6362;&#x51FA;&#xFF0C;&#x5C06;&#x7269;&#x7406;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5230;&#x78C1;&#x76D8;&#xFF0C;&#x5E76;&#x89E3;&#x9664;&#x5730;&#x5740;&#x6620;&#x5C04;&#xFF0C;&#x91CA;&#x653E;&#x7269;&#x7406;&#x9875;&#x9762;&#x3002;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#x662F;&#x6362;&#x5165;&#xFF0C;&#x4ECE;&#x7A7A;&#x95F2;&#x7684;&#x7269;&#x7406;&#x9875;&#x9762;&#x4E2D;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#xFF0C;&#x5C06;&#x78C1;&#x76D8;&#x6682;&#x5B58;&#x7684;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x56DE;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x5EFA;&#x7ACB;&#x5730;&#x5740;&#x6620;&#x5C04;&#x3002;</p><div class="figure"><a id="id2791937"></a><p class="title"><b>&#x56FE;&#xA0;20.7.&#xA0;&#x6362;&#x9875;</b></p><div class="figure-contents"><div><img src="images/link.swap.png" alt="&#x6362;&#x9875;"></div></div></div><br class="figure-break"></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch20s04.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch20.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch21.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">4.&#xA0;&#x5171;&#x4EAB;&#x5E93;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;21&#xA0;&#x7AE0;&#xA0;&#x9884;&#x5904;&#x7406;</td></tr></tbody></table></div>
</body></html>