<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x9884;&#x5904;&#x7406;&#x7684;&#x6B65;&#x9AA4;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch21.html" title="&#x7B2C;&#xA0;21&#xA0;&#x7AE0;&#xA0;&#x9884;&#x5904;&#x7406;"><link rel="prev" href="ch21.html" title="&#x7B2C;&#xA0;21&#xA0;&#x7AE0;&#xA0;&#x9884;&#x5904;&#x7406;"><link rel="next" href="ch21s02.html" title="2.&#xA0;&#x5B8F;&#x5B9A;&#x4E49;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x9884;&#x5904;&#x7406;&#x7684;&#x6B65;&#x9AA4;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch21.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;21&#xA0;&#x7AE0;&#xA0;&#x9884;&#x5904;&#x7406;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch21s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2796242"></a>1.&#xA0;&#x9884;&#x5904;&#x7406;&#x7684;&#x6B65;&#x9AA4;</h2></div></div></div><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5168;&#x9762;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;C&#x7F16;&#x8BD1;&#x5668;&#x505A;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x4E4B;&#x524D;&#x7684;&#x9884;&#x5904;&#x7406;&#x6B65;&#x9AA4;&#xFF1A;</p><p>1&#x3001;&#x628A;<a class="xref" href="ch02s02.html#expr.constant">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;&#x5E38;&#x91CF;&#x201D;</a>&#x63D0;&#x5230;&#x8FC7;&#x7684;&#x4E09;&#x8FDE;&#x7B26;&#x66FF;&#x6362;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x5355;&#x5B57;&#x7B26;&#x3002;</p><p>2&#x3001;&#x628A;&#x7528;<code class="literal">\</code>&#x5B57;&#x7B26;&#x7EED;&#x884C;&#x7684;&#x591A;&#x884C;&#x4EE3;&#x7801;&#x63A5;&#x6210;&#x4E00;&#x884C;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">#define STR &quot;hello, &quot;\
		&quot;world&quot;</pre><p>&#x7ECF;&#x8FC7;&#x8FD9;&#x4E2A;&#x9884;&#x5904;&#x7406;&#x6B65;&#x9AA4;&#x4E4B;&#x540E;&#x63A5;&#x6210;&#x4E00;&#x884C;&#xFF1A;</p><pre class="programlisting">#define STR &quot;hello, &quot;		&quot;world&quot;</pre><p>&#x8FD9;&#x79CD;&#x7EED;&#x884C;&#x7684;&#x5199;&#x6CD5;&#x8981;&#x6C42;<code class="literal">\</code>&#x540E;&#x9762;&#x7D27;&#x8DDF;&#x6362;&#x884C;&#xFF0C;&#x4E2D;&#x95F4;&#x4E0D;&#x80FD;&#x6709;&#x5176;&#x5B83;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x3002;</p><p>3&#x3001;&#x628A;&#x6CE8;&#x91CA;&#xFF08;&#x4E0D;&#x7BA1;&#x662F;&#x5355;&#x884C;&#x6CE8;&#x91CA;&#x8FD8;&#x662F;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#xFF09;&#x90FD;&#x66FF;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x3002;</p><p>4&#x3001;&#x7ECF;&#x8FC7;&#x4EE5;&#x4E0A;&#x4E24;&#x6B65;&#x4E4B;&#x540E;&#x53BB;&#x6389;&#x4E86;&#x4E00;&#x4E9B;&#x6362;&#x884C;&#xFF0C;&#x6709;&#x7684;&#x6362;&#x884C;&#x5728;&#x7EED;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x53BB;&#x6389;&#x4E86;&#xFF0C;&#x6709;&#x7684;&#x6362;&#x884C;&#x5728;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x4E4B;&#x4E2D;&#xFF0C;&#x4E5F;&#x968F;&#x7740;&#x6CE8;&#x91CA;&#x4E00;&#x8D77;&#x53BB;&#x6389;&#x4E86;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#x884C;&#x79F0;&#x4E3A;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x884C;&#x3002;&#x7136;&#x540E;&#x9884;&#x5904;&#x7406;&#x5668;&#x628A;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x884C;&#x5212;&#x5206;&#x6210;Token&#x548C;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF0C;&#x8FD9;&#x65F6;&#x7684;Token&#x79F0;&#x4E3A;&#x9884;&#x5904;&#x7406;Token&#xFF0C;&#x5305;&#x62EC;&#x6807;&#x8BC6;&#x7B26;&#x3001;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x3001;&#x6D6E;&#x70B9;&#x6570;&#x5E38;&#x91CF;&#x3001;&#x5B57;&#x7B26;&#x5E38;&#x91CF;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x5176;&#x5B83;&#x7B26;&#x53F7;&#x3002;&#x7EE7;&#x7EED;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E24;&#x4E2A;&#x6E90;&#x4EE3;&#x7801;&#x884C;&#x88AB;&#x63A5;&#x6210;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x884C;&#x88AB;&#x5212;&#x5206;&#x6210;Token&#x548C;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF1A;<code class="literal">#</code>&#xFF0C;<code class="literal">define</code>&#xFF0C;&#x7A7A;&#x683C;&#xFF0C;<code class="literal">STR</code>&#xFF0C;&#x7A7A;&#x683C;&#xFF0C;<code class="literal">&quot;hello, &quot;</code>&#xFF0C;Tab&#xFF0C;Tab&#xFF0C;<code class="literal">&quot;world&quot;</code>&#x3002;</p><p>5&#x3001;&#x5728;Token&#x4E2D;&#x8BC6;&#x522B;&#x51FA;&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#xFF0C;&#x505A;&#x76F8;&#x5E94;&#x7684;&#x9884;&#x5904;&#x7406;&#x52A8;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;<code class="literal">#include</code>&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#xFF0C;&#x5219;&#x628A;&#x76F8;&#x5E94;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x5305;&#x542B;&#x8FDB;&#x6765;&#xFF0C;&#x5E76;&#x5BF9;&#x6E90;&#x6587;&#x4EF6;&#x505A;&#x4EE5;&#x4E0A;1-4&#x6B65;&#x9884;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;&#x9047;&#x5230;&#x5B8F;&#x5B9A;&#x4E49;&#x5219;&#x505A;&#x5B8F;&#x5C55;&#x5F00;&#x3002;</p><p>&#x6211;&#x4EEC;&#x65E9;&#x5728;<a class="xref" href="ch08s02.html#array.statistic">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;&#x6570;&#x7EC4;&#x5E94;&#x7528;&#x5B9E;&#x4F8B;&#xFF1A;&#x7EDF;&#x8BA1;&#x968F;&#x673A;&#x6570;&#x201D;</a>&#x5C31;&#x8BA4;&#x8BC6;&#x4E86;&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x73B0;&#x5728;&#x7ED9;&#x51FA;&#x5B83;&#x7684;&#x4E25;&#x683C;&#x5B9A;&#x4E49;&#x3002;&#x4E00;&#x6761;&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#x7531;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x884C;&#x7EC4;&#x6210;&#xFF0C;&#x4EE5;<code class="literal">#</code>&#x5F00;&#x5934;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x82E5;&#x5E72;&#x4E2A;&#x9884;&#x5904;&#x7406;Token&#xFF0C;&#x5728;&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#x4E2D;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x7684;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x53EA;&#x6709;&#x7A7A;&#x683C;&#x548C;Tab&#x3002;</p><p>6&#x3001;&#x627E;&#x51FA;&#x5B57;&#x7B26;&#x5E38;&#x91CF;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x8F6C;&#x4E49;&#x5E8F;&#x5217;&#xFF0C;&#x7528;&#x76F8;&#x5E94;&#x7684;&#x5B57;&#x8282;&#x6765;&#x66FF;&#x6362;&#x5B83;&#xFF0C;&#x6BD4;&#x5982;&#x628A;<code class="literal">\n</code>&#x66FF;&#x6362;&#x6210;&#x5B57;&#x8282;0x0a&#x3002;</p><p>7&#x3001;&#x628A;&#x76F8;&#x90BB;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x7EE7;&#x7EED;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E2D;&#x6709;&#xFF1A;</p><pre class="programlisting">printf(
	STR);</pre><p>&#x7ECF;&#x8FC7;&#x7B2C;4&#x6B65;&#x5904;&#x7406;&#x5212;&#x5206;&#x6210;&#x4EE5;&#x4E0B;Token&#xFF1A;<code class="literal">printf</code>&#xFF0C;<code class="literal">(</code>&#xFF0C;&#x6362;&#x884C;&#xFF0C;Tab&#xFF0C;<code class="literal">STR</code>&#xFF0C;<code class="literal">)</code>&#xFF0C;<code class="literal">;</code>&#xFF0C;&#x6362;&#x884C;&#x3002;&#x7ECF;&#x8FC7;&#x7B2C;5&#x6B65;&#x5B8F;&#x5C55;&#x5F00;&#x540E;&#x53D8;&#x6210;&#x4EE5;&#x4E0B;Token&#xFF1A;<code class="literal">printf</code>&#xFF0C;<code class="literal">(</code>&#xFF0C;&#x6362;&#x884C;&#xFF0C;Tab&#xFF0C;<code class="literal">&quot;hello, &quot;</code>&#xFF0C;Tab&#xFF0C;Tab&#xFF0C;<code class="literal">&quot;world&quot;</code>&#xFF0C;<code class="literal">)</code>&#xFF0C;<code class="literal">;</code>&#xFF0C;&#x6362;&#x884C;&#x3002;&#x7136;&#x540E;&#x628A;&#x76F8;&#x90BB;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x53D8;&#x6210;&#x4EE5;&#x4E0B;Token&#xFF1A;<code class="literal">printf</code>&#xFF0C;<code class="literal">(</code>&#xFF0C;&#x6362;&#x884C;&#xFF0C;Tab&#xFF0C;<code class="literal">&quot;hello, world&quot;</code>&#xFF0C;<code class="literal">)</code>&#xFF0C;<code class="literal">;</code>&#xFF0C;&#x6362;&#x884C;&#x3002;</p><p>8&#x3001;&#x7ECF;&#x8FC7;&#x4EE5;&#x4E0A;&#x5904;&#x7406;&#x4E4B;&#x540E;&#xFF0C;&#x628A;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x4E22;&#x6389;&#xFF0C;&#x628A;Token&#x4EA4;&#x7ED9;C&#x7F16;&#x8BD1;&#x5668;&#x505A;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x4E0D;&#x518D;&#x662F;&#x9884;&#x5904;&#x7406;Token&#xFF0C;&#x800C;&#x79F0;&#x4E3A;C Token&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x4E22;&#x6389;&#x7684;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x5305;&#x62EC;&#x7A7A;&#x683C;&#x3001;&#x6362;&#x884C;&#x3001;&#x6C34;&#x5E73;Tab&#x3001;&#x5782;&#x76F4;Tab&#x3001;&#x5206;&#x9875;&#x7B26;&#x3002;&#x7EE7;&#x7EED;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6700;&#x540E;&#x4EA4;&#x7ED9;C&#x7F16;&#x8BD1;&#x5668;&#x505A;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x7684;Token&#x662F;&#xFF1A;<code class="literal">printf</code>&#xFF0C;<code class="literal">(</code>&#xFF0C;<code class="literal">&quot;hello, world&quot;</code>&#xFF0C;<code class="literal">)</code>&#xFF0C;<code class="literal">;</code>&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#x5199;&#x6210;&#x591A;&#x884C;&#x8981;&#x7528;<code class="literal">\</code>&#x7EED;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#xFF0C;&#x4E00;&#x6761;&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#x53EA;&#x80FD;&#x7531;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x884C;&#x7EC4;&#x6210;&#xFF0C;&#x800C;&#x628A;C&#x4EE3;&#x7801;&#x5199;&#x6210;&#x591A;&#x884C;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x7528;<code class="literal">\</code>&#x7EED;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x6362;&#x884C;&#x5728;C&#x4EE3;&#x7801;&#x4E2D;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x79CD;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF0C;&#x5728;&#x505A;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x65F6;&#x6240;&#x6709;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x90FD;&#x5DF2;&#x7ECF;&#x4E22;&#x6389;&#x4E86;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch21.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch21.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch21s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;21&#xA0;&#x7AE0;&#xA0;&#x9884;&#x5904;&#x7406;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x5B8F;&#x5B9A;&#x4E49;</td></tr></tbody></table></div>
</body></html>