<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x6307;&#x9488;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch23.html" title="&#x7B2C;&#xA0;23&#xA0;&#x7AE0;&#xA0;&#x6307;&#x9488;"><link rel="prev" href="ch23.html" title="&#x7B2C;&#xA0;23&#xA0;&#x7AE0;&#xA0;&#x6307;&#x9488;"><link rel="next" href="ch23s02.html" title="2.&#xA0;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x6307;&#x9488;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch23.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;23&#xA0;&#x7AE0;&#xA0;&#x6307;&#x9488;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch23s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2809880"></a>1.&#xA0;&#x6307;&#x9488;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</h2></div></div></div><p>&#x5728;<a class="xref" href="ch12.html#stackqueue">&#x7B2C;&#xA0;12&#xA0;&#x7AE0; <i>&#x6808;&#x4E0E;&#x961F;&#x5217;</i></a>&#x8BB2;&#x8FC7;&#xFF0C;&#x5806;&#x6808;&#x6709;&#x6808;&#x9876;&#x6307;&#x9488;&#xFF0C;&#x961F;&#x5217;&#x6709;&#x5934;&#x6307;&#x9488;&#x548C;&#x5C3E;&#x6307;&#x9488;&#xFF0C;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x4E2D;&#x7684;&#x201C;<span class="quote">&#x6307;&#x9488;</span>&#x201D;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x662F;&#x6570;&#x7EC4;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x901A;&#x8FC7;&#x6307;&#x9488;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x5728;<a class="xref" href="ch20s04.html#link.indirect">&#x56FE;&#xA0;20.3 &#x201C;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x201D;</a>&#x6211;&#x4EEC;&#x53C8;&#x770B;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x6307;&#x9488;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6240;&#x5728;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#x7684;&#x5730;&#x5740;&#x4FDD;&#x5B58;&#x5728;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x4FDD;&#x5B58;&#x5730;&#x5740;&#x7684;&#x8FD9;&#x4E2A;&#x5185;&#x5B58;&#x5355;&#x5143;&#x79F0;&#x4E3A;&#x6307;&#x9488;&#xFF0C;&#x901A;&#x8FC7;&#x6307;&#x9488;&#x548C;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x8BBF;&#x95EE;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x79CD;&#x6307;&#x9488;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x8868;&#x793A;&#xFF0C;&#x4F8B;&#x5982;&#x67D0;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4EE5;&#x4E0B;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF1A;</p><pre class="programlisting">int i;
int *pi = &amp;i;
char c;
char *pc = &amp;c;</pre><p>&#x8FD9;&#x51E0;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5728;&#x521D;&#x5B66;&#x9636;&#x6BB5;&#x7ECF;&#x5E38;&#x8981;&#x501F;&#x52A9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x6765;&#x7406;&#x89E3;&#x6307;&#x9488;&#x3002;</p><div class="figure"><a id="id2810538"></a><p class="title"><b>&#x56FE;&#xA0;23.1.&#xA0;&#x6307;&#x9488;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</b></p><div class="figure-contents"><div><img src="images/pointer.pointer0.png" alt="&#x6307;&#x9488;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;"></div></div></div><br class="figure-break"><p>&#x8FD9;&#x91CC;&#x7684;<code class="literal">&amp;</code>&#x662F;&#x53D6;&#x5730;&#x5740;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;Address Operator&#xFF09;<a id="id2810563" class="indexterm"></a>&#xFF0C;<code class="literal">&amp;i</code>&#x8868;&#x793A;&#x53D6;&#x53D8;&#x91CF;<code class="literal">i</code>&#x7684;&#x5730;&#x5740;&#xFF0C;<code class="literal">int *pi = &amp;i;</code>&#x8868;&#x793A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6307;&#x5411;<code class="literal">int</code>&#x578B;&#x7684;&#x6307;&#x9488;&#x53D8;&#x91CF;<code class="literal">pi</code>&#xFF0C;&#x5E76;&#x7528;<code class="literal">i</code>&#x7684;&#x5730;&#x5740;&#x6765;&#x521D;&#x59CB;&#x5316;<code class="literal">pi</code>&#x3002;&#x6211;&#x4EEC;&#x8BB2;&#x8FC7;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x7528;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x5B9A;&#x4E49;<code class="literal">int p = i;</code>&#x5C31;&#x9519;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;<code class="literal">i</code>&#x4E0D;&#x662F;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x7136;&#x800C;&#x7528;<code class="literal">i</code>&#x7684;&#x5730;&#x5740;&#x6765;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x5374;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x56E0;&#x4E3A;<code class="literal">i</code>&#x7684;&#x5730;&#x5740;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x94FE;&#x63A5;&#x65F6;&#x80FD;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5230;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x77E5;&#x9053;&#xFF0C;<code class="literal">&amp;i</code>&#x662F;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x540E;&#x9762;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x578B;&#x53D8;&#x91CF;<code class="literal">c</code>&#x548C;&#x4E00;&#x4E2A;&#x6307;&#x5411;<code class="literal">c</code>&#x7684;&#x5B57;&#x7B26;&#x578B;&#x6307;&#x9488;<code class="literal">pc</code>&#xFF0C;&#x6CE8;&#x610F;<code class="literal">pi</code>&#x548C;<code class="literal">pc</code>&#x867D;&#x7136;&#x662F;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#x90FD;&#x5360;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x4FDD;&#x5B58;32&#x4F4D;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x540C;&#x7406;&#xFF0C;&#x5728;64&#x4F4D;&#x5E73;&#x53F0;&#x4E0A;&#x6307;&#x9488;&#x53D8;&#x91CF;&#x90FD;&#x5360;8&#x4E2A;&#x5B57;&#x8282;&#x3002;</p><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x4E2D;&#x5B9A;&#x4E49;&#x591A;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x8981;&#x6709;<code class="literal">[]</code>&#x53F7;&#xFF1A;<code class="literal">int a[5], b[5];</code>&#x3002;&#x540C;&#x6837;&#x9053;&#x7406;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x4E2D;&#x5B9A;&#x4E49;&#x591A;&#x4E2A;&#x6307;&#x9488;&#x53D8;&#x91CF;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x8981;&#x6709;<code class="literal">*</code>&#x53F7;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int *p, *q;</pre><p>&#x5982;&#x679C;&#x5199;&#x6210;<code class="literal">int* p, q;</code>&#x5C31;&#x9519;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6574;&#x578B;&#x6307;&#x9488;<code class="literal">p</code>&#x548C;&#x4E00;&#x4E2A;&#x6574;&#x578B;&#x53D8;&#x91CF;<code class="literal">q</code>&#xFF0C;&#x5B9A;&#x4E49;&#x6570;&#x7EC4;&#x7684;<code class="literal">[]</code>&#x53F7;&#x5199;&#x5728;&#x53D8;&#x91CF;&#x540E;&#x9762;&#xFF0C;&#x800C;&#x5B9A;&#x4E49;&#x6307;&#x9488;&#x7684;<code class="literal">*</code>&#x53F7;&#x5199;&#x5728;&#x53D8;&#x91CF;&#x524D;&#x9762;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x770B;&#x9519;&#x3002;&#x5B9A;&#x4E49;&#x6307;&#x9488;&#x7684;<code class="literal">*</code>&#x53F7;&#x524D;&#x540E;&#x7A7A;&#x683C;&#x90FD;&#x53EF;&#x4EE5;&#x7701;&#xFF0C;&#x5199;&#x6210;<code class="literal">int*p,*q;</code>&#x4E5F;&#x7B97;&#x5BF9;&#xFF0C;&#x4F46;<code class="literal">*</code>&#x53F7;&#x901A;&#x5E38;&#x548C;&#x7C7B;&#x578B;<code class="literal">int</code>&#x4E4B;&#x95F4;&#x7559;&#x7A7A;&#x683C;&#x800C;&#x548C;&#x53D8;&#x91CF;&#x540D;&#x5199;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x6837;&#x770B;<code class="literal">int *p, q;</code>&#x5C31;&#x5F88;&#x660E;&#x663E;&#x662F;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x548C;&#x4E00;&#x4E2A;&#x6574;&#x578B;&#x53D8;&#x91CF;&#xFF0C;&#x5C31;&#x4E0D;&#x5BB9;&#x6613;&#x770B;&#x9519;&#x4E86;&#x3002;</p><p>&#x5982;&#x679C;&#x8981;&#x8BA9;<code class="literal">pi</code>&#x6307;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x6574;&#x578B;&#x53D8;&#x91CF;<code class="literal">j</code>&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x5BF9;<code class="literal">pi</code>&#x8D4B;&#x503C;&#xFF1A;</p><pre class="programlisting">pi = &amp;j;</pre><p>&#x5982;&#x679C;&#x8981;&#x6539;&#x53D8;<code class="literal">pi</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x6574;&#x578B;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x628A;&#x53D8;&#x91CF;<code class="literal">j</code>&#x7684;&#x503C;&#x589E;&#x52A0;10&#xFF0C;&#x53EF;&#x4EE5;&#x5199;&#xFF1A;</p><pre class="programlisting">*pi = *pi + 10;</pre><p>&#x8FD9;&#x91CC;&#x7684;<code class="literal">*</code>&#x53F7;&#x662F;&#x6307;&#x9488;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;Indirection Operator&#xFF09;<a id="id2810828" class="indexterm"></a>&#xFF0C;<code class="literal">*pi</code>&#x8868;&#x793A;&#x53D6;&#x6307;&#x9488;<code class="literal">pi</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;Dereference<a id="id2810848" class="indexterm"></a>&#x64CD;&#x4F5C;&#xFF0C;&#x6307;&#x9488;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x53D8;&#x91CF;&#x7684;&#x5F15;&#x7528;&#xFF08;Reference&#xFF09;<a id="id2810856" class="indexterm"></a>&#xFF0C;&#x6240;&#x4EE5;&#x6839;&#x636E;&#x6307;&#x9488;&#x627E;&#x5230;&#x53D8;&#x91CF;&#x79F0;&#x4E3A;Dereference&#x3002;</p><p><code class="literal">&amp;</code>&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x5DE6;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x5DE6;&#x503C;&#x624D;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5355;&#x5143;&#xFF0C;&#x624D;&#x4F1A;&#x6709;&#x5730;&#x5740;&#xFF0C;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x662F;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x3002;<code class="literal">*</code>&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x6307;&#x9488;&#x7C7B;&#x578B;&#xFF0C;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">E</code>&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#xFF0C;<code class="literal">*&amp;E</code>&#x548C;<code class="literal">E</code>&#x7B49;&#x4EF7;&#xFF0C;&#x5982;&#x679C;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">E</code>&#x662F;&#x6307;&#x9488;&#x7C7B;&#x578B;&#xFF0C;<code class="literal">&amp;*E</code>&#x548C;<code class="literal">E</code>&#x7B49;&#x4EF7;&#x3002;</p><p>&#x6307;&#x9488;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x8D4B;&#x503C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x521D;&#x59CB;&#x5316;&#x53E6;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int *ptri = pi;</pre><p>&#x6216;&#x8005;&#xFF1A;</p><pre class="programlisting">int *ptri;
ptri = pi;</pre><p>&#x8868;&#x793A;<span class="emphasis"><em><code class="literal">pi</code>&#x6307;&#x5411;&#x54EA;&#x5C31;&#x8BA9;<code class="literal">ptri</code>&#x4E5F;&#x6307;&#x5411;&#x54EA;</em></span>&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x628A;&#x53D8;&#x91CF;<code class="literal">pi</code>&#x6240;&#x4FDD;&#x5B58;&#x7684;&#x5730;&#x5740;&#x503C;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;<code class="literal">ptri</code>&#x3002;</p><p>&#x7528;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x8D4B;&#x503C;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x5FC5;&#x987B;&#x662F;&#x540C;&#x4E00;&#x7C7B;&#x578B;&#x7684;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code class="literal">pi</code>&#x662F;<code class="literal">int *</code>&#x578B;&#x7684;&#xFF0C;<code class="literal">pc</code>&#x662F;<code class="literal">char *</code>&#x578B;&#x7684;&#xFF0C;<code class="literal">pi = pc;</code>&#x8FD9;&#x6837;&#x8D4B;&#x503C;&#x5C31;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x5148;&#x5F3A;&#x5236;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7136;&#x540E;&#x8D4B;&#x503C;&#xFF1A;</p><pre class="programlisting">pi = (int *)pc;</pre><div class="figure"><a id="id2811004"></a><p class="title"><b>&#x56FE;&#xA0;23.2.&#xA0;&#x628A;<code class="literal">char *</code>&#x6307;&#x9488;&#x7684;&#x503C;&#x8D4B;&#x7ED9;<code class="literal">int *</code>&#x6307;&#x9488;</b></p><div class="figure-contents"><div><img src="images/pointer.pointer1.png" alt="&#x628A;char *&#x6307;&#x9488;&#x7684;&#x503C;&#x8D4B;&#x7ED9;int *&#x6307;&#x9488;"></div></div></div><br class="figure-break"><p>&#x73B0;&#x5728;<code class="literal">pi</code>&#x6307;&#x5411;&#x7684;&#x5730;&#x5740;&#x548C;<code class="literal">pc</code>&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;<code class="literal">*pc</code>&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x901A;&#x8FC7;<code class="literal">*pi</code>&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x540E;3&#x4E2A;&#x5B57;&#x8282;&#x5DF2;&#x7ECF;&#x4E0D;&#x5C5E;&#x4E8E;&#x53D8;&#x91CF;<code class="literal">c</code>&#x4E86;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x5F88;&#x786E;&#x5B9A;&#x53D8;&#x91CF;<code class="literal">c</code>&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x548C;&#x540E;&#x9762;3&#x4E2A;&#x5B57;&#x8282;&#x7EC4;&#x5408;&#x800C;&#x6210;&#x7684;<code class="literal">int</code>&#x503C;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x7ED9;<code class="literal">pi</code>&#x8FD9;&#x4E48;&#x8D4B;&#x503C;&#x3002;&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x6307;&#x9488;&#x8981;&#x7279;&#x522B;&#x5C0F;&#x5FC3;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x5C06;&#x6307;&#x9488;&#x6307;&#x5411;&#x9519;&#x8BEF;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x8BBF;&#x95EE;&#x8FD9;&#x6837;&#x7684;&#x5730;&#x5740;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6BB5;&#x9519;&#x8BEF;&#xFF0C;&#x53EF;&#x80FD;&#x8BFB;&#x5230;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x610F;&#x5916;&#x6539;&#x5199;&#x4E86;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x5728;&#x968F;&#x540E;&#x7684;&#x8FD0;&#x884C;&#x4E2D;&#x51FA;&#x9519;&#x3002;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x800C;&#x6CA1;&#x6709;&#x521D;&#x59CB;&#x5316;&#xFF1A;</p><pre class="programlisting">int main(void)
{
	int *p;
	...
	*p = 0;
	...
}</pre><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x5806;&#x6808;&#x4E0A;&#x5206;&#x914D;&#x7684;&#x53D8;&#x91CF;&#x521D;&#x59CB;&#x503C;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6307;&#x9488;<code class="literal">p</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x7528;<code class="literal">*p</code>&#x8BBF;&#x95EE;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x5730;&#x5740;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x540E;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x5BFC;&#x81F4;&#x6BB5;&#x9519;&#x8BEF;&#x8FD8;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x6539;&#x6B63;&#xFF0C;&#x5982;&#x679C;&#x610F;&#x5916;&#x6539;&#x5199;&#x4E86;&#x6570;&#x636E;&#x800C;&#x5BFC;&#x81F4;&#x968F;&#x540E;&#x7684;&#x8FD0;&#x884C;&#x4E2D;&#x51FA;&#x9519;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x4E86;&#x3002;&#x50CF;&#x8FD9;&#x79CD;&#x6307;&#x5411;&#x4E0D;&#x786E;&#x5B9A;&#x5730;&#x5740;&#x7684;&#x6307;&#x9488;&#x79F0;&#x4E3A;&#x201C;<span class="quote">&#x91CE;&#x6307;&#x9488;</span>&#x201D;&#xFF08;Unbound Pointer&#xFF09;<a id="id2811122" class="indexterm"></a>&#xFF0C;&#x4E3A;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x91CE;&#x6307;&#x9488;&#xFF0C;&#x5728;&#x5B9A;&#x4E49;&#x6307;&#x9488;&#x53D8;&#x91CF;&#x65F6;&#x5C31;&#x5E94;&#x8BE5;&#x7ED9;&#x5B83;&#x660E;&#x786E;&#x7684;&#x521D;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x628A;&#x5B83;&#x521D;&#x59CB;&#x5316;&#x4E3A;<code class="literal">NULL</code>&#xFF1A;</p><pre class="programlisting">int main(void)
{
	int *p = NULL;
	...
	*p = 0;
	...
}</pre><p><code class="literal">NULL</code>&#x5728;C&#x6807;&#x51C6;&#x5E93;&#x7684;&#x5934;&#x6587;&#x4EF6;<code class="literal">stddef.h</code>&#x4E2D;&#x5B9A;&#x4E49;&#xFF1A;</p><pre class="programlisting">#define NULL ((void *)0)</pre><p>&#x5C31;&#x662F;&#x628A;&#x5730;&#x5740;0&#x8F6C;&#x6362;&#x6210;&#x6307;&#x9488;&#x7C7B;&#x578B;&#xFF0C;&#x79F0;&#x4E3A;&#x7A7A;&#x6307;&#x9488;&#xFF0C;&#x5B83;&#x7684;&#x7279;&#x6B8A;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F1A;&#x628A;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5728;&#x5730;&#x5740;0&#x53CA;&#x5176;&#x9644;&#x8FD1;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x628A;&#x5730;&#x5740;0~0xfff&#x7684;&#x9875;&#x9762;&#x6620;&#x5C04;&#x5230;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x4EFB;&#x4F55;&#x5BF9;&#x5730;&#x5740;0&#x7684;&#x8BBF;&#x95EE;&#x90FD;&#x4F1A;&#x7ACB;&#x523B;&#x5BFC;&#x81F4;&#x6BB5;&#x9519;&#x8BEF;&#x3002;<code class="literal">*p = 0;</code>&#x4F1A;&#x5BFC;&#x81F4;&#x6BB5;&#x9519;&#x8BEF;&#xFF0C;&#x5C31;&#x50CF;&#x653E;&#x5728;&#x773C;&#x524D;&#x7684;&#x70B8;&#x5F39;&#x4E00;&#x6837;&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x5230;&#xFF0C;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x91CE;&#x6307;&#x9488;&#x7684;&#x9519;&#x8BEF;&#x5C31;&#x50CF;&#x57CB;&#x4E0B;&#x5730;&#x96F7;&#x4E00;&#x6837;&#xFF0C;&#x66F4;&#x96BE;&#x53D1;&#x73B0;&#x548C;&#x6392;&#x9664;&#xFF0C;&#x8FD9;&#x6B21;&#x8D70;&#x8FC7;&#x53BB;&#x6CA1;&#x4E8B;&#xFF0C;&#x4E0B;&#x6B21;&#x8D70;&#x8FC7;&#x53BB;&#x5C31;&#x6709;&#x4E8B;&#x3002;</p><p>&#x8BB2;&#x5230;&#x8FD9;&#x91CC;&#x5C31;&#x8BE5;&#x8BB2;&#x4E00;&#x4E0B;<code class="literal">void *</code>&#x7C7B;&#x578B;&#x4E86;&#x3002;&#x5728;&#x7F16;&#x7A0B;&#x65F6;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x4E3A;&#x4EFB;&#x610F;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x4EFB;&#x610F;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#x4E5F;&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x4E3A;&#x901A;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x6700;&#x521D;C&#x8BED;&#x8A00;&#x6CA1;&#x6709;<code class="literal">void *</code>&#x7C7B;&#x578B;&#xFF0C;&#x5C31;&#x628A;<code class="literal">char *</code>&#x5F53;&#x901A;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x9700;&#x8981;&#x8F6C;&#x6362;&#x65F6;&#x5C31;&#x7528;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x8FD0;&#x7B97;&#x7B26;<code class="literal">()</code>&#xFF0C;ANSI&#x5728;&#x5C06;C&#x8BED;&#x8A00;&#x6807;&#x51C6;&#x5316;&#x65F6;&#x5F15;&#x5165;&#x4E86;<code class="literal">void *</code>&#x7C7B;&#x578B;&#xFF0C;<code class="literal">void *</code>&#x6307;&#x9488;&#x4E0E;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x7528;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x53EA;&#x80FD;&#x5B9A;&#x4E49;<code class="literal">void *</code>&#x6307;&#x9488;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x5B9A;&#x4E49;<code class="literal">void</code>&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;<code class="literal">void *</code>&#x6307;&#x9488;&#x548C;&#x522B;&#x7684;&#x6307;&#x9488;&#x4E00;&#x6837;&#x90FD;&#x5360;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x5B9A;&#x4E49;<code class="literal">void</code>&#x578B;&#x53D8;&#x91CF;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x7C7B;&#x578B;&#x6682;&#x65F6;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x5206;&#x914D;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#x7ED9;&#x53D8;&#x91CF;&#x3002;&#x540C;&#x6837;&#x9053;&#x7406;&#xFF0C;<code class="literal">void *</code>&#x6307;&#x9488;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;Dereference&#xFF0C;&#x800C;&#x5FC5;&#x987B;&#x5148;&#x8F6C;&#x6362;&#x6210;&#x522B;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#x518D;&#x505A;Dereference&#x3002;<code class="literal">void *</code>&#x6307;&#x9488;&#x5E38;&#x7528;&#x4E8E;&#x51FD;&#x6570;&#x63A5;&#x53E3;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p><pre class="programlisting">void func(void *pv)
{
	/* *pv = &apos;A&apos; is illegal */
	char *pchar = pv;
	*pchar = &apos;A&apos;;
}

int main(void)
{
	char c;
	func(&amp;c);
	printf(&quot;%c\n&quot;, c);
...
}</pre><p>&#x4E0B;&#x4E00;&#x7AE0;&#x8BB2;&#x51FD;&#x6570;&#x63A5;&#x53E3;&#x65F6;&#x518D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;<code class="literal">void *</code>&#x6307;&#x9488;&#x7684;&#x7528;&#x5904;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch23.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch23.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch23s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;23&#xA0;&#x7AE0;&#xA0;&#x6307;&#x9488;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;</td></tr></tbody></table></div>
</body></html>