<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x6307;&#x9488;&#x4E0E;&#x6570;&#x7EC4;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch23.html" title="&#x7B2C;&#xA0;23&#xA0;&#x7AE0;&#xA0;&#x6307;&#x9488;"><link rel="prev" href="ch23s02.html" title="2.&#xA0;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;"><link rel="next" href="ch23s04.html" title="4.&#xA0;&#x6307;&#x9488;&#x4E0E;const&#x9650;&#x5B9A;&#x7B26;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x6307;&#x9488;&#x4E0E;&#x6570;&#x7EC4;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch23s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;23&#xA0;&#x7AE0;&#xA0;&#x6307;&#x9488;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch23s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2811560"></a>3.&#xA0;&#x6307;&#x9488;&#x4E0E;&#x6570;&#x7EC4;</h2></div></div></div><p>&#x5148;&#x770B;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6709;&#x5982;&#x4E0B;&#x8BED;&#x53E5;&#xFF1A;</p><pre class="programlisting">int a[10];
int *pa = &amp;a[0];
pa++;</pre><p>&#x9996;&#x5148;&#x6307;&#x9488;<code class="literal">pa</code>&#x6307;&#x5411;<code class="literal">a[0]</code>&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6CE8;&#x610F;&#x540E;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x4E8E;&#x5355;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x53D6;<code class="literal">a[0]</code>&#x7684;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53D6;<code class="literal">a</code>&#x7684;&#x5730;&#x5740;&#x3002;&#x7136;&#x540E;<code class="literal">pa++</code>&#x8BA9;<code class="literal">pa</code>&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF08;&#x4E5F;&#x5C31;&#x662F;<code class="literal">a[1]</code>&#xFF09;&#xFF0C;&#x7531;&#x4E8E;<code class="literal">pa</code>&#x662F;<code class="literal">int *</code>&#x6307;&#x9488;&#xFF0C;&#x4E00;&#x4E2A;<code class="literal">int</code>&#x578B;&#x5143;&#x7D20;&#x5360;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6240;&#x4EE5;<code class="literal">pa++</code>&#x4F7F;<code class="literal">pa</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x5730;&#x5740;&#x52A0;4&#xFF0C;&#x6CE8;&#x610F;&#x4E0D;&#x662F;&#x52A0;1&#x3002;</p><p>&#x4E0B;&#x9762;&#x753B;&#x56FE;&#x7406;&#x89E3;&#x3002;&#x4ECE;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x5730;&#x5740;&#x7684;&#x5177;&#x4F53;&#x6570;&#x503C;&#x5176;&#x5B9E;&#x65E0;&#x5173;&#x7D27;&#x8981;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x8981;&#x8BF4;&#x660E;&#x5730;&#x5740;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF08;<code class="literal">a[1]</code>&#x4F4D;&#x4E8E;<code class="literal">a[0]</code>&#x4E4B;&#x540E;4&#x4E2A;&#x5B57;&#x8282;&#x5904;&#xFF09;&#x4EE5;&#x53CA;&#x6307;&#x9488;&#x4E0E;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF08;&#x6307;&#x9488;&#x4FDD;&#x5B58;&#x7684;&#x662F;&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#xFF09;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6362;&#x4E00;&#x79CD;&#x753B;&#x6CD5;&#xFF0C;&#x7701;&#x7565;&#x5730;&#x5740;&#x7684;&#x5177;&#x4F53;&#x6570;&#x503C;&#xFF0C;&#x7528;&#x65B9;&#x6846;&#x8868;&#x793A;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x7528;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x6307;&#x9488;&#x548C;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p><div class="figure"><a id="id2811671"></a><p class="title"><b>&#x56FE;&#xA0;23.3.&#xA0;&#x6307;&#x9488;&#x4E0E;&#x6570;&#x7EC4;</b></p><div class="figure-contents"><div><img src="images/pointer.array.png" alt="&#x6307;&#x9488;&#x4E0E;&#x6570;&#x7EC4;"></div></div></div><br class="figure-break"><p>&#x65E2;&#x7136;&#x6307;&#x9488;&#x53EF;&#x4EE5;&#x7528;<code class="literal">++</code>&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;<code class="literal">+</code>&#x3001;<code class="literal">-</code>&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;<code class="literal">pa+2</code>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;<code class="literal">pa</code>&#x6307;&#x5411;<code class="literal">a[1]</code>&#xFF0C;&#x90A3;&#x4E48;<code class="literal">pa+2</code>&#x6307;&#x5411;a[3]&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;<code class="literal">E1[E2]</code>&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x548C;<code class="literal">(*((E1)+(E2)))</code>&#x662F;&#x7B49;&#x4EF7;&#x7684;&#xFF0C;<code class="literal">*(pa+2)</code>&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x6210;<code class="literal">pa[2]</code>&#xFF0C;<code class="literal">pa</code>&#x5C31;&#x50CF;&#x6570;&#x7EC4;&#x540D;&#x4E00;&#x6837;&#xFF0C;&#x5176;&#x5B9E;&#x6570;&#x7EC4;&#x540D;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x6B8A;&#x7684;&#xFF0C;<code class="literal">a[2]</code>&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x53D6;&#x6570;&#x7EC4;&#x7684;&#x7B2C;2&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7B49;&#x4EF7;&#x4E8E;<code class="literal">*(a+2)</code>&#xFF0C;&#x5728;<a class="xref" href="ch08s01.html#array.intro">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x6570;&#x7EC4;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x201D;</a>&#x8BB2;&#x8FC7;&#x6570;&#x7EC4;&#x540D;&#x505A;&#x53F3;&#x503C;&#x65F6;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x6210;&#x6307;&#x5411;&#x9996;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x6240;&#x4EE5;<code class="literal">a[2]</code>&#x548C;<code class="literal">pa[2]</code>&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x6307;&#x9488;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x8BBF;&#x95EE;&#x5143;&#x7D20;&#x3002;&#x7531;&#x4E8E;<code class="literal">(*((E1)+(E2)))</code>&#x663E;&#x7136;&#x53EF;&#x4EE5;&#x5199;&#x6210;<code class="literal">(*((E2)+(E1)))</code>&#xFF0C;&#x6240;&#x4EE5;<code class="literal">E1[E2]</code>&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x6210;<code class="literal">E2[E1]</code>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;<code class="literal">2[a]</code>&#x3001;<code class="literal">2[pa]</code>&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x4E5F;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4F46;&#x4E00;&#x822C;&#x4E0D;&#x8FD9;&#x4E48;&#x5199;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x7531;&#x4E8E;<code class="literal">a</code>&#x505A;&#x53F3;&#x503C;&#x4F7F;&#x7528;&#x65F6;&#x548C;<code class="literal">&amp;a[0]</code>&#x662F;&#x4E00;&#x4E2A;&#x610F;&#x601D;&#xFF0C;&#x6240;&#x4EE5;<code class="literal">int *pa = &amp;a[0];</code>&#x901A;&#x5E38;&#x4E0D;&#x8FD9;&#x4E48;&#x5199;&#xFF0C;&#x800C;&#x662F;&#x5199;&#x6210;&#x66F4;&#x7B80;&#x6D01;&#x7684;&#x5F62;&#x5F0F;<code class="literal">int *pa = a;</code>&#x3002;</p><p>&#x5728;<a class="xref" href="ch08s01.html#array.intro">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x6570;&#x7EC4;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x201D;</a>&#x8FD8;&#x8BB2;&#x8FC7;C&#x8BED;&#x8A00;&#x5141;&#x8BB8;&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x662F;&#x8D1F;&#x6570;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x8BE5;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x6837;&#x89C4;&#x5B9A;&#x4E86;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">pa[-1]</code>&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x5B83;&#x548C;<code class="literal">a[0]</code>&#x8868;&#x793A;&#x540C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;</p><p>&#x73B0;&#x5728;&#x731C;&#x4E00;&#x4E0B;&#xFF0C;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x53D8;&#x91CF;&#x505A;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#xFF08;<code class="literal">&gt;</code>&#x3001;<code class="literal">&gt;=</code>&#x3001;<code class="literal">&lt;</code>&#x3001;<code class="literal">&lt;=</code>&#x3001;<code class="literal">==</code>&#x3001;<code class="literal">!=</code>&#xFF09;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF1F;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x53D8;&#x91CF;&#x505A;&#x51CF;&#x6CD5;&#x8FD0;&#x7B97;&#x53C8;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF1F;</p><p>&#x6839;&#x636E;&#x4EC0;&#x4E48;&#x6765;&#x731C;&#xFF1F;&#x6839;&#x636E;<a class="xref" href="ch03s03.html#func.paraarg">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x5F62;&#x53C2;&#x548C;&#x5B9E;&#x53C2;&#x201D;</a>&#x8BB2;&#x8FC7;&#x7684;Rule of Least Surprise&#x539F;&#x5219;&#x3002;&#x4F60;&#x7406;&#x89E3;&#x4E86;&#x6307;&#x9488;&#x548C;&#x5E38;&#x6570;&#x52A0;&#x51CF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x4EE5;&#x5F80;&#x4F7F;&#x7528;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x731C;&#x5230;<code class="literal">pa + 2 &gt; pa</code>&#xFF0C;<code class="literal">pa - 1 == a</code>&#xFF0C;&#x6240;&#x4EE5;&#x6307;&#x9488;&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x6BD4;&#x7684;&#x662F;&#x5730;&#x5740;&#xFF0C;C&#x8BED;&#x8A00;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x89C4;&#x5B9A;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;C&#x8BED;&#x8A00;&#x7684;&#x89C4;&#x5B9A;&#x66F4;&#x4E3A;&#x4E25;&#x8C28;&#xFF0C;&#x53EA;&#x6709;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x6BD4;&#x8F83;&#x624D;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x5426;&#x5219;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x3002;&#x90A3;&#x4E48;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x76F8;&#x51CF;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#xFF1F;<code class="literal">pa - a</code>&#x7B49;&#x4E8E;&#x51E0;&#xFF1F;&#x56E0;&#x4E3A;<code class="literal">pa - 1 == a</code>&#xFF0C;&#x6240;&#x4EE5;<code class="literal">pa - a</code>&#x663E;&#x7136;&#x5E94;&#x8BE5;&#x7B49;&#x4E8E;1&#xFF0C;&#x6307;&#x9488;&#x76F8;&#x51CF;&#x8868;&#x793A;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x4E4B;&#x95F4;&#x76F8;&#x5DEE;&#x7684;&#x5143;&#x7D20;&#x4E2A;&#x6570;&#xFF0C;&#x540C;&#x6837;&#x53EA;&#x6709;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;&#x4E4B;&#x95F4;&#x76F8;&#x51CF;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x76F8;&#x52A0;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#xFF1F;&#x60F3;&#x4E0D;&#x51FA;&#x6765;&#x5B83;&#x80FD;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x6B64;C&#x8BED;&#x8A00;&#x4E5F;&#x89C4;&#x5B9A;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x4E0D;&#x80FD;&#x76F8;&#x52A0;&#x3002;&#x5047;&#x5982;C&#x8BED;&#x8A00;&#x4E3A;&#x6307;&#x9488;&#x76F8;&#x52A0;&#x4E5F;&#x89C4;&#x5B9A;&#x4E86;&#x4E00;&#x79CD;&#x610F;&#x4E49;&#xFF0C;&#x90A3;&#x5C31;&#x76F8;&#x5F53;Surprise&#x4E86;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x4E00;&#x822C;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x8BBE;&#x8BA1;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8FD8;&#x662F;&#x8BBE;&#x8BA1;&#x51FD;&#x6570;&#x63A5;&#x53E3;&#x6216;&#x4EBA;&#x673A;&#x754C;&#x9762;&#x90FD;&#x662F;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x8BA9;&#x7528;&#x6237;&#x6839;&#x636E;&#x4EE5;&#x5F80;&#x7684;&#x7ECF;&#x9A8C;&#x77E5;&#x8BC6;&#x5C31;&#x80FD;&#x63A8;&#x65AD;&#x51FA;&#x8BE5;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x7528;&#x6CD5;&#x3002;</p><p>&#x5728;&#x53D6;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x65F6;&#x7528;&#x6570;&#x7EC4;&#x540D;&#x548C;&#x7528;&#x6307;&#x9488;&#x7684;&#x8BED;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x628A;&#x6570;&#x7EC4;&#x540D;&#x505A;&#x5DE6;&#x503C;&#x4F7F;&#x7528;&#xFF0C;&#x548C;&#x6307;&#x9488;&#x5C31;&#x6709;&#x533A;&#x522B;&#x4E86;&#x3002;&#x4F8B;&#x5982;<code class="literal">pa++</code>&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x4F46;<code class="literal">a++</code>&#x5C31;&#x4E0D;&#x5408;&#x6CD5;&#xFF0C;<code class="literal">pa = a + 1</code>&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x4F46;<code class="literal">a = pa + 1</code>&#x5C31;&#x4E0D;&#x5408;&#x6CD5;&#x3002;&#x6570;&#x7EC4;&#x540D;&#x505A;&#x53F3;&#x503C;&#x65F6;&#x8F6C;&#x6362;&#x6210;&#x6307;&#x5411;&#x9996;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x4F46;&#x505A;&#x5DE6;&#x503C;&#x4ECD;&#x7136;&#x8868;&#x793A;&#x6574;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9996;&#x5143;&#x7D20;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x6570;&#x7EC4;&#x540D;&#x505A;&#x5DE6;&#x503C;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x7279;&#x6B8A;&#x4E4B;&#x5904;&#xFF0C;&#x4E0D;&#x652F;&#x6301;<code class="literal">++</code>&#x3001;&#x8D4B;&#x503C;&#x8FD9;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4F46;&#x652F;&#x6301;&#x53D6;&#x5730;&#x5740;&#x8FD0;&#x7B97;&#x7B26;<code class="literal">&amp;</code>&#xFF0C;&#x6240;&#x4EE5;<code class="literal">&amp;a</code>&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a class="xref" href="ch23s07.html#pointer.array3">&#x7B2C;&#xA0;7&#xA0;&#x8282; &#x201C;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x7684;&#x6307;&#x9488;&#x4E0E;&#x591A;&#x7EF4;&#x6570;&#x7EC4;&#x201D;</a>&#x4ECB;&#x7ECD;&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x3002;</p><p>&#x5728;&#x51FD;&#x6570;&#x539F;&#x578B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x53C2;&#x6570;&#x662F;&#x6570;&#x7EC4;&#xFF0C;&#x5219;&#x7B49;&#x4EF7;&#x4E8E;&#x53C2;&#x6570;&#x662F;&#x6307;&#x9488;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">void func(int a[10])
{
	...
}</pre><p>&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p><pre class="programlisting">void func(int *a)
{
	...
}</pre><p>&#x7B2C;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x4E0D;&#x5199;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x7B49;&#x4EF7;&#x7684;&#xFF1A;</p><pre class="programlisting">void func(int a[])
{
	...
}</pre><p>&#x53C2;&#x6570;&#x5199;&#x6210;&#x6307;&#x9488;&#x5F62;&#x5F0F;&#x8FD8;&#x662F;&#x6570;&#x7EC4;&#x5F62;&#x5F0F;&#x5BF9;&#x7F16;&#x8BD1;&#x5668;&#x6765;&#x8BF4;&#x6CA1;&#x533A;&#x522B;&#xFF0C;&#x90FD;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x6307;&#x9488;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x89C4;&#x5B9A;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x8BFB;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x63D0;&#x4F9B;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x901A;&#x5E38;&#x5199;&#x6210;&#x6307;&#x9488;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x5411;&#x4E00;&#x4E32;&#x5143;&#x7D20;&#x4E2D;&#x7684;&#x9996;&#x5143;&#x7D20;&#xFF0C;&#x5219;&#x7ECF;&#x5E38;&#x5199;&#x6210;&#x6570;&#x7EC4;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch23s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch23.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch23s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;4.&#xA0;&#x6307;&#x9488;&#x4E0E;<code class="literal">const</code>&#x9650;&#x5B9A;&#x7B26;</td></tr></tbody></table></div>
</body></html>