<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>&#x7B2C;&#xA0;28&#xA0;&#x7AE0;&#xA0;&#x6587;&#x4EF6;&#x4E0E;I/O</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="pt03.html" title="&#x90E8;&#x5206;&#xA0;III.&#xA0;Linux&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;"><link rel="prev" href="pt03.html" title="&#x90E8;&#x5206;&#xA0;III.&#xA0;Linux&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;"><link rel="next" href="ch28s01.html" title="1.&#xA0;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x7684;Hello world"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">&#x7B2C;&#xA0;28&#xA0;&#x7AE0;&#xA0;&#x6587;&#x4EF6;&#x4E0E;I/O</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="pt03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x90E8;&#x5206;&#xA0;III.&#xA0;Linux&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch28s01.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="chapter" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title"><a id="id2850161"></a>&#x7B2C;&#xA0;28&#xA0;&#x7AE0;&#xA0;&#x6587;&#x4EF6;&#x4E0E;I/O</h2></div></div></div><div class="toc"><p><b>&#x76EE;&#x5F55;</b></p><dl><dt><span class="sect1"><a href="ch28s01.html">1. &#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x7684;Hello world</a></span></dt><dt><span class="sect1"><a href="ch28s02.html">2. C&#x6807;&#x51C6;I/O&#x5E93;&#x51FD;&#x6570;&#x4E0E;Unbuffered I/O&#x51FD;&#x6570;</a></span></dt><dt><span class="sect1"><a href="ch28s03.html">3. open/close</a></span></dt><dt><span class="sect1"><a href="ch28s04.html">4. read/write</a></span></dt><dt><span class="sect1"><a href="ch28s05.html">5. lseek</a></span></dt><dt><span class="sect1"><a href="ch28s06.html">6. fcntl</a></span></dt><dt><span class="sect1"><a href="ch28s07.html">7. ioctl</a></span></dt><dt><span class="sect1"><a href="ch28s08.html">8. mmap</a></span></dt></dl></div><p>&#x4ECE;&#x672C;&#x7AE0;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5404;&#x79CD;Linux&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x7684;&#x7528;&#x6CD5;&#x5FC5;&#x987B;&#x7ED3;&#x5408;Linux&#x5185;&#x6838;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x6765;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x6B63;&#x662F;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x8981;&#x7406;&#x89E3;&#x5185;&#x6838;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x5FC5;&#x987B;&#x719F;&#x7EC3;&#x638C;&#x63E1;C&#x8BED;&#x8A00;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x6838;&#x4E5F;&#x662F;&#x7528;C&#x8BED;&#x8A00;&#x5199;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x63CF;&#x8FF0;&#x5185;&#x6838;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x65F6;&#x5FC5;&#x7136;&#x8981;&#x7528;&#x201C;<span class="quote">&#x6307;&#x9488;</span>&#x201D;&#x3001;&#x201C;<span class="quote">&#x7ED3;&#x6784;&#x4F53;</span>&#x201D;&#x3001;&#x201C;<span class="quote">&#x94FE;&#x8868;</span>&#x201D;&#x8FD9;&#x4E9B;&#x540D;&#x8BCD;&#x6765;&#x7EC4;&#x7EC7;&#x8BED;&#x8A00;&#xFF0C;&#x5C31;&#x50CF;&#x53EA;&#x6709;&#x638C;&#x63E1;&#x4E86;&#x82F1;&#x8BED;&#x624D;&#x80FD;&#x770B;&#x61C2;&#x82F1;&#x6587;&#x4E66;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x6709;&#x5B66;&#x597D;&#x4E86;C&#x8BED;&#x8A00;&#x624D;&#x80FD;&#x770B;&#x61C2;&#x6211;&#x63CF;&#x8FF0;&#x7684;&#x5185;&#x6838;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x8BFB;&#x8005;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x719F;&#x7EC3;&#x638C;&#x63E1;&#x4E86;C&#x8BED;&#x8A00;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8D77;&#x70B9;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x4ECB;&#x7ECD;C&#x6807;&#x51C6;&#x5E93;&#x65F6;&#x5E76;&#x4E0D;&#x8BD5;&#x56FE;&#x628A;&#x6240;&#x6709;&#x5E93;&#x51FD;&#x6570;&#x8BB2;&#x4E00;&#x904D;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x4ECB;&#x7ECD;&#x4E00;&#x90E8;&#x5206;&#x5E38;&#x7528;&#x51FD;&#x6570;&#x8BA9;&#x8BFB;&#x8005;&#x628A;&#x63E1;&#x5E93;&#x51FD;&#x6570;&#x7684;&#x57FA;&#x672C;&#x7528;&#x6CD5;&#xFF0C;&#x5728;&#x638C;&#x63E1;&#x4E86;&#x65B9;&#x6CD5;&#x4E4B;&#x540E;&#xFF0C;&#x4E66;&#x4E0A;&#x6CA1;&#x8BB2;&#x7684;&#x5E93;&#x51FD;&#x6570;&#x8BFB;&#x8005;&#x5E94;&#x8BE5;&#x81EA;&#x5DF1;&#x67E5;Man Page&#x5B66;&#x4F1A;&#x4F7F;&#x7528;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x672C;&#x4E66;&#x7684;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x4E5F;&#x5E76;&#x4E0D;&#x8BD5;&#x56FE;&#x628A;&#x6240;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x8BB2;&#x4E00;&#x904D;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x4ECB;&#x7ECD;&#x4E00;&#x90E8;&#x5206;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x8BA9;&#x8BFB;&#x8005;&#x7406;&#x89E3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5404;&#x90E8;&#x5206;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x5728;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x57FA;&#x7840;&#x4E4B;&#x540E;&#x5C31;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x770B;&#x61C2;Man Page&#x5B66;&#x4E60;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x7684;&#x7528;&#x6CD5;&#x3002;</p><p>&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x7ED3;&#x5408;<a class="xref" href="bi01.html#bibli.apue" title="Advanced Programming in the UNIX Environment">[<abbr class="abbrev">APUE2e</abbr>]</a>&#x5B66;&#x4E60;&#x672C;&#x4E66;&#x7684;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#xFF0C;&#x8BE5;&#x4E66;&#x5728;&#x8BB2;&#x89E3;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x65B9;&#x9762;&#x66F4;&#x52A0;&#x5168;&#x9762;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x5185;&#x6838;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x6D89;&#x53CA;&#x5F97;&#x4E0D;&#x591F;&#x6DF1;&#x5165;&#xFF0C;&#x800C;&#x4E14;&#x5047;&#x5B9A;&#x8BFB;&#x8005;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x6240;&#x4EE5;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x521D;&#x5B66;&#x8005;&#x3002;&#x8BE5;&#x4E66;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x975E;&#x5E38;&#x4E0D;&#x9002;&#x5408;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x4F5C;&#x8005;&#x4E0D;&#x8F9E;&#x52B3;&#x82E6;&#xFF0C;&#x5728;N&#x591A;&#x79CD;UNIX&#x7CFB;&#x7EDF;&#x4E0A;&#x505A;&#x4E86;&#x5B9E;&#x9A8C;&#xFF0C;&#x5206;&#x6790;&#x4E86;&#x5B83;&#x4EEC;&#x7684;&#x5185;&#x6838;&#x4EE3;&#x7801;&#xFF0C;&#x628A;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x5728;&#x5404;&#x79CD;UNIX&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x4E0D;&#x517C;&#x5BB9;&#x7279;&#x6027;&#x603B;&#x7ED3;&#x5F97;&#x975E;&#x5E38;&#x8BE6;&#x7EC6;&#xFF0C;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x9700;&#x8981;&#x7F16;&#x5199;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E00;&#x5B9A;&#x7231;&#x6B7B;&#x4ED6;&#x4E86;&#xFF0C;&#x4F46;&#x521D;&#x5B66;&#x8005;&#x770B;&#x4E86;&#x5927;&#x6BB5;&#x5927;&#x6BB5;&#x7684;&#x8FD9;&#x79CD;&#x63CF;&#x8FF0;&#xFF08;&#x67D0;&#x67D0;&#x51FD;&#x6570;&#x5728;4.2BSD&#x4E0A;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x5230;4.4BSD&#x53C8;&#x6539;&#x6210;&#x600E;&#x4E48;&#x6837;&#x4E86;&#xFF0C;&#x5728;SVR4&#x4E0A;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x5230;Solaris&#x53C8;&#x6539;&#x6210;&#x600E;&#x4E48;&#x6837;&#x4E86;&#xFF0C;&#x73B0;&#x5728;POSIX&#x6807;&#x51C6;&#x662F;&#x600E;&#x4E48;&#x7EDF;&#x4E00;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x54EA;&#x4E9B;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x9075;&#x5B88;POSIX&#x6807;&#x51C6;&#xFF09;&#x53EA;&#x4F1A;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#xFF0C;&#x4E0D;&#x770B;&#x5012;&#x8FD8;&#x660E;&#x767D;&#xFF0C;&#x8D8A;&#x770B;&#x8D8A;&#x4E0D;&#x660E;&#x767D;&#x4E86;&#x3002;&#x4E5F;&#x6B63;&#x56E0;&#x4E3A;&#x8BE5;&#x4E66;&#x8981;&#x517C;&#x987E;&#x5404;&#x79CD;UNIX&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6CD5;&#x6DF1;&#x5165;&#x8BB2;&#x89E3;&#x5185;&#x6838;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x79CD;UNIX&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x6838;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x800C;&#x672C;&#x4E66;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#x5219;&#x4E0D;&#x540C;&#xFF0C;&#x53EA;&#x8BB2;Linux&#x5E73;&#x53F0;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x53EA;&#x8BB2;Linux&#x5185;&#x6838;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x6D89;&#x53CA;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x65F6;&#x53EA;&#x8BB2;x86&#x5E73;&#x53F0;&#xFF0C;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x7ED1;&#x5B9A;&#x5230;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x5B66;&#x4E60;&#x5C31;&#x4E0D;&#x4F1A;&#x89C9;&#x5F97;&#x592A;&#x62BD;&#x8C61;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x672C;&#x4E66;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x4F1A;&#x5C3D;&#x91CF;&#x517C;&#x987E;&#x53EF;&#x79FB;&#x690D;&#x6027;&#xFF0C;&#x907F;&#x514D;&#x4F9D;&#x8D56;&#x4E8E;Linux&#x5E73;&#x53F0;&#x7279;&#x6709;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="pt03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="pt03.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch28s01.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x90E8;&#x5206;&#xA0;III.&#xA0;Linux&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;1.&#xA0;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x7684;Hello world</td></tr></tbody></table></div>
</body></html>