<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;read/write</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch28.html" title="&#x7B2C;&#xA0;28&#xA0;&#x7AE0;&#xA0;&#x6587;&#x4EF6;&#x4E0E;I/O"><link rel="prev" href="ch28s03.html" title="3.&#xA0;open/close"><link rel="next" href="ch28s05.html" title="5.&#xA0;lseek"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;read/write</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch28s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;28&#xA0;&#x7AE0;&#xA0;&#x6587;&#x4EF6;&#x4E0E;I/O</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch28s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2852134"></a>4.&#xA0;read/write</h2></div></div></div><p><code class="literal">read</code>&#x51FD;&#x6570;&#x4ECE;&#x6253;&#x5F00;&#x7684;&#x8BBE;&#x5907;&#x6216;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;</p><pre class="programlisting">#include &lt;unistd.h&gt;

ssize_t read(int fd, void *buf, size_t count);
&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x6210;&#x529F;&#x8FD4;&#x56DE;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x51FA;&#x9519;&#x8FD4;&#x56DE;-1&#x5E76;&#x8BBE;&#x7F6E;errno&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8C03;read&#x4E4B;&#x524D;&#x5DF2;&#x5230;&#x8FBE;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x5219;&#x8FD9;&#x6B21;read&#x8FD4;&#x56DE;0</pre><p></p><p>&#x53C2;&#x6570;<code class="literal">count</code>&#x662F;&#x8BF7;&#x6C42;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x8BFB;&#x4E0A;&#x6765;&#x7684;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5728;&#x7F13;&#x51B2;&#x533A;<code class="literal">buf</code>&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x6587;&#x4EF6;&#x7684;&#x5F53;&#x524D;&#x8BFB;&#x5199;&#x4F4D;&#x7F6E;&#x5411;&#x540E;&#x79FB;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x8BFB;&#x5199;&#x4F4D;&#x7F6E;&#x548C;&#x4F7F;&#x7528;C&#x6807;&#x51C6;I/O&#x5E93;&#x65F6;&#x7684;&#x8BFB;&#x5199;&#x4F4D;&#x7F6E;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BFB;&#x5199;&#x4F4D;&#x7F6E;&#x662F;&#x8BB0;&#x5728;&#x5185;&#x6838;&#x4E2D;&#x7684;&#xFF0C;&#x800C;&#x4F7F;&#x7528;C&#x6807;&#x51C6;I/O&#x5E93;&#x65F6;&#x7684;&#x8BFB;&#x5199;&#x4F4D;&#x7F6E;&#x662F;&#x7528;&#x6237;&#x7A7A;&#x95F4;I/O&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6BD4;&#x5982;&#x7528;<code class="literal">fgetc</code>&#x8BFB;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;<code class="literal">fgetc</code>&#x6709;&#x53EF;&#x80FD;&#x4ECE;&#x5185;&#x6838;&#x4E2D;&#x9884;&#x8BFB;1024&#x4E2A;&#x5B57;&#x8282;&#x5230;I/O&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF0C;&#x518D;&#x8FD4;&#x56DE;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x8FD9;&#x65F6;&#x8BE5;&#x6587;&#x4EF6;&#x5728;&#x5185;&#x6838;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x8BFB;&#x5199;&#x4F4D;&#x7F6E;&#x662F;1024&#xFF0C;&#x800C;&#x5728;<code class="literal">FILE</code>&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x8BFB;&#x5199;&#x4F4D;&#x7F6E;&#x662F;1&#x3002;&#x6CE8;&#x610F;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x662F;<code class="literal">ssize_t</code>&#xFF0C;&#x8868;&#x793A;&#x6709;&#x7B26;&#x53F7;&#x7684;<code class="literal">size_t</code>&#xFF0C;&#x8FD9;&#x6837;&#x65E2;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x6B63;&#x7684;&#x5B57;&#x8282;&#x6570;&#x3001;0&#xFF08;&#x8868;&#x793A;&#x5230;&#x8FBE;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF09;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x8D1F;&#x503C;-1&#xFF08;&#x8868;&#x793A;&#x51FA;&#x9519;&#xFF09;&#x3002;<code class="literal">read</code>&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x8BF4;&#x660E;&#x4E86;<code class="literal">buf</code>&#x4E2D;&#x524D;&#x591A;&#x5C11;&#x4E2A;&#x5B57;&#x8282;&#x662F;&#x521A;&#x8BFB;&#x4E0A;&#x6765;&#x7684;&#x3002;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B9E;&#x9645;&#x8BFB;&#x5230;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF08;&#x8FD4;&#x56DE;&#x503C;&#xFF09;&#x4F1A;&#x5C0F;&#x4E8E;&#x8BF7;&#x6C42;&#x8BFB;&#x7684;&#x5B57;&#x8282;&#x6570;<code class="literal">count</code>&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x8BFB;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5728;&#x8BFB;&#x5230;<code class="literal">count</code>&#x4E2A;&#x5B57;&#x8282;&#x4E4B;&#x524D;&#x5DF2;&#x5230;&#x8FBE;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8DDD;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x8FD8;&#x6709;30&#x4E2A;&#x5B57;&#x8282;&#x800C;&#x8BF7;&#x6C42;&#x8BFB;100&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5219;<code class="literal">read</code>&#x8FD4;&#x56DE;30&#xFF0C;&#x4E0B;&#x6B21;<code class="literal">read</code>&#x5C06;&#x8FD4;&#x56DE;0&#x3002;</p></li><li><p>&#x4ECE;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x8BFB;&#xFF0C;&#x901A;&#x5E38;&#x4EE5;&#x884C;&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;&#x8BFB;&#x5230;&#x6362;&#x884C;&#x7B26;&#x5C31;&#x8FD4;&#x56DE;&#x4E86;&#x3002;</p></li><li><p>&#x4ECE;&#x7F51;&#x7EDC;&#x8BFB;&#xFF0C;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x4F20;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x548C;&#x5185;&#x6838;&#x7F13;&#x5B58;&#x673A;&#x5236;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x53EF;&#x80FD;&#x5C0F;&#x4E8E;&#x8BF7;&#x6C42;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x540E;&#x9762;socket&#x7F16;&#x7A0B;&#x90E8;&#x5206;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x3002;</p></li></ul></div><p><code class="literal">write</code>&#x51FD;&#x6570;&#x5411;&#x6253;&#x5F00;&#x7684;&#x8BBE;&#x5907;&#x6216;&#x6587;&#x4EF6;&#x4E2D;&#x5199;&#x6570;&#x636E;&#x3002;</p><pre class="programlisting">#include &lt;unistd.h&gt;

ssize_t write(int fd, const void *buf, size_t count);
&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x6210;&#x529F;&#x8FD4;&#x56DE;&#x5199;&#x5165;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x51FA;&#x9519;&#x8FD4;&#x56DE;-1&#x5E76;&#x8BBE;&#x7F6E;errno</pre><p>&#x5199;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;<code class="literal">write</code>&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x901A;&#x5E38;&#x7B49;&#x4E8E;&#x8BF7;&#x6C42;&#x5199;&#x7684;&#x5B57;&#x8282;&#x6570;<code class="literal">count</code>&#xFF0C;&#x800C;&#x5411;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x6216;&#x7F51;&#x7EDC;&#x5199;&#x5219;&#x4E0D;&#x4E00;&#x5B9A;&#x3002;</p><p>&#x8BFB;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x662F;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x7684;&#xFF0C;&#x4E0D;&#x7BA1;&#x8BFB;&#x591A;&#x5C11;&#x5B57;&#x8282;&#xFF0C;<code class="literal">read</code>&#x4E00;&#x5B9A;&#x4F1A;&#x5728;&#x6709;&#x9650;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x8FD4;&#x56DE;&#x3002;&#x4ECE;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x6216;&#x7F51;&#x7EDC;&#x8BFB;&#x5219;&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x4ECE;&#x7EC8;&#x7AEF;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x6362;&#x884C;&#x7B26;&#xFF0C;&#x8C03;&#x7528;<code class="literal">read</code>&#x8BFB;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x5C31;&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x4E0A;&#x6CA1;&#x6709;&#x63A5;&#x6536;&#x5230;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x8C03;&#x7528;<code class="literal">read</code>&#x4ECE;&#x7F51;&#x7EDC;&#x8BFB;&#x5C31;&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x81F3;&#x4E8E;&#x4F1A;&#x963B;&#x585E;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x4E5F;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x5C31;&#x4E00;&#x76F4;&#x963B;&#x585E;&#x5728;&#x90A3;&#x91CC;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5199;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x662F;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x7684;&#xFF0C;&#x800C;&#x5411;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x6216;&#x7F51;&#x7EDC;&#x5199;&#x5219;&#x4E0D;&#x4E00;&#x5B9A;&#x3002;</p><p>&#x73B0;&#x5728;&#x660E;&#x786E;&#x4E00;&#x4E0B;&#x963B;&#x585E;&#xFF08;Block&#xFF09;<a id="id2852343" class="indexterm"></a>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x5F53;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x963B;&#x585E;&#x7684;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x8BE5;&#x8FDB;&#x7A0B;&#x88AB;&#x7F6E;&#x4E8E;&#x7761;&#x7720;&#xFF08;Sleep&#xFF09;<a id="id2852352" class="indexterm"></a>&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x65F6;&#x5185;&#x6838;&#x8C03;&#x5EA6;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x8BE5;&#x8FDB;&#x7A0B;&#x7B49;&#x5F85;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x4E86;&#xFF08;&#x6BD4;&#x5982;&#x7F51;&#x7EDC;&#x4E0A;&#x63A5;&#x6536;&#x5230;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x6216;&#x8005;&#x8C03;&#x7528;<code class="literal">sleep</code>&#x6307;&#x5B9A;&#x7684;&#x7761;&#x7720;&#x65F6;&#x95F4;&#x5230;&#x4E86;&#xFF09;&#x5B83;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x4E0E;&#x7761;&#x7720;&#x72B6;&#x6001;&#x76F8;&#x5BF9;&#x7684;&#x662F;&#x8FD0;&#x884C;&#xFF08;Running&#xFF09;<a id="id2852368" class="indexterm"></a>&#x72B6;&#x6001;&#xFF0C;&#x5728;Linux&#x5185;&#x6838;&#x4E2D;&#xFF0C;&#x5904;&#x4E8E;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x6B63;&#x5728;&#x88AB;&#x8C03;&#x5EA6;&#x6267;&#x884C;&#x3002;CPU&#x5904;&#x4E8E;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF08;<code class="literal">eip</code>&#xFF09;&#x91CC;&#x4FDD;&#x5B58;&#x7740;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x6307;&#x4EE4;&#x5730;&#x5740;&#xFF0C;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#x91CC;&#x4FDD;&#x5B58;&#x7740;&#x8BE5;&#x8FDB;&#x7A0B;&#x8FD0;&#x7B97;&#x8FC7;&#x7A0B;&#x7684;&#x4E2D;&#x95F4;&#x7ED3;&#x679C;&#xFF0C;&#x6B63;&#x5728;&#x6267;&#x884C;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x6B63;&#x5728;&#x8BFB;&#x5199;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;</p></li><li><p>&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;&#x8BE5;&#x8FDB;&#x7A0B;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x4EC0;&#x4E48;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#xFF0C;&#x968F;&#x65F6;&#x90FD;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#xFF0C;&#x4F46;CPU&#x6682;&#x65F6;&#x8FD8;&#x5728;&#x6267;&#x884C;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x8FDB;&#x7A0B;&#x5728;&#x4E00;&#x4E2A;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x4E2D;&#x7B49;&#x5F85;&#x88AB;&#x5185;&#x6838;&#x8C03;&#x5EA6;&#x3002;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x6709;&#x591A;&#x4E2A;&#x5C31;&#x7EEA;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8C03;&#x5EA6;&#x8C01;&#x6267;&#x884C;&#x5462;&#xFF1F;&#x5185;&#x6838;&#x7684;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x662F;&#x57FA;&#x4E8E;&#x4F18;&#x5148;&#x7EA7;&#x548C;&#x65F6;&#x95F4;&#x7247;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x52A8;&#x6001;&#x8C03;&#x6574;&#x5B83;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x548C;&#x65F6;&#x95F4;&#x7247;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x80FD;&#x6BD4;&#x8F83;&#x516C;&#x5E73;&#x5730;&#x5F97;&#x5230;&#x673A;&#x4F1A;&#x6267;&#x884C;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x517C;&#x987E;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x4E0D;&#x80FD;&#x8BA9;&#x548C;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x8FDB;&#x7A0B;&#x54CD;&#x5E94;&#x592A;&#x6162;&#x3002;</p></li></ul></div><p>&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x5C0F;&#x7A0B;&#x5E8F;&#x4ECE;&#x7EC8;&#x7AEF;&#x8BFB;&#x6570;&#x636E;&#x518D;&#x5199;&#x56DE;&#x7EC8;&#x7AEF;&#x3002;</p><div class="example"><a id="id2852428"></a><p class="title"><b>&#x4F8B;&#xA0;28.2.&#xA0;&#x963B;&#x585E;&#x8BFB;&#x7EC8;&#x7AEF;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;unistd.h&gt;
#include &lt;stdlib.h&gt;

int main(void)
{
	char buf[10];
	int n;
	n = read(STDIN_FILENO, buf, 10);
	if (n &lt; 0) {
		perror(&quot;read STDIN_FILENO&quot;);
		exit(1);
	}
	write(STDOUT_FILENO, buf, n);
	return 0;
}</pre></div></div><br class="example-break"><p>&#x6267;&#x884C;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="programlisting">$ ./a.out 
hello&#xFF08;&#x56DE;&#x8F66;&#xFF09;
hello
$ ./a.out 
hello world&#xFF08;&#x56DE;&#x8F66;&#xFF09;
hello worl$ d
bash: d: command not found</pre><p>&#x7B2C;&#x4E00;&#x6B21;&#x6267;&#x884C;<code class="literal">a.out</code>&#x7684;&#x7ED3;&#x679C;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x6B21;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x6709;&#x70B9;&#x7279;&#x6B8A;&#xFF0C;&#x73B0;&#x5728;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>Shell&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;<code class="literal">a.out</code>&#x8FDB;&#x7A0B;&#xFF0C;<code class="literal">a.out</code>&#x8FDB;&#x7A0B;&#x5F00;&#x59CB;&#x6267;&#x884C;&#xFF0C;&#x800C;Shell&#x8FDB;&#x7A0B;&#x7761;&#x7720;&#x7B49;&#x5F85;<code class="literal">a.out</code>&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x3002;</p></li><li><p><code class="literal">a.out</code>&#x8C03;&#x7528;<code class="literal">read</code>&#x65F6;&#x7761;&#x7720;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x8F93;&#x5165;&#x4E86;&#x6362;&#x884C;&#x7B26;&#x624D;&#x4ECE;<code class="literal">read</code>&#x8FD4;&#x56DE;&#xFF0C;<code class="literal">read</code>&#x53EA;&#x8BFB;&#x8D70;10&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5B57;&#x7B26;&#x4ECD;&#x7136;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x6838;&#x7684;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x3002;</p></li><li><p><code class="literal">a.out</code>&#x8FDB;&#x7A0B;&#x6253;&#x5370;&#x5E76;&#x9000;&#x51FA;&#xFF0C;&#x8FD9;&#x65F6;Shell&#x8FDB;&#x7A0B;&#x6062;&#x590D;&#x8FD0;&#x884C;&#xFF0C;Shell&#x7EE7;&#x7EED;&#x4ECE;&#x7EC8;&#x7AEF;&#x8BFB;&#x53D6;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4E8E;&#x662F;&#x8BFB;&#x8D70;&#x4E86;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x5269;&#x4E0B;&#x7684;&#x5B57;&#x7B26;d&#x548C;&#x6362;&#x884C;&#x7B26;&#xFF0C;&#x628A;&#x5B83;&#x5F53;&#x6210;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#x6267;&#x884C;&#x4E0D;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;d&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x3002;</p></li></ol></div><p>&#x5982;&#x679C;&#x5728;<code class="literal">open</code>&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x65F6;&#x6307;&#x5B9A;&#x4E86;<code class="literal">O_NONBLOCK</code>&#x6807;&#x5FD7;&#xFF0C;<code class="literal">read</code>/<code class="literal">write</code>&#x5C31;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x3002;&#x4EE5;<code class="literal">read</code>&#x4E3A;&#x4F8B;&#xFF0C;&#x5982;&#x679C;&#x8BBE;&#x5907;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x53EF;&#x8BFB;&#x5C31;&#x8FD4;&#x56DE;-1&#xFF0C;&#x540C;&#x65F6;&#x7F6E;<code class="literal">errno</code>&#x4E3A;<code class="literal">EWOULDBLOCK</code>&#xFF08;&#x6216;&#x8005;<code class="literal">EAGAIN</code>&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5B8F;&#x5B9A;&#x4E49;&#x7684;&#x503C;&#x76F8;&#x540C;&#xFF09;&#xFF0C;&#x8868;&#x793A;&#x672C;&#x6765;&#x5E94;&#x8BE5;&#x963B;&#x585E;&#x5728;&#x8FD9;&#x91CC;&#xFF08;would block&#xFF0C;&#x865A;&#x62DF;&#x8BED;&#x6C14;&#xFF09;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x963B;&#x585E;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x5E94;&#x8BE5;&#x8BD5;&#x7740;&#x518D;&#x8BFB;&#x4E00;&#x6B21;&#xFF08;again&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;&#x8F6E;&#x8BE2;&#xFF08;Poll&#xFF09;<a id="id2852596" class="indexterm"></a>&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x53EA;&#x662F;&#x67E5;&#x8BE2;&#x4E00;&#x4E0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x963B;&#x585E;&#x5728;&#x8FD9;&#x91CC;&#x6B7B;&#x7B49;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x76D1;&#x89C6;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#xFF1A;</p><pre class="programlisting">while(1) {
	&#x975E;&#x963B;&#x585E;read(&#x8BBE;&#x5907;1);
	if(&#x8BBE;&#x5907;1&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;)
		&#x5904;&#x7406;&#x6570;&#x636E;;
	&#x975E;&#x963B;&#x585E;read(&#x8BBE;&#x5907;2);
	if(&#x8BBE;&#x5907;2&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;)
		&#x5904;&#x7406;&#x6570;&#x636E;;
	...
}</pre><p>&#x5982;&#x679C;<code class="literal">read(&#x8BBE;&#x5907;1)</code>&#x662F;&#x963B;&#x585E;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x8981;&#x8BBE;&#x5907;1&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x963B;&#x585E;&#x5728;&#x8BBE;&#x5907;1&#x7684;<code class="literal">read</code>&#x8C03;&#x7528;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x8BBE;&#x5907;2&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x4E5F;&#x4E0D;&#x80FD;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x7528;&#x975E;&#x963B;&#x585E;I/O&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8BBE;&#x5907;2&#x5F97;&#x4E0D;&#x5230;&#x53CA;&#x65F6;&#x5904;&#x7406;&#x3002;</p><p>&#x975E;&#x963B;&#x585E;I/O&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x90FD;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x9700;&#x8981;&#x53CD;&#x590D;&#x67E5;&#x8BE2;&#x505A;&#x65E0;&#x7528;&#x529F;&#xFF0C;&#x5982;&#x679C;&#x963B;&#x585E;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x8C03;&#x5EA6;&#x522B;&#x7684;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x505A;&#x65E0;&#x7528;&#x529F;&#x4E86;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x975E;&#x963B;&#x585E;I/O&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x5728;&#x4E00;&#x4E2A;<code class="literal">while</code>&#x5FAA;&#x73AF;&#x4E2D;&#x4E00;&#x76F4;&#x4E0D;&#x505C;&#x5730;&#x67E5;&#x8BE2;&#xFF08;&#x8FD9;&#x79F0;&#x4E3A;Tight Loop<a id="id2852646" class="indexterm"></a>&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x6BCF;&#x5EF6;&#x8FDF;&#x7B49;&#x5F85;&#x4E00;&#x4F1A;&#x513F;&#x6765;&#x67E5;&#x8BE2;&#x4E00;&#x4E0B;&#xFF0C;&#x4EE5;&#x514D;&#x505A;&#x592A;&#x591A;&#x65E0;&#x7528;&#x529F;&#xFF0C;&#x5728;&#x5EF6;&#x8FDF;&#x7B49;&#x5F85;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8C03;&#x5EA6;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x3002;</p><pre class="programlisting">while(1) {
	&#x975E;&#x963B;&#x585E;read(&#x8BBE;&#x5907;1);
	if(&#x8BBE;&#x5907;1&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;)
		&#x5904;&#x7406;&#x6570;&#x636E;;
	&#x975E;&#x963B;&#x585E;read(&#x8BBE;&#x5907;2);
	if(&#x8BBE;&#x5907;2&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;)
		&#x5904;&#x7406;&#x6570;&#x636E;;
	...
	sleep(n);
}</pre><p>&#x8FD9;&#x6837;&#x505A;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8BBE;&#x5907;1&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x65F6;&#x53EF;&#x80FD;&#x4E0D;&#x80FD;&#x53CA;&#x65F6;&#x5904;&#x7406;&#xFF0C;&#x6700;&#x957F;&#x9700;&#x5EF6;&#x8FDF;n&#x79D2;&#x624D;&#x80FD;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x4E14;&#x53CD;&#x590D;&#x67E5;&#x8BE2;&#x8FD8;&#x662F;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x65E0;&#x7528;&#x529F;&#x3002;&#x4EE5;&#x540E;&#x8981;&#x5B66;&#x4E60;&#x7684;<code class="literal">select(2)</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x963B;&#x585E;&#x5730;&#x540C;&#x65F6;&#x76D1;&#x89C6;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x963B;&#x585E;&#x7B49;&#x5F85;&#x7684;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x800C;&#x5706;&#x6EE1;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p><p>&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x963B;&#x585E;I/O&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x5B66;&#x8FC7;&#x7684;&#x53EF;&#x80FD;&#x5F15;&#x8D77;&#x963B;&#x585E;&#x7684;&#x8BBE;&#x5907;&#x53EA;&#x6709;&#x7EC8;&#x7AEF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7528;&#x7EC8;&#x7AEF;&#x6765;&#x505A;&#x8FD9;&#x4E2A;&#x5B9E;&#x9A8C;&#x3002;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x65F6;&#x5728;0&#x3001;1&#x3001;2&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4E0A;&#x81EA;&#x52A8;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x5C31;&#x662F;&#x7EC8;&#x7AEF;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;<code class="literal">O_NONBLOCK</code>&#x6807;&#x5FD7;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x50CF;<a class="xref" href="ch28s04.html#io.blockread">&#x4F8B;&#xA0;28.2 &#x201C;&#x963B;&#x585E;&#x8BFB;&#x7EC8;&#x7AEF;&#x201D;</a>&#x4E00;&#x6837;&#xFF0C;&#x8BFB;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x662F;&#x963B;&#x585E;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x6253;&#x5F00;&#x4E00;&#x904D;&#x8BBE;&#x5907;&#x6587;&#x4EF6;<code class="literal">/dev/tty</code>&#xFF08;&#x8868;&#x793A;&#x5F53;&#x524D;&#x7EC8;&#x7AEF;&#xFF09;&#xFF0C;&#x5728;&#x6253;&#x5F00;&#x65F6;&#x6307;&#x5B9A;<code class="literal">O_NONBLOCK</code>&#x6807;&#x5FD7;&#x3002;</p><div class="example"><a id="id2852714"></a><p class="title"><b>&#x4F8B;&#xA0;28.3.&#xA0;&#x975E;&#x963B;&#x585E;&#x8BFB;&#x7EC8;&#x7AEF;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;unistd.h&gt;
#include &lt;fcntl.h&gt;
#include &lt;errno.h&gt;
#include &lt;string.h&gt;
#include &lt;stdlib.h&gt;

#define MSG_TRY &quot;try again\n&quot;

int main(void)
{
	char buf[10];
	int fd, n;
	fd = open(&quot;/dev/tty&quot;, O_RDONLY|O_NONBLOCK);
	if(fd&lt;0) {
		perror(&quot;open /dev/tty&quot;);
		exit(1);
	}
tryagain:
	n = read(fd, buf, 10);
	if (n &lt; 0) {
		if (errno == EAGAIN) {
			sleep(1);
			write(STDOUT_FILENO, MSG_TRY, strlen(MSG_TRY));
			goto tryagain;
		}	
		perror(&quot;read /dev/tty&quot;);
		exit(1);
	}
	write(STDOUT_FILENO, buf, n);
	close(fd);
	return 0;
}</pre></div></div><br class="example-break"><p>&#x4EE5;&#x4E0B;&#x662F;&#x7528;&#x975E;&#x963B;&#x585E;I/O&#x5B9E;&#x73B0;&#x7B49;&#x5F85;&#x8D85;&#x65F6;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x65E2;&#x4FDD;&#x8BC1;&#x4E86;&#x8D85;&#x65F6;&#x9000;&#x51FA;&#x7684;&#x903B;&#x8F91;&#x53C8;&#x4FDD;&#x8BC1;&#x4E86;&#x6709;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x65F6;&#x5904;&#x7406;&#x5EF6;&#x8FDF;&#x8F83;&#x5C0F;&#x3002;</p><div class="example"><a id="id2852731"></a><p class="title"><b>&#x4F8B;&#xA0;28.4.&#xA0;&#x975E;&#x963B;&#x585E;&#x8BFB;&#x7EC8;&#x7AEF;&#x548C;&#x7B49;&#x5F85;&#x8D85;&#x65F6;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;unistd.h&gt;
#include &lt;fcntl.h&gt;
#include &lt;errno.h&gt;
#include &lt;string.h&gt;
#include &lt;stdlib.h&gt;

#define MSG_TRY &quot;try again\n&quot;
#define MSG_TIMEOUT &quot;timeout\n&quot;

int main(void)
{
	char buf[10];
	int fd, n, i;
	fd = open(&quot;/dev/tty&quot;, O_RDONLY|O_NONBLOCK);
	if(fd&lt;0) {
		perror(&quot;open /dev/tty&quot;);
		exit(1);
	}
	for(i=0; i&lt;5; i++) {
		n = read(fd, buf, 10);
		if(n&gt;=0)
			break;
		if(errno!=EAGAIN) {
			perror(&quot;read /dev/tty&quot;);
			exit(1);
		}
		sleep(1);
		write(STDOUT_FILENO, MSG_TRY, strlen(MSG_TRY));
	}
	if(i==5)
		write(STDOUT_FILENO, MSG_TIMEOUT, strlen(MSG_TIMEOUT));
	else
		write(STDOUT_FILENO, buf, n);
	close(fd);
	return 0;
}</pre></div></div><br class="example-break"></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch28s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch28.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch28s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;open/close&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;5.&#xA0;lseek</td></tr></tbody></table></div>
</body></html>