<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>2.&#xA0;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch29.html" title="&#x7B2C;&#xA0;29&#xA0;&#x7AE0;&#xA0;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><link rel="prev" href="ch29s01.html" title="1.&#xA0;&#x5F15;&#x8A00;"><link rel="next" href="ch29s03.html" title="3.&#xA0;VFS"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">2.&#xA0;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch29s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;29&#xA0;&#x7AE0;&#xA0;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch29s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2857318"></a>2.&#xA0;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2></div></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2857323"></a>2.1.&#xA0;&#x603B;&#x4F53;&#x5B58;&#x50A8;&#x5E03;&#x5C40;</h3></div></div></div><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x5FC5;&#x987B;&#x5148;&#x7528;&#x683C;&#x5F0F;&#x5316;&#x5DE5;&#x5177;&#xFF08;&#x4F8B;&#x5982;&#x67D0;&#x79CD;<code class="literal">mkfs</code>&#x547D;&#x4EE4;&#xFF09;&#x683C;&#x5F0F;&#x5316;&#x6210;&#x67D0;&#x79CD;&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x5B58;&#x50A8;&#x6587;&#x4EF6;&#xFF0C;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x4F1A;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x5199;&#x4E00;&#x4E9B;&#x7BA1;&#x7406;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4E0B;&#x56FE;&#x662F;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x5206;&#x533A;&#x683C;&#x5F0F;&#x5316;&#x6210;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x540E;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#x3002;</p><div class="figure"><a id="id2857342"></a><p class="title"><b>&#x56FE;&#xA0;29.2.&#xA0;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x603B;&#x4F53;&#x5B58;&#x50A8;&#x5E03;&#x5C40;</b></p><div class="figure-contents"><div><img src="images/fs.ext2layout.png" alt="ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x603B;&#x4F53;&#x5B58;&#x50A8;&#x5E03;&#x5C40;"></div></div></div><br class="figure-break"><p>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x662F;&#x5757;&#xFF08;Block&#xFF09;<a id="id2857359" class="indexterm"></a>&#xFF0C;&#x4E00;&#x4E2A;&#x5757;&#x7A76;&#x7ADF;&#x591A;&#x5927;&#x662F;&#x5728;&#x683C;&#x5F0F;&#x5316;&#x65F6;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">mke2fs</code>&#x7684;<code class="literal">-b</code>&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x5757;&#x5927;&#x5C0F;&#x4E3A;1024&#x3001;2048&#x6216;4096&#x5B57;&#x8282;&#x3002;&#x800C;&#x4E0A;&#x56FE;&#x4E2D;&#x542F;&#x52A8;&#x5757;&#xFF08;Boot Block&#xFF09;<a id="id2857380" class="indexterm"></a>&#x7684;&#x5927;&#x5C0F;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x5C31;&#x662F;1KB&#xFF0C;&#x542F;&#x52A8;&#x5757;&#x662F;&#x7531;PC&#x6807;&#x51C6;&#x89C4;&#x5B9A;&#x7684;&#xFF0C;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x78C1;&#x76D8;&#x5206;&#x533A;&#x4FE1;&#x606F;&#x548C;&#x542F;&#x52A8;&#x4FE1;&#x606F;&#xFF0C;&#x4EFB;&#x4F55;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x542F;&#x52A8;&#x5757;&#x3002;&#x542F;&#x52A8;&#x5757;&#x4E4B;&#x540E;&#x624D;&#x662F;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x59CB;&#xFF0C;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5C06;&#x6574;&#x4E2A;&#x5206;&#x533A;&#x5212;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x540C;&#x6837;&#x5927;&#x5C0F;&#x7684;&#x5757;&#x7EC4;&#xFF08;Block Group&#xFF09;<a id="id2857392" class="indexterm"></a>&#xFF0C;&#x6BCF;&#x4E2A;&#x5757;&#x7EC4;&#x90FD;&#x7531;&#x4EE5;&#x4E0B;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x3002;</p><div class="variablelist"><dl><dt><span class="term">&#x8D85;&#x7EA7;&#x5757;&#xFF08;Super Block&#xFF09;<a id="id2857407" class="indexterm"></a></span></dt><dd><p>&#x63CF;&#x8FF0;&#x6574;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5757;&#x5927;&#x5C0F;&#x3001;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x3001;&#x4E0A;&#x6B21;<code class="literal">mount</code>&#x7684;&#x65F6;&#x95F4;&#x7B49;&#x7B49;&#x3002;&#x8D85;&#x7EA7;&#x5757;&#x5728;&#x6BCF;&#x4E2A;&#x5757;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x90FD;&#x6709;&#x4E00;&#x4EFD;&#x62F7;&#x8D1D;&#x3002;</p></dd><dt><span class="term">&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#xFF08;GDT&#xFF0C;Group Descriptor Table&#xFF09;<a id="id2857435" class="indexterm"></a></span></dt><dd><p>&#x7531;&#x5F88;&#x591A;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x7EC4;&#x6210;&#xFF0C;&#x6574;&#x4E2A;&#x5206;&#x533A;&#x5206;&#x6210;&#x591A;&#x5C11;&#x4E2A;&#x5757;&#x7EC4;&#x5C31;&#x5BF9;&#x5E94;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x6BCF;&#x4E2A;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#xFF08;Group Descriptor&#xFF09;<a id="id2857448" class="indexterm"></a>&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x8FD9;&#x4E2A;&#x5757;&#x7EC4;&#x4E2D;&#x4ECE;&#x54EA;&#x91CC;&#x5F00;&#x59CB;&#x662F;inode&#x8868;&#xFF0C;&#x4ECE;&#x54EA;&#x91CC;&#x5F00;&#x59CB;&#x662F;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x7A7A;&#x95F2;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x7B49;&#x7B49;&#x3002;&#x548C;&#x8D85;&#x7EA7;&#x5757;&#x7C7B;&#x4F3C;&#xFF0C;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x5728;&#x6BCF;&#x4E2A;&#x5757;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x4E5F;&#x90FD;&#x6709;&#x4E00;&#x4EFD;&#x62F7;&#x8D1D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x8D85;&#x7EA7;&#x5757;&#x610F;&#x5916;&#x635F;&#x574F;&#x5C31;&#x4F1A;&#x4E22;&#x5931;&#x6574;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x65E6;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x610F;&#x5916;&#x635F;&#x574F;&#x5C31;&#x4F1A;&#x4E22;&#x5931;&#x6574;&#x4E2A;&#x5757;&#x7EC4;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x591A;&#x4EFD;&#x62F7;&#x8D1D;&#x3002;&#x901A;&#x5E38;&#x5185;&#x6838;&#x53EA;&#x7528;&#x5230;&#x7B2C;0&#x4E2A;&#x5757;&#x7EC4;&#x4E2D;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x5F53;&#x6267;&#x884C;<code class="literal">e2fsck</code>&#x68C0;&#x67E5;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E00;&#x81F4;&#x6027;&#x65F6;&#xFF0C;&#x7B2C;0&#x4E2A;&#x5757;&#x7EC4;&#x4E2D;&#x7684;&#x8D85;&#x7EA7;&#x5757;&#x548C;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x5C31;&#x4F1A;&#x62F7;&#x8D1D;&#x5230;&#x5176;&#x5B83;&#x5757;&#x7EC4;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x7B2C;0&#x4E2A;&#x5757;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x610F;&#x5916;&#x635F;&#x574F;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5176;&#x5B83;&#x62F7;&#x8D1D;&#x6765;&#x6062;&#x590D;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x635F;&#x5931;&#x3002;</p></dd><dt><span class="term">&#x5757;&#x4F4D;&#x56FE;&#xFF08;Block Bitmap&#xFF09;<a id="id2857487" class="indexterm"></a></span></dt><dd><p>&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x4E2D;&#x7684;&#x5757;&#x662F;&#x8FD9;&#x6837;&#x5229;&#x7528;&#x7684;&#xFF1A;&#x6570;&#x636E;&#x5757;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x5757;&#x5927;&#x5C0F;&#x662F;1024&#x5B57;&#x8282;&#xFF0C;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x662F;2049&#x5B57;&#x8282;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x6765;&#x5B58;&#xFF0C;&#x5373;&#x4F7F;&#x7B2C;&#x4E09;&#x4E2A;&#x5757;&#x53EA;&#x5B58;&#x4E86;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x5360;&#x7528;&#x4E00;&#x4E2A;&#x6574;&#x5757;&#xFF1B;&#x8D85;&#x7EA7;&#x5757;&#x3001;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x3001;&#x5757;&#x4F4D;&#x56FE;&#x3001;inode&#x4F4D;&#x56FE;&#x3001;inode&#x8868;&#x8FD9;&#x51E0;&#x90E8;&#x5206;&#x5B58;&#x50A8;&#x8BE5;&#x5757;&#x7EC4;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x5757;&#x5DF2;&#x7ECF;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x6216;&#x5176;&#x5B83;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x54EA;&#x4E9B;&#x5757;&#x4ECD;&#x7136;&#x7A7A;&#x95F2;&#x53EF;&#x7528;&#x5462;&#xFF1F;&#x5757;&#x4F4D;&#x56FE;&#x5C31;&#x662F;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x6574;&#x4E2A;&#x5757;&#x7EC4;&#x4E2D;&#x54EA;&#x4E9B;&#x5757;&#x5DF2;&#x7528;&#x54EA;&#x4E9B;&#x5757;&#x7A7A;&#x95F2;&#x7684;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5360;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;bit&#x4EE3;&#x8868;&#x672C;&#x5757;&#x7EC4;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;bit&#x4E3A;1&#x8868;&#x793A;&#x8BE5;&#x5757;&#x5DF2;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;bit&#x4E3A;0&#x8868;&#x793A;&#x8BE5;&#x5757;&#x7A7A;&#x95F2;&#x53EF;&#x7528;&#x3002;</p><p>&#x4E3A;&#x4EC0;&#x4E48;&#x7528;<code class="literal">df</code>&#x547D;&#x4EE4;&#x7EDF;&#x8BA1;&#x6574;&#x4E2A;&#x78C1;&#x76D8;&#x7684;&#x5DF2;&#x7528;&#x7A7A;&#x95F4;&#x975E;&#x5E38;&#x5FEB;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x53EA;&#x9700;&#x8981;&#x67E5;&#x770B;&#x6BCF;&#x4E2A;&#x5757;&#x7EC4;&#x7684;&#x5757;&#x4F4D;&#x56FE;&#x5373;&#x53EF;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x641C;&#x904D;&#x6574;&#x4E2A;&#x5206;&#x533A;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7528;<code class="literal">du</code>&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x76EE;&#x5F55;&#x7684;&#x5DF2;&#x7528;&#x7A7A;&#x95F4;&#x5C31;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x8981;&#x641C;&#x904D;&#x6574;&#x4E2A;&#x76EE;&#x5F55;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x3002;</p><p>&#x4E0E;&#x6B64;&#x76F8;&#x8054;&#x7CFB;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x5728;&#x683C;&#x5F0F;&#x5316;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#x65F6;&#x7A76;&#x7ADF;&#x4F1A;&#x5212;&#x51FA;&#x591A;&#x5C11;&#x4E2A;&#x5757;&#x7EC4;&#x5462;&#xFF1F;&#x4E3B;&#x8981;&#x7684;&#x9650;&#x5236;&#x5728;&#x4E8E;&#x5757;&#x4F4D;&#x56FE;&#x672C;&#x8EAB;&#x5FC5;&#x987B;&#x53EA;&#x5360;&#x4E00;&#x4E2A;&#x5757;&#x3002;&#x7528;<code class="literal">mke2fs</code>&#x683C;&#x5F0F;&#x5316;&#x65F6;&#x9ED8;&#x8BA4;&#x5757;&#x5927;&#x5C0F;&#x662F;1024&#x5B57;&#x8282;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;<code class="literal">-b</code>&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x5757;&#x5927;&#x5C0F;&#xFF0C;&#x73B0;&#x5728;&#x8BBE;&#x5757;&#x5927;&#x5C0F;&#x6307;&#x5B9A;&#x4E3A;b&#x5B57;&#x8282;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x5757;&#x53EF;&#x4EE5;&#x6709;8b&#x4E2A;bit&#xFF0C;&#x8FD9;&#x6837;&#x5927;&#x5C0F;&#x7684;&#x4E00;&#x4E2A;&#x5757;&#x4F4D;&#x56FE;&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A;8b&#x4E2A;&#x5757;&#x7684;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x6700;&#x591A;&#x53EF;&#x4EE5;&#x6709;8b&#x4E2A;&#x5757;&#xFF0C;&#x5982;&#x679C;&#x6574;&#x4E2A;&#x5206;&#x533A;&#x6709;s&#x4E2A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x6709;s/(8b)&#x4E2A;&#x5757;&#x7EC4;&#x3002;&#x683C;&#x5F0F;&#x5316;&#x65F6;&#x53EF;&#x4EE5;&#x7528;<code class="literal">-g</code>&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x5757;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x5E38;&#x4E0D;&#x9700;&#x8981;&#x624B;&#x52A8;&#x6307;&#x5B9A;&#xFF0C;<code class="literal">mke2fs</code>&#x5DE5;&#x5177;&#x4F1A;&#x8BA1;&#x7B97;&#x51FA;&#x6700;&#x4F18;&#x7684;&#x6570;&#x503C;&#x3002;</p></dd><dt><span class="term">inode&#x4F4D;&#x56FE;&#xFF08;inode Bitmap&#xFF09;<a id="id2857581" class="indexterm"></a></span></dt><dd><p>&#x548C;&#x5757;&#x4F4D;&#x56FE;&#x7C7B;&#x4F3C;&#xFF0C;&#x672C;&#x8EAB;&#x5360;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;bit&#x8868;&#x793A;&#x4E00;&#x4E2A;inode&#x662F;&#x5426;&#x7A7A;&#x95F2;&#x53EF;&#x7528;&#x3002;</p></dd><dt><span class="term">inode&#x8868;&#xFF08;inode Table&#xFF09;<a id="id2857600" class="indexterm"></a></span></dt><dd><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x9664;&#x4E86;&#x6570;&#x636E;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x4E4B;&#x5916;&#xFF0C;&#x4E00;&#x4E9B;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x4E5F;&#x9700;&#x8981;&#x5B58;&#x50A8;&#xFF0C;&#x4F8B;&#x5982;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#xFF08;&#x5E38;&#x89C4;&#x3001;&#x76EE;&#x5F55;&#x3001;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x7B49;&#xFF09;&#xFF0C;&#x6743;&#x9650;&#xFF0C;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#xFF0C;&#x521B;&#x5EFA;/&#x4FEE;&#x6539;/&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x7B49;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<code class="literal">ls -l</code>&#x547D;&#x4EE4;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5B58;&#x5728;inode<a id="id2857620" class="indexterm"></a>&#x4E2D;&#x800C;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x3002;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x90FD;&#x6709;&#x4E00;&#x4E2A;inode&#xFF0C;&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x4E2D;&#x7684;&#x6240;&#x6709;inode&#x7EC4;&#x6210;&#x4E86;inode&#x8868;&#x3002;</p><p>inode&#x8868;&#x5360;&#x591A;&#x5C11;&#x4E2A;&#x5757;&#x5728;&#x683C;&#x5F0F;&#x5316;&#x65F6;&#x5C31;&#x8981;&#x51B3;&#x5B9A;&#x5E76;&#x5199;&#x5165;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x4E2D;&#xFF0C;<code class="literal">mke2fs</code>&#x683C;&#x5F0F;&#x5316;&#x5DE5;&#x5177;&#x7684;&#x9ED8;&#x8BA4;&#x7B56;&#x7565;&#x662F;&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x6709;&#x591A;&#x5C11;&#x4E2A;8KB&#x5C31;&#x5206;&#x914D;&#x591A;&#x5C11;&#x4E2A;inode&#x3002;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x5757;&#x5360;&#x4E86;&#x6574;&#x4E2A;&#x5757;&#x7EC4;&#x7684;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD1;&#x4F3C;&#x8BA4;&#x4E3A;&#x6570;&#x636E;&#x5757;&#x6709;&#x591A;&#x5C11;&#x4E2A;8KB&#x5C31;&#x5206;&#x914D;&#x591A;&#x5C11;&#x4E2A;inode&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5927;&#x5C0F;&#x662F;8KB&#xFF0C;&#x5F53;&#x5206;&#x533A;&#x5B58;&#x6EE1;&#x7684;&#x65F6;&#x5019;inode&#x8868;&#x4F1A;&#x5F97;&#x5230;&#x6BD4;&#x8F83;&#x5145;&#x5206;&#x7684;&#x5229;&#x7528;&#xFF0C;&#x6570;&#x636E;&#x5757;&#x4E5F;&#x4E0D;&#x6D6A;&#x8D39;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x5B58;&#x7684;&#x90FD;&#x662F;&#x5F88;&#x5927;&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x6BD4;&#x5982;&#x7535;&#x5F71;&#xFF09;&#xFF0C;&#x5219;&#x6570;&#x636E;&#x5757;&#x7528;&#x5B8C;&#x7684;&#x65F6;&#x5019;inode&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6D6A;&#x8D39;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x5B58;&#x7684;&#x90FD;&#x662F;&#x5F88;&#x5C0F;&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x6BD4;&#x5982;&#x6E90;&#x4EE3;&#x7801;&#xFF09;&#xFF0C;&#x5219;&#x6709;&#x53EF;&#x80FD;&#x6570;&#x636E;&#x5757;&#x8FD8;&#x6CA1;&#x7528;&#x5B8C;inode&#x5C31;&#x5DF2;&#x7ECF;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x6570;&#x636E;&#x5757;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6D6A;&#x8D39;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x5728;&#x683C;&#x5F0F;&#x5316;&#x65F6;&#x80FD;&#x591F;&#x5BF9;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x4EE5;&#x540E;&#x8981;&#x5B58;&#x50A8;&#x7684;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x505A;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;<code class="literal">mke2fs</code>&#x7684;<code class="literal">-i</code>&#x53C2;&#x6570;&#x624B;&#x52A8;&#x6307;&#x5B9A;&#x6BCF;&#x591A;&#x5C11;&#x4E2A;&#x5B57;&#x8282;&#x5206;&#x914D;&#x4E00;&#x4E2A;inode&#x3002;</p></dd><dt><span class="term">&#x6570;&#x636E;&#x5757;&#xFF08;Data Block&#xFF09;<a id="id2857679" class="indexterm"></a></span></dt><dd><p>&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x60C5;&#x51B5;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x5BF9;&#x4E8E;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#xFF0C;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x3002;</p></li><li><p>&#x5BF9;&#x4E8E;&#x76EE;&#x5F55;&#xFF0C;&#x8BE5;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x540D;&#x548C;&#x76EE;&#x5F55;&#x540D;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5757;&#x4E2D;&#xFF0C;&#x6CE8;&#x610F;&#x6587;&#x4EF6;&#x540D;&#x4FDD;&#x5B58;&#x5728;&#x5B83;&#x6240;&#x5728;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#xFF0C;&#x9664;&#x6587;&#x4EF6;&#x540D;&#x4E4B;&#x5916;&#xFF0C;<code class="literal">ls -l</code>&#x547D;&#x4EE4;&#x770B;&#x5230;&#x7684;&#x5176;&#x5B83;&#x4FE1;&#x606F;&#x90FD;&#x4FDD;&#x5B58;&#x5728;&#x8BE5;&#x6587;&#x4EF6;&#x7684;inode&#x4E2D;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;&#x76EE;&#x5F55;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6587;&#x4EF6;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#x7684;&#x6587;&#x4EF6;&#x3002;</p></li><li><p>&#x5BF9;&#x4E8E;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF0C;&#x5982;&#x679C;&#x76EE;&#x6807;&#x8DEF;&#x5F84;&#x540D;&#x8F83;&#x77ED;&#x5219;&#x76F4;&#x63A5;&#x4FDD;&#x5B58;&#x5728;inode&#x4E2D;&#x4EE5;&#x4FBF;&#x66F4;&#x5FEB;&#x5730;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x76EE;&#x6807;&#x8DEF;&#x5F84;&#x540D;&#x8F83;&#x957F;&#x5219;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x6765;&#x4FDD;&#x5B58;&#x3002;</p></li><li><p>&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x3001;FIFO&#x548C;socket&#x7B49;&#x7279;&#x6B8A;&#x6587;&#x4EF6;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x7684;&#x4E3B;&#x8BBE;&#x5907;&#x53F7;&#x548C;&#x6B21;&#x8BBE;&#x5907;&#x53F7;&#x4FDD;&#x5B58;&#x5728;inode&#x4E2D;&#x3002;</p></li></ul></div></dd></dl></div><p>&#x73B0;&#x5728;&#x505A;&#x51E0;&#x4E2A;&#x5C0F;&#x5B9E;&#x9A8C;&#x6765;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x3002;&#x4F8B;&#x5982;&#x5728;<code class="literal">home</code>&#x76EE;&#x5F55;&#x4E0B;<code class="literal">ls -l</code>&#xFF1A;</p><pre class="screen">$ ls -l
total 32
drwxr-xr-x 114 akaedu akaedu 12288 2008-10-25 11:33 akaedu
drwxr-xr-x 114 ftp    ftp     4096 2008-10-25 10:30 ftp
drwx------   2 root   root   16384 2008-07-04 05:58 lost+found</pre><p>&#x4E3A;&#x4EC0;&#x4E48;&#x5404;&#x76EE;&#x5F55;&#x7684;&#x5927;&#x5C0F;&#x90FD;&#x662F;4096&#x7684;&#x6574;&#x6570;&#x500D;&#xFF1F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x5757;&#x5927;&#x5C0F;&#x662F;4096&#xFF0C;&#x76EE;&#x5F55;&#x7684;&#x5927;&#x5C0F;&#x603B;&#x662F;&#x6570;&#x636E;&#x5757;&#x7684;&#x6574;&#x6570;&#x500D;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x7684;&#x76EE;&#x5F55;&#x5927;&#x6709;&#x7684;&#x76EE;&#x5F55;&#x5C0F;&#xFF1F;&#x56E0;&#x4E3A;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4FDD;&#x5B58;&#x7740;&#x5B83;&#x4E0B;&#x8FB9;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5F88;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x5757;&#x88C5;&#x4E0D;&#x4E0B;&#x8FD9;&#x4E48;&#x591A;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x5206;&#x914D;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x5757;&#x7ED9;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF1A;</p><pre class="screen">$ ls -l /dev
...
prw-r-----  1 syslog adm            0 2008-10-25 11:39 xconsole
crw-rw-rw-  1 root   root      1,   5 2008-10-24 16:44 zero</pre><p><code class="literal">xconsole</code>&#x6587;&#x4EF6;&#x7684;&#x7C7B;&#x578B;&#x662F;<code class="literal">p</code>&#xFF08;&#x8868;&#x793A;pipe&#xFF09;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;FIFO&#x6587;&#x4EF6;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x8BB2;&#x5230;&#x5B83;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x5757;&#x5185;&#x6838;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x6807;&#x8BC6;&#xFF0C;&#x4E0D;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x662F;0&#x3002;<code class="literal">zero</code>&#x6587;&#x4EF6;&#x7684;&#x7C7B;&#x578B;&#x662F;<code class="literal">c</code>&#xFF0C;&#x8868;&#x793A;&#x5B57;&#x7B26;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x539F;&#x672C;&#x5E94;&#x8BE5;&#x5199;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7684;&#x5730;&#x65B9;&#x5199;&#x4E86;<code class="literal">1, 5</code>&#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x8868;&#x793A;&#x4E3B;&#x8BBE;&#x5907;&#x53F7;&#x548C;&#x6B21;&#x8BBE;&#x5907;&#x53F7;&#xFF0C;&#x8BBF;&#x95EE;&#x8BE5;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5185;&#x6838;&#x6839;&#x636E;&#x8BBE;&#x5907;&#x53F7;&#x627E;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF1A;</p><pre class="screen">$ touch hello
$ ln -s ./hello halo
$ ls -l
total 0
lrwxrwxrwx 1 akaedu akaedu 7 2008-10-25 15:04 halo -&gt; ./hello
-rw-r--r-- 1 akaedu akaedu 0 2008-10-25 15:04 hello</pre><p>&#x6587;&#x4EF6;<code class="literal">hello</code>&#x662F;&#x521A;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x5B57;&#x8282;&#x6570;&#x4E3A;0&#xFF0C;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x6587;&#x4EF6;<code class="literal">halo</code>&#x6307;&#x5411;<code class="literal">hello</code>&#xFF0C;&#x5B57;&#x8282;&#x6570;&#x5374;&#x662F;7&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5176;&#x5B9E;7&#x5C31;&#x662F;&#x201C;<span class="quote">./hello</span>&#x201D;&#x8FD9;7&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x6587;&#x4EF6;&#x5C31;&#x4FDD;&#x5B58;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8DEF;&#x5F84;&#x540D;&#x3002;&#x518D;&#x8BD5;&#x8BD5;&#x786C;&#x94FE;&#x63A5;&#xFF1A;</p><pre class="screen">$ ln ./hello hello2
$ ls -l
total 0
lrwxrwxrwx 1 akaedu akaedu 7 2008-10-25 15:08 halo -&gt; ./hello
-rw-r--r-- 2 akaedu akaedu 0 2008-10-25 15:04 hello
-rw-r--r-- 2 akaedu akaedu 0 2008-10-25 15:04 hello2</pre><p><code class="literal">hello2</code>&#x548C;<code class="literal">hello</code>&#x9664;&#x4E86;&#x6587;&#x4EF6;&#x540D;&#x4E0D;&#x4E00;&#x6837;&#x4E4B;&#x5916;&#xFF0C;&#x522B;&#x7684;&#x5C5E;&#x6027;&#x90FD;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF0C;&#x5E76;&#x4E14;<code class="literal">hello</code>&#x7684;&#x5C5E;&#x6027;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x7B2C;&#x4E8C;&#x680F;&#x7684;&#x6570;&#x5B57;&#x539F;&#x672C;&#x662F;1&#xFF0C;&#x73B0;&#x5728;&#x53D8;&#x6210;2&#x4E86;&#x3002;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x8BF4;&#xFF0C;<code class="literal">hello</code>&#x548C;<code class="literal">hello2</code>&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x540D;&#x5B57;&#xFF0C;<code class="literal">ls -l</code>&#x7B2C;&#x4E8C;&#x680F;&#x7684;&#x6570;&#x5B57;&#x662F;&#x786C;&#x94FE;&#x63A5;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x51E0;&#x4E2A;&#x540D;&#x5B57;&#xFF08;&#x8FD9;&#x4E9B;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x53EF;&#x4EE5;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#x4E0B;&#xFF09;&#xFF0C;&#x786C;&#x94FE;&#x63A5;&#x6570;&#x4E5F;&#x4FDD;&#x5B58;&#x5728;inode&#x4E2D;&#x3002;&#x65E2;&#x7136;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;inode&#x5F53;&#x7136;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x7528;<code class="literal">ls -l</code>&#x770B;&#x5B83;&#x4EEC;&#x7684;&#x5C5E;&#x6027;&#x662F;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x90FD;&#x662F;&#x4ECE;&#x8FD9;&#x4E2A;inode&#x91CC;&#x8BFB;&#x51FA;&#x6765;&#x7684;&#x3002;&#x518D;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x76EE;&#x5F55;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x6570;&#xFF1A;</p><pre class="screen">$ mkdir a
$ mkdir a/b
$ ls -ld a
drwxr-xr-x 3 akaedu akaedu 4096 2008-10-25 16:15 a
$ ls -la a
total 20
drwxr-xr-x   3 akaedu akaedu  4096 2008-10-25 16:15 .
drwxr-xr-x 115 akaedu akaedu 12288 2008-10-25 16:14 ..
drwxr-xr-x   2 akaedu akaedu  4096 2008-10-25 16:15 b
$ ls -la a/b
total 8
drwxr-xr-x 2 akaedu akaedu 4096 2008-10-25 16:15 .
drwxr-xr-x 3 akaedu akaedu 4096 2008-10-25 16:15 ..</pre><p>&#x9996;&#x5148;&#x521B;&#x5EFA;&#x76EE;&#x5F55;<code class="literal">a</code>&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5B83;&#x4E0B;&#x9762;&#x521B;&#x5EFA;&#x5B50;&#x76EE;&#x5F55;<code class="literal">a/b</code>&#x3002;&#x76EE;&#x5F55;<code class="literal">a</code>&#x7684;&#x786C;&#x94FE;&#x63A5;&#x6570;&#x662F;3&#xFF0C;&#x8FD9;3&#x4E2A;&#x540D;&#x5B57;&#x5206;&#x522B;&#x662F;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">a</code>&#xFF0C;<code class="literal">a</code>&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">.</code>&#x548C;<code class="literal">b</code>&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">..</code>&#x3002;&#x76EE;&#x5F55;<code class="literal">b</code>&#x7684;&#x786C;&#x94FE;&#x63A5;&#x6570;&#x662F;2&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x540D;&#x5B57;&#x5206;&#x522B;&#x662F;<code class="literal">a</code>&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">b</code>&#x548C;<code class="literal">b</code>&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">.</code>&#x3002;&#x6CE8;&#x610F;&#xFF0C;<span class="emphasis"><em>&#x76EE;&#x5F55;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x53EA;&#x80FD;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#xFF0C;&#x7528;<code class="literal">ln</code>&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x76EE;&#x5F55;&#x7684;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x521B;&#x5EFA;&#x76EE;&#x5F55;&#x7684;&#x786C;&#x94FE;&#x63A5;</em></span>&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2858019"></a>2.2.&#xA0;&#x5B9E;&#x4F8B;&#x5256;&#x6790;</h3></div></div></div><p>&#x5982;&#x679C;&#x8981;&#x683C;&#x5F0F;&#x5316;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#x6765;&#x7814;&#x7A76;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x683C;&#x5F0F;&#x5219;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x7684;&#x78C1;&#x76D8;&#x5206;&#x533A;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x5B9E;&#x9A8C;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5F53;&#x4F5C;&#x5206;&#x533A;&#x6765;&#x683C;&#x5F0F;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x6790;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6765;&#x5370;&#x8BC1;&#x4E0A;&#x9762;&#x6240;&#x8BB2;&#x7684;&#x8981;&#x70B9;&#x3002;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;1MB&#x7684;&#x6587;&#x4EF6;&#x5E76;&#x6E05;&#x96F6;&#xFF1A;</p><pre class="screen">$ dd if=/dev/zero of=fs count=256 bs=4K</pre><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;<code class="literal">cp</code>&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x62F7;&#x8D1D;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x800C;<code class="literal">dd</code>&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x62F7;&#x8D1D;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x628A;<code class="literal">/dev/zero</code>&#x6587;&#x4EF6;&#x5F00;&#x5934;&#x7684;1M&#xFF08;256&#xD7;4K&#xFF09;&#x5B57;&#x8282;&#x62F7;&#x8D1D;&#x6210;&#x6587;&#x4EF6;&#x540D;&#x4E3A;<code class="literal">fs</code>&#x7684;&#x6587;&#x4EF6;&#x3002;&#x521A;&#x624D;&#x6211;&#x4EEC;&#x770B;&#x5230;<code class="literal">/dev/zero</code>&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x78C1;&#x76D8;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x8BFB;&#x64CD;&#x4F5C;&#x4F20;&#x7ED9;&#x8BBE;&#x5907;&#x53F7;&#x4E3A;<code class="literal">1, 5</code>&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;<code class="literal">/dev/zero</code>&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x65E0;&#x7A77;&#x5927;&#x7684;&#xFF0C;&#x4E0D;&#x7BA1;&#x4ECE;&#x54EA;&#x91CC;&#x5F00;&#x59CB;&#x8BFB;&#xFF0C;&#x8BFB;&#x51FA;&#x6765;&#x7684;&#x90FD;&#x662F;&#x5B57;&#x8282;0x00&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x62F7;&#x8D1D;&#x4E86;1M&#x4E2A;0x00&#x5230;<code class="literal">fs</code>&#x6587;&#x4EF6;&#x3002;<code class="literal">if</code>&#x548C;<code class="literal">of</code>&#x53C2;&#x6570;&#x8868;&#x793A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x548C;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;<code class="literal">count</code>&#x548C;<code class="literal">bs</code>&#x53C2;&#x6570;&#x8868;&#x793A;&#x62F7;&#x8D1D;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x6BCF;&#x6B21;&#x62F7;&#x591A;&#x5C11;&#x5B57;&#x8282;&#x3002;</p><p>&#x505A;&#x597D;&#x4E4B;&#x540E;&#x5BF9;&#x6587;&#x4EF6;<code class="literal">fs</code>&#x8FDB;&#x884C;&#x683C;&#x5F0F;&#x5316;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<span class="emphasis"><em>&#x628A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5757;&#x5408;&#x8D77;&#x6765;&#x770B;&#x6210;&#x4E00;&#x4E2A;1MB&#x7684;&#x78C1;&#x76D8;&#x5206;&#x533A;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x4E0A;&#x518D;&#x5212;&#x5206;&#x51FA;&#x5757;&#x7EC4;</em></span>&#x3002;</p><pre class="screen">$ mke2fs fs
mke2fs 1.40.2 (12-Jul-2007)
fs is not a block special device.
Proceed anyway? (y,n) &#xFF08;&#x8F93;&#x5165;y&#x56DE;&#x8F66;&#xFF09;
Filesystem label=
OS type: Linux
Block size=1024 (log=0)
Fragment size=1024 (log=0)
128 inodes, 1024 blocks
51 blocks (4.98%) reserved for the super user
First data block=1
Maximum filesystem blocks=1048576
1 block group
8192 blocks per group, 8192 fragments per group
128 inodes per group

Writing inode tables: done                            
Writing superblocks and filesystem accounting information: done

This filesystem will be automatically checked every 27 mounts or
180 days, whichever comes first.  Use tune2fs -c or -i to override.</pre><p>&#x683C;&#x5F0F;&#x5316;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x5206;&#x533A;&#x5E94;&#x8BE5;&#x6307;&#x5B9A;&#x5757;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">/dev/sda1</code>&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;<code class="literal">fs</code>&#x662F;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x800C;&#x4E0D;&#x662F;&#x5757;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#xFF0C;<code class="literal">mke2fs</code>&#x8BA4;&#x4E3A;&#x7528;&#x6237;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x8BEF;&#x64CD;&#x4F5C;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x7ED9;&#x51FA;&#x63D0;&#x793A;&#xFF0C;&#x8981;&#x6C42;&#x786E;&#x8BA4;&#x662F;&#x5426;&#x771F;&#x7684;&#x8981;&#x683C;&#x5F0F;&#x5316;&#xFF0C;&#x8F93;&#x5165;<code class="literal">y</code>&#x56DE;&#x8F66;&#x5B8C;&#x6210;&#x683C;&#x5F0F;&#x5316;&#x3002;</p><p>&#x73B0;&#x5728;<code class="literal">fs</code>&#x7684;&#x5927;&#x5C0F;&#x4ECD;&#x7136;&#x662F;1MB&#xFF0C;&#x4F46;&#x4E0D;&#x518D;&#x662F;&#x5168;0&#x4E86;&#xFF0C;&#x5176;&#x4E2D;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x5757;&#x7EC4;&#x548C;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x3002;&#x7528;<code class="literal">dumpe2fs</code>&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x8D85;&#x7EA7;&#x5757;&#x548C;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#xFF1A;</p><pre class="screen">$ dumpe2fs fs
dumpe2fs 1.40.2 (12-Jul-2007)
Filesystem volume name:   &lt;none&gt;
Last mounted on:          &lt;not available&gt;
Filesystem UUID:          8e1f3b7a-4d1f-41dc-8928-526e43b2fd74
Filesystem magic number:  0xEF53
Filesystem revision #:    1 (dynamic)
Filesystem features:      resize_inode dir_index filetype sparse_super
Filesystem flags:         signed directory hash 
Default mount options:    (none)
Filesystem state:         clean
Errors behavior:          Continue
Filesystem OS type:       Linux
Inode count:              128
Block count:              1024
Reserved block count:     51
Free blocks:              986
Free inodes:              117
First block:              1
Block size:               1024
Fragment size:            1024
Reserved GDT blocks:      3
Blocks per group:         8192
Fragments per group:      8192
Inodes per group:         128
Inode blocks per group:   16
Filesystem created:       Sun Dec 16 14:56:59 2007
Last mount time:          n/a
Last write time:          Sun Dec 16 14:56:59 2007
Mount count:              0
Maximum mount count:      30
Last checked:             Sun Dec 16 14:56:59 2007
Check interval:           15552000 (6 months)
Next check after:         Fri Jun 13 14:56:59 2008
Reserved blocks uid:      0 (user root)
Reserved blocks gid:      0 (group root)
First inode:              11
Inode size:               128
Default directory hash:   tea
Directory Hash Seed:      6d0e58bd-b9db-41ae-92b3-4563a02a5981


Group 0: (Blocks 1-1023)
  Primary superblock at 1, Group descriptors at 2-2
  Reserved GDT blocks at 3-5
  Block bitmap at 6 (+5), Inode bitmap at 7 (+6)
  Inode table at 8-23 (+7)
  986 free blocks, 117 free inodes, 2 directories
  Free blocks: 38-1023
  Free inodes: 12-128

128 inodes per group, 8 inodes per block, so: 16 blocks for inode table</pre><p>&#x6839;&#x636E;&#x4E0A;&#x9762;&#x8BB2;&#x8FC7;&#x7684;&#x77E5;&#x8BC6;&#x7B80;&#x5355;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#xFF0C;&#x5757;&#x5927;&#x5C0F;&#x662F;1024&#x5B57;&#x8282;&#xFF0C;1MB&#x7684;&#x5206;&#x533A;&#x5171;&#x6709;1024&#x4E2A;&#x5757;&#xFF0C;&#x7B2C;0&#x4E2A;&#x5757;&#x662F;&#x542F;&#x52A8;&#x5757;&#xFF0C;&#x542F;&#x52A8;&#x5757;&#x4E4B;&#x540E;&#x624D;&#x7B97;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x56E0;&#x6B64;Group 0&#x5360;&#x636E;&#x7B2C;1&#x4E2A;&#x5230;&#x7B2C;1023&#x4E2A;&#x5757;&#xFF0C;&#x5171;1023&#x4E2A;&#x5757;&#x3002;&#x5757;&#x4F4D;&#x56FE;&#x5360;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x5171;&#x6709;1024&#xD7;8=8192&#x4E2A;bit&#xFF0C;&#x8DB3;&#x591F;&#x8868;&#x793A;&#x8FD9;1023&#x4E2A;&#x5757;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x8981;&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x5C31;&#x591F;&#x4E86;&#x3002;&#x9ED8;&#x8BA4;&#x662F;&#x6BCF;8KB&#x5206;&#x914D;&#x4E00;&#x4E2A;inode&#xFF0C;&#x56E0;&#x6B64;1MB&#x7684;&#x5206;&#x533A;&#x5BF9;&#x5E94;128&#x4E2A;inode&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x90FD;&#x548C;<code class="literal">dumpe2fs</code>&#x7684;&#x8F93;&#x51FA;&#x543B;&#x5408;&#x3002;</p><p>&#x7528;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x5236;&#x4F5C;&#x800C;&#x6210;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E5F;&#x53EF;&#x4EE5;&#x50CF;&#x78C1;&#x76D8;&#x5206;&#x533A;&#x4E00;&#x6837;<code class="literal">mount</code>&#x5230;&#x67D0;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="screen">$ sudo mount -o loop fs /mnt
$ cd /mnt/
$ ls -la
total 17
drwxr-xr-x  3 akaedu akaedu  1024 2008-10-25 12:20 .
drwxr-xr-x 21 root    root     4096 2008-08-18 08:54 ..
drwx------  2 root    root    12288 2008-10-25 12:20 lost+found</pre><p><code class="literal">-o loop</code>&#x9009;&#x9879;&#x544A;&#x8BC9;<code class="literal">mount</code>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5757;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x3002;<code class="literal">mount</code>&#x4F1A;&#x628A;&#x5B83;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5F53;&#x4F5C;&#x5206;&#x533A;&#x683C;&#x5F0F;&#x6765;&#x89E3;&#x91CA;&#x3002;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x683C;&#x5F0F;&#x5316;&#x4E4B;&#x540E;&#x5728;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E09;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#xFF1A;<code class="literal">.</code>&#xFF0C;<code class="literal">..</code>&#x548C;<code class="literal">lost+found</code>&#x3002;&#x5176;&#x5B83;&#x5B50;&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">.</code>&#x8868;&#x793A;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#xFF0C;<code class="literal">..</code>&#x8868;&#x793A;&#x4E0A;&#x4E00;&#x7EA7;&#x76EE;&#x5F55;&#xFF0C;&#x800C;&#x6839;&#x76EE;&#x5F55;&#x7684;<code class="literal">.</code>&#x548C;<code class="literal">..</code>&#x90FD;&#x8868;&#x793A;&#x6839;&#x76EE;&#x5F55;&#x672C;&#x8EAB;&#x3002;<code class="literal">lost+found</code>&#x76EE;&#x5F55;&#x7531;<code class="literal">e2fsck</code>&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x68C0;&#x67E5;&#x78C1;&#x76D8;&#x65F6;&#x53D1;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x5C31;&#x628A;&#x6709;&#x9519;&#x8BEF;&#x7684;&#x5757;&#x6302;&#x5728;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5757;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x8C01;&#x7684;&#xFF0C;&#x627E;&#x4E0D;&#x5230;&#x4E3B;&#xFF0C;&#x5C31;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#x201C;<span class="quote">&#x5931;&#x7269;&#x62DB;&#x9886;</span>&#x201D;&#x4E86;&#x3002;</p><p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5728;<code class="literal">/mnt</code>&#x76EE;&#x5F55;&#x4E0B;&#x6DFB;&#x52A0;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x4F1A;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x5230;&#x6587;&#x4EF6;<code class="literal">fs</code>&#x4E2D;&#x3002;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x5206;&#x533A;<code class="literal">umount</code>&#x4E0B;&#x6765;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x6539;&#x52A8;&#x90FD;&#x4FDD;&#x5B58;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#x4E86;&#x3002;</p><pre class="screen">$ sudo umount /mnt</pre><p>&#x6CE8;&#x610F;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x5B9E;&#x9A8C;&#x6B65;&#x9AA4;&#x662F;&#x5BF9;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x505A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x6DFB;&#x52A0;&#x5220;&#x9664;&#x8FC7;&#x6587;&#x4EF6;&#xFF0C;&#x8DDF;&#x7740;&#x505A;&#x4E0B;&#x9762;&#x7684;&#x6B65;&#x9AA4;&#x65F6;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x548C;&#x6211;&#x5199;&#x7684;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E5F;&#x4E0D;&#x5F71;&#x54CD;&#x7406;&#x89E3;&#x3002;</p><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x67E5;&#x770B;&#x5DE5;&#x5177;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x5B57;&#x8282;&#xFF0C;&#x5E76;&#x4E14;&#x540C;<code class="literal">dumpe2fs</code>&#x5DE5;&#x5177;&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x76F8;&#x6BD4;&#x8F83;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x7406;&#x89E3;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#x4E86;&#x3002;</p><pre class="screen">$ od -tx1 -Ax fs
000000 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00
*
000400 80 00 00 00 00 04 00 00 33 00 00 00 da 03 00 00
000410 75 00 00 00 01 00 00 00 00 00 00 00 00 00 00 00
...</pre><p>&#x5176;&#x4E2D;&#x4EE5;*&#x5F00;&#x5934;&#x7684;&#x884C;&#x8868;&#x793A;&#x8FD9;&#x4E00;&#x6BB5;&#x6570;&#x636E;&#x5168;&#x662F;&#x96F6;&#x56E0;&#x6B64;&#x7701;&#x7565;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x8BE6;&#x7EC6;&#x5206;&#x6790;<code class="literal">od</code>&#x8F93;&#x51FA;&#x7684;&#x4FE1;&#x606F;&#x3002;</p><p>&#x4ECE;000000&#x5F00;&#x59CB;&#x7684;1KB&#x662F;&#x542F;&#x52A8;&#x5757;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x78C1;&#x76D8;&#x5206;&#x533A;&#xFF0C;&#x542F;&#x52A8;&#x5757;&#x7684;&#x5185;&#x5BB9;&#x5168;&#x90E8;&#x4E3A;&#x96F6;&#x3002;&#x4ECE;000400&#x5230;0007ff&#x7684;1KB&#x662F;&#x8D85;&#x7EA7;&#x5757;&#xFF0C;&#x5BF9;&#x7167;&#x7740;<code class="literal">dumpe2fs</code>&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#xFF0C;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x5982;&#x4E0B;&#xFF1A;</p><div class="figure"><a id="id2858465"></a><p class="title"><b>&#x56FE;&#xA0;29.3.&#xA0;&#x8D85;&#x7EA7;&#x5757;</b></p><div class="figure-contents"><div><img src="images/fs.sb.png" alt="&#x8D85;&#x7EA7;&#x5757;"></div></div></div><br class="figure-break"><p>&#x8D85;&#x7EA7;&#x5757;&#x4E2D;&#x4ECE;0004d0&#x5230;&#x672B;&#x5C3E;&#x7684;204&#x4E2A;&#x5B57;&#x8282;&#x662F;&#x586B;&#x5145;&#x5B57;&#x8282;&#xFF0C;&#x4FDD;&#x7559;&#x672A;&#x7528;&#xFF0C;&#x4E0A;&#x56FE;&#x672A;&#x753B;&#x51FA;&#x3002;&#x6CE8;&#x610F;&#xFF0C;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x5404;&#x5B57;&#x6BB5;&#x90FD;&#x662F;&#x6309;&#x5C0F;&#x7AEF;&#x5B58;&#x50A8;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x5B57;&#x8282;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x770B;&#x4F5C;&#x5730;&#x5740;&#xFF0C;&#x90A3;&#x4E48;&#x9760;&#x8FD1;&#x6587;&#x4EF6;&#x5F00;&#x5934;&#x7684;&#x662F;&#x4F4E;&#x5730;&#x5740;&#xFF0C;&#x5B58;&#x4F4E;&#x5B57;&#x8282;&#x3002;&#x5404;&#x5B57;&#x6BB5;&#x7684;&#x4F4D;&#x7F6E;&#x3001;&#x957F;&#x5EA6;&#x548C;&#x542B;&#x4E49;&#x8BE6;&#x89C1;<a class="xref" href="bi01.html#bibli.ulk" title="Understanding the Linux Kernel">[<abbr class="abbrev">ULK</abbr>]</a>&#x3002;</p><p>&#x4ECE;000800&#x5F00;&#x59CB;&#x662F;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8F83;&#x5C0F;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x5BF9;&#x7167;&#x7740;<code class="literal">dumpe2fs</code>&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x5206;&#x6790;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="screen">...
Group 0: (Blocks 1-1023)
  Primary superblock at 1, Group descriptors at 2-2
  Reserved GDT blocks at 3-5
  Block bitmap at 6 (+5), Inode bitmap at 7 (+6)
  Inode table at 8-23 (+7)
  986 free blocks, 117 free inodes, 2 directories
  Free blocks: 38-1023
  Free inodes: 12-128
...</pre><div class="figure"><a id="id2858517"></a><p class="title"><b>&#x56FE;&#xA0;29.4.&#xA0;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;</b></p><div class="figure-contents"><div><img src="images/fs.gd.png" alt="&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;"></div></div></div><br class="figure-break"><p>&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;1MB&#xFF0C;&#x6BCF;&#x4E2A;&#x5757;&#x662F;1KB&#xFF0C;&#x5E94;&#x8BE5;&#x6709;1024&#x4E2A;&#x5757;&#xFF0C;&#x9664;&#x53BB;&#x542F;&#x52A8;&#x5757;&#x8FD8;&#x6709;1023&#x4E2A;&#x5757;&#xFF0C;&#x5206;&#x522B;&#x7F16;&#x53F7;&#x4E3A;1-1023&#xFF0C;&#x5B83;&#x4EEC;&#x5168;&#x90FD;&#x5C5E;&#x4E8E;Group 0&#x3002;&#x5176;&#x4E2D;&#xFF0C;Block 1&#x662F;&#x8D85;&#x7EA7;&#x5757;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x6307;&#x51FA;&#xFF0C;&#x5757;&#x4F4D;&#x56FE;&#x662F;Block 6&#xFF0C;&#x56E0;&#x6B64;&#x4E2D;&#x95F4;&#x7684;Block 2-5&#x662F;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#xFF0C;&#x5176;&#x4E2D;Block 3-5&#x4FDD;&#x7559;&#x672A;&#x7528;&#x3002;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x8FD8;&#x6307;&#x51FA;&#xFF0C;inode&#x4F4D;&#x56FE;&#x662F;Block 7&#xFF0C;inode&#x8868;&#x662F;&#x4ECE;Block 8&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x90A3;&#x4E48;inode&#x8868;&#x5230;&#x54EA;&#x4E2A;&#x5757;&#x7ED3;&#x675F;&#x5462;&#xFF1F;&#x7531;&#x4E8E;&#x8D85;&#x7EA7;&#x5757;&#x4E2D;&#x6307;&#x51FA;&#x6BCF;&#x4E2A;&#x5757;&#x7EC4;&#x6709;128&#x4E2A;inode&#xFF0C;&#x6BCF;&#x4E2A;inode&#x7684;&#x5927;&#x5C0F;&#x662F;128&#x5B57;&#x8282;&#xFF0C;&#x56E0;&#x6B64;&#x5171;&#x5360;16&#x4E2A;&#x5757;&#xFF0C;inode&#x8868;&#x7684;&#x8303;&#x56F4;&#x662F;Block 8-23&#x3002;</p><p>&#x4ECE;Block 24&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5757;&#x4E86;&#x3002;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x4E2D;&#x6307;&#x51FA;&#xFF0C;&#x7A7A;&#x95F2;&#x7684;&#x6570;&#x636E;&#x5757;&#x6709;986&#x4E2A;&#xFF0C;&#x7531;&#x4E8E;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x7A7A;&#x95F2;&#x5757;&#x662F;&#x8FDE;&#x7EED;&#x7684;Block 38-1023&#xFF0C;&#x7528;&#x6389;&#x4E86;&#x524D;&#x9762;&#x7684;Block 24-37&#x3002;&#x4ECE;&#x5757;&#x4F4D;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x524D;37&#x4F4D;&#xFF08;&#x524D;4&#x4E2A;&#x5B57;&#x8282;&#x52A0;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x4F4E;5&#x4F4D;&#xFF09;&#x90FD;&#x662F;1&#xFF0C;&#x5C31;&#x8868;&#x793A;Block 1-37&#x5DF2;&#x7528;:</p><pre class="screen">001800 ff ff ff ff 1f 00 00 00 00 00 00 00 00 00 00 00
001810 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00
*
001870 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 80
001880 ff ff ff ff ff ff ff ff ff ff ff ff ff ff ff ff
*</pre><p>&#x5728;&#x5757;&#x4F4D;&#x56FE;&#x4E2D;&#xFF0C;Block 38-1023&#x5BF9;&#x5E94;&#x7684;&#x4F4D;&#x90FD;&#x662F;0&#xFF08;&#x4E00;&#x76F4;&#x5230;001870&#x90A3;&#x4E00;&#x884C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x4F4E;7&#x4F4D;&#xFF09;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4F4D;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x4E86;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;0&#x8FD8;&#x662F;1&#x90FD;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x3002;&#x53EF;&#x89C1;&#xFF0C;&#x5757;&#x4F4D;&#x56FE;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x4E2D;&#x7684;&#x4F4D;&#x5E94;&#x8BE5;&#x6309;&#x4ECE;&#x4F4E;&#x4F4D;&#x5230;&#x9AD8;&#x4F4D;&#x7684;&#x987A;&#x5E8F;&#x6765;&#x770B;&#x3002;&#x4EE5;&#x540E;&#x968F;&#x7740;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x4F7F;&#x7528;&#x548C;&#x6DFB;&#x52A0;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF0C;&#x5757;&#x4F4D;&#x56FE;&#x4E2D;&#x7684;1&#x5C31;&#x53D8;&#x5F97;&#x4E0D;&#x8FDE;&#x7EED;&#x4E86;&#x3002;</p><p>&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x6307;&#x51FA;&#xFF0C;&#x7A7A;&#x95F2;&#x7684;inode&#x6709;117&#x4E2A;&#xFF0C;&#x7531;&#x4E8E;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x7A7A;&#x95F2;&#x7684;inode&#x4E5F;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;inode&#x7F16;&#x53F7;&#x4ECE;1&#x5230;128&#xFF0C;&#x7A7A;&#x95F2;&#x7684;inode&#x7F16;&#x53F7;&#x4ECE;12&#x5230;128&#x3002;&#x4ECE;inode&#x4F4D;&#x56FE;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x524D;11&#x4F4D;&#x90FD;&#x662F;1&#xFF0C;&#x8868;&#x793A;&#x524D;11&#x4E2A;inode&#x5DF2;&#x7528;&#xFF1A;</p><pre class="screen">001c00 ff 07 00 00 00 00 00 00 00 00 00 00 00 00 00 00
001c10 ff ff ff ff ff ff ff ff ff ff ff ff ff ff ff ff
*</pre><p>&#x4EE5;&#x540E;&#x968F;&#x7740;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x4F7F;&#x7528;&#x548C;&#x6DFB;&#x52A0;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF0C;inode&#x4F4D;&#x56FE;&#x4E2D;&#x7684;1&#x5C31;&#x53D8;&#x5F97;&#x4E0D;&#x8FDE;&#x7EED;&#x4E86;&#x3002;</p><p>001c00&#x8FD9;&#x4E00;&#x884C;&#x7684;128&#x4F4D;&#x5C31;&#x8868;&#x793A;&#x4E86;&#x6240;&#x6709;inode&#xFF0C;&#x56E0;&#x6B64;&#x4E0B;&#x9762;&#x7684;&#x884C;&#x4E0D;&#x7BA1;&#x662F;0&#x8FD8;&#x662F;1&#x90FD;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5DF2;&#x7528;&#x7684;11&#x4E2A;inode&#x4E2D;&#xFF0C;&#x524D;10&#x4E2A;inode&#x662F;&#x88AB;ext2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4FDD;&#x7559;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;2&#x4E2A;inode&#x662F;&#x6839;&#x76EE;&#x5F55;&#xFF0C;&#x7B2C;11&#x4E2A;inode&#x662F;<code class="literal">lost+found</code>&#x76EE;&#x5F55;&#xFF0C;&#x5757;&#x7EC4;&#x63CF;&#x8FF0;&#x7B26;&#x4E5F;&#x6307;&#x51FA;&#x8BE5;&#x7EC4;&#x6709;&#x4E24;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5C31;&#x662F;&#x6839;&#x76EE;&#x5F55;&#x548C;<code class="literal">lost+found</code>&#x3002;</p><p>&#x63A2;&#x7D22;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;<code class="literal">debugfs</code>&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x505A;&#x5404;&#x79CD;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x67E5;&#x770B;&#x4FE1;&#x606F;&#x3001;&#x6062;&#x590D;&#x6570;&#x636E;&#x3001;&#x4FEE;&#x6B63;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x4E0B;&#x9762;&#x7528;<code class="literal">debugfs</code>&#x6253;&#x5F00;<code class="literal">fs</code>&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x63D0;&#x793A;&#x7B26;&#x4E0B;&#x8F93;&#x5165;<code class="literal">help</code>&#x770B;&#x770B;&#x5B83;&#x90FD;&#x80FD;&#x505A;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#xFF1A;</p><pre class="screen">$ debugfs fs
debugfs 1.40.2 (12-Jul-2007)
debugfs:  help</pre><p>&#x5728;<code class="literal">debugfs</code>&#x7684;&#x63D0;&#x793A;&#x7B26;&#x4E0B;&#x8F93;&#x5165;<code class="literal">stat /</code>&#x547D;&#x4EE4;&#xFF0C;&#x8FD9;&#x65F6;&#x5728;&#x65B0;&#x7684;&#x4E00;&#x5C4F;&#x4E2D;&#x663E;&#x793A;&#x6839;&#x76EE;&#x5F55;&#x7684;inode&#x4FE1;&#x606F;&#xFF1A;</p><pre class="screen">Inode: 2   Type: directory    Mode:  0755   Flags: 0x0   Generation: 0
User:  1000   Group:  1000   Size: 1024
File ACL: 0    Directory ACL: 0
Links: 3   Blockcount: 2
Fragment:  Address: 0    Number: 0    Size: 0
ctime: 0x4764cc3b -- Sun Dec 16 14:56:59 2007
atime: 0x4764cc3b -- Sun Dec 16 14:56:59 2007
mtime: 0x4764cc3b -- Sun Dec 16 14:56:59 2007
BLOCKS:
(0):24
TOTAL: 1</pre><p>&#x6309;q&#x9000;&#x51FA;&#x8FD9;&#x4E00;&#x5C4F;&#xFF0C;&#x7136;&#x540E;&#x7528;<code class="literal">quit</code>&#x547D;&#x4EE4;&#x9000;&#x51FA;<code class="literal">debugfs</code>&#xFF1A;</p><pre class="screen">debugfs:  quit</pre><p>&#x628A;&#x4EE5;&#x4E0A;&#x4FE1;&#x606F;&#x548C;<code class="literal">od</code>&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x51FA;&#x5BF9;&#x7167;&#x8D77;&#x6765;&#x5206;&#x6790;&#xFF1A;</p><div class="figure"><a id="id2858859"></a><p class="title"><b>&#x56FE;&#xA0;29.5.&#xA0;&#x6839;&#x76EE;&#x5F55;&#x7684;inode</b></p><div class="figure-contents"><div><img src="images/fs.rootinode.png" alt="&#x6839;&#x76EE;&#x5F55;&#x7684;inode"></div></div></div><br class="figure-break"><p>&#x4E0A;&#x56FE;&#x4E2D;&#x7684;<code class="literal">st_mode</code>&#x4EE5;&#x516B;&#x8FDB;&#x5236;&#x8868;&#x793A;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x548C;&#x6587;&#x4EF6;&#x6743;&#x9650;&#xFF0C;&#x6700;&#x9AD8;&#x4F4D;&#x7684;4&#x8868;&#x793A;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x4E3A;&#x76EE;&#x5F55;&#xFF08;&#x5404;&#x79CD;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x7F16;&#x7801;&#x8BE6;&#x89C1;stat(2)&#xFF09;&#xFF0C;&#x4F4E;&#x4F4D;&#x7684;755&#x8868;&#x793A;&#x6743;&#x9650;&#x3002;Size&#x662F;1024&#xFF0C;&#x8BF4;&#x660E;&#x6839;&#x76EE;&#x5F55;&#x73B0;&#x5728;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x3002;Links&#x4E3A;3&#x8868;&#x793A;&#x6839;&#x76EE;&#x5F55;&#x6709;&#x4E09;&#x4E2A;&#x786C;&#x94FE;&#x63A5;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">.</code>&#x548C;<code class="literal">..</code>&#xFF0C;&#x4EE5;&#x53CA;<code class="literal">lost+found</code>&#x5B50;&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code class="literal">..</code>&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x7528;<code class="literal">/</code>&#x8868;&#x793A;&#x6839;&#x76EE;&#x5F55;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x540D;&#x4E3A;<code class="literal">/</code>&#x7684;&#x786C;&#x94FE;&#x63A5;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;<code class="literal">/</code>&#x662F;&#x8DEF;&#x5F84;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x6587;&#x4EF6;&#x540D;&#x4E2D;&#x51FA;&#x73B0;&#x3002;&#x8FD9;&#x91CC;&#x7684;<code class="literal">Blockcount</code>&#x662F;&#x4EE5;512&#x5B57;&#x8282;&#x4E3A;&#x4E00;&#x4E2A;&#x5757;&#x6765;&#x6570;&#x7684;&#xFF0C;&#x5E76;&#x975E;&#x683C;&#x5F0F;&#x5316;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x65F6;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x5757;&#x5927;&#x5C0F;&#xFF0C;&#x78C1;&#x76D8;&#x7684;&#x6700;&#x5C0F;&#x8BFB;&#x5199;&#x5355;&#x4F4D;&#x79F0;&#x4E3A;&#x6247;&#x533A;&#xFF08;Sector&#xFF09;<a id="id2858941" class="indexterm"></a>&#xFF0C;&#x901A;&#x5E38;&#x662F;512&#x5B57;&#x8282;&#xFF0C;&#x6240;&#x4EE5;<code class="literal">Blockcount</code>&#x662F;&#x78C1;&#x76D8;&#x7684;&#x7269;&#x7406;&#x5757;&#x6570;&#x91CF;&#xFF0C;&#x800C;&#x975E;&#x5206;&#x533A;&#x7684;&#x903B;&#x8F91;&#x5757;&#x6570;&#x91CF;&#x3002;&#x6839;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x7684;&#x4F4D;&#x7F6E;&#x7531;&#x4E0A;&#x56FE;&#x4E2D;&#x7684;<code class="literal">Blocks[0]</code>&#x6307;&#x51FA;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7B2C;24&#x4E2A;&#x5757;&#xFF0C;&#x5B83;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x662F;24&#xD7;0x400=0x6000&#xFF0C;&#x4ECE;<code class="literal">od</code>&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#x627E;&#x5230;006000&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x7684;&#x683C;&#x5F0F;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p><div class="figure"><a id="id2858972"></a><p class="title"><b>&#x56FE;&#xA0;29.6.&#xA0;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;</b></p><div class="figure-contents"><div><img src="images/fs.datablock.png" alt="&#x6839;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;"></div></div></div><br class="figure-break"><p>&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x7531;&#x8BB8;&#x591A;&#x4E0D;&#x5B9A;&#x957F;&#x7684;&#x8BB0;&#x5F55;&#x7EC4;&#x6210;&#xFF0C;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x63CF;&#x8FF0;&#x8BE5;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5728;&#x4E0A;&#x56FE;&#x4E2D;&#x7528;&#x6846;&#x8868;&#x793A;&#x3002;&#x7B2C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x63CF;&#x8FF0;inode&#x53F7;&#x4E3A;2&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6839;&#x76EE;&#x5F55;&#x672C;&#x8EAB;&#xFF0C;&#x8BE5;&#x8BB0;&#x5F55;&#x7684;&#x603B;&#x957F;&#x5EA6;&#x4E3A;12&#x5B57;&#x8282;&#xFF0C;&#x5176;&#x4E2D;&#x6587;&#x4EF6;&#x540D;&#x7684;&#x957F;&#x5EA6;&#x4E3A;1&#x5B57;&#x8282;&#xFF0C;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x4E3A;2&#xFF08;&#x89C1;&#x4E0B;&#x8868;&#xFF0C;&#x6CE8;&#x610F;&#x6B64;&#x5904;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x7F16;&#x7801;&#x548C;<code class="literal">st_mode</code>&#x4E0D;&#x4E00;&#x81F4;&#xFF09;&#xFF0C;&#x6587;&#x4EF6;&#x540D;&#x662F;<code class="literal">.</code>&#x3002;</p><div class="table"><a id="id2859019"></a><p class="title"><b>&#x8868;&#xA0;29.1.&#xA0;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x7F16;&#x7801;</b></p><div class="table-contents"><table summary="&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x7F16;&#x7801;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#x7F16;&#x7801;</th><th>&#x6587;&#x4EF6;&#x7C7B;&#x578B;</th></tr></thead><tbody><tr><td>0</td><td>Unknown</td></tr><tr><td>1</td><td>Regular file</td></tr><tr><td>2</td><td>Directory</td></tr><tr><td>3</td><td>Character device</td></tr><tr><td>4</td><td>Block device</td></tr><tr><td>5</td><td>Named pipe</td></tr><tr><td>6</td><td>Socket</td></tr><tr><td>7</td><td>Symbolic link</td></tr></tbody></table></div></div><br class="table-break"><p>&#x7B2C;&#x4E8C;&#x6761;&#x8BB0;&#x5F55;&#x4E5F;&#x662F;&#x63CF;&#x8FF0;inode&#x53F7;&#x4E3A;2&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x6839;&#x76EE;&#x5F55;&#xFF09;&#xFF0C;&#x8BE5;&#x8BB0;&#x5F55;&#x603B;&#x957F;&#x5EA6;&#x4E3A;12&#x5B57;&#x8282;&#xFF0C;&#x5176;&#x4E2D;&#x6587;&#x4EF6;&#x540D;&#x7684;&#x957F;&#x5EA6;&#x4E3A;2&#x5B57;&#x8282;&#xFF0C;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x4E3A;2&#xFF0C;&#x6587;&#x4EF6;&#x540D;&#x5B57;&#x7B26;&#x4E32;&#x662F;<code class="literal">..</code>&#x3002;&#x7B2C;&#x4E09;&#x6761;&#x8BB0;&#x5F55;&#x4E00;&#x76F4;&#x5EF6;&#x7EED;&#x5230;&#x8BE5;&#x6570;&#x636E;&#x5757;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x63CF;&#x8FF0;inode&#x53F7;&#x4E3A;11&#x7684;&#x6587;&#x4EF6;&#xFF08;<code class="literal">lost+found</code>&#x76EE;&#x5F55;&#xFF09;&#xFF0C;&#x8BE5;&#x8BB0;&#x5F55;&#x7684;&#x603B;&#x957F;&#x5EA6;&#x4E3A;1000&#x5B57;&#x8282;&#xFF08;&#x548C;&#x524D;&#x9762;&#x4E24;&#x6761;&#x8BB0;&#x5F55;&#x52A0;&#x8D77;&#x6765;&#x662F;1024&#x5B57;&#x8282;&#xFF09;&#xFF0C;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x4E3A;2&#xFF0C;&#x6587;&#x4EF6;&#x540D;&#x5B57;&#x7B26;&#x4E32;&#x662F;<code class="literal">lost+found</code>&#xFF0C;&#x540E;&#x9762;&#x5168;&#x662F;0&#x5B57;&#x8282;&#x3002;&#x5982;&#x679C;&#x8981;&#x5728;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x7B2C;&#x4E09;&#x6761;&#x8BB0;&#x5F55;&#x622A;&#x77ED;&#xFF0C;&#x5728;&#x539F;&#x6765;&#x7684;0&#x5B57;&#x8282;&#x5904;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x592A;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x4E0D;&#x591F;&#x7528;&#xFF0C;&#x5219;&#x4F1A;&#x5206;&#x914D;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5757;&#x7F16;&#x53F7;&#x4F1A;&#x586B;&#x5145;&#x5230;inode&#x7684;<code class="literal">Blocks[1]</code>&#x5B57;&#x6BB5;&#x3002;</p><p><code class="literal">debugfs</code>&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;<code class="literal">cd</code>&#x3001;<code class="literal">ls</code>&#x7B49;&#x547D;&#x4EE4;&#xFF0C;&#x4E0D;&#x9700;&#x8981;<code class="literal">mount</code>&#x5C31;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x4F8B;&#x5982;&#x7528;<code class="literal">ls</code>&#x67E5;&#x770B;&#x6839;&#x76EE;&#x5F55;&#xFF1A;</p><pre class="screen"> 2  (12) .    2  (12) ..    11  (1000) lost+found</pre><p>&#x5217;&#x51FA;&#x4E86;inode&#x53F7;&#x3001;&#x8BB0;&#x5F55;&#x957F;&#x5EA6;&#x548C;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x4ECE;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x8BFB;&#x51FA;&#x6765;&#x7684;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a id="id2859176"></a>&#x4E60;&#x9898;</h4></div></div></div><p>1&#x3001;&#x8BF7;&#x8BFB;&#x8005;&#x4EFF;&#x7167;&#x5BF9;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x81EA;&#x5DF1;&#x5206;&#x6790;<code class="literal">lost+found</code>&#x76EE;&#x5F55;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#x7684;&#x683C;&#x5F0F;&#x3002;</p><p>2&#x3001;<code class="literal">mount</code>&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x6DFB;&#x52A0;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;<code class="literal">umount</code>&#x4E0B;&#x6765;&#xFF0C;&#x518D;&#x6B21;&#x5206;&#x6790;&#x5B83;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x548C;&#x539F;&#x6765;&#x7684;&#x7ED3;&#x679C;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x770B;&#x54EA;&#x4E9B;&#x5B57;&#x8282;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#x3002;</p></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2859212"></a>2.3.&#xA0;&#x6570;&#x636E;&#x5757;&#x5BFB;&#x5740;</h3></div></div></div><p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x6709;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5757;&#x5F88;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x8FDE;&#x7EED;&#x5B58;&#x653E;&#x7684;&#xFF0C;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5BFB;&#x5740;&#x5230;&#x6BCF;&#x4E2A;&#x5757;&#x5462;&#xFF1F;&#x6839;&#x636E;&#x4E0A;&#x9762;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x662F;&#x901A;&#x8FC7;&#x5176;inode&#x4E2D;&#x7684;&#x7D22;&#x5F15;&#x9879;<code class="literal">Blocks[0]</code>&#x627E;&#x5230;&#x7684;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7D22;&#x5F15;&#x9879;&#x4E00;&#x5171;&#x6709;15&#x4E2A;&#xFF0C;&#x4ECE;<code class="literal">Blocks[0]</code>&#x5230;<code class="literal">Blocks[14]</code>&#xFF0C;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x9879;&#x5360;4&#x5B57;&#x8282;&#x3002;&#x524D;12&#x4E2A;&#x7D22;&#x5F15;&#x9879;&#x90FD;&#x8868;&#x793A;&#x5757;&#x7F16;&#x53F7;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;<code class="literal">Blocks[0]</code>&#x5B57;&#x6BB5;&#x4FDD;&#x5B58;&#x7740;24&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x7B2C;24&#x4E2A;&#x5757;&#x662F;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5982;&#x679C;&#x5757;&#x5927;&#x5C0F;&#x662F;1KB&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4ECE;0&#x5B57;&#x8282;&#x5230;12KB&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x5269;&#x4E0B;&#x7684;&#x4E09;&#x4E2A;&#x7D22;&#x5F15;&#x9879;<code class="literal">Blocks[12]</code>&#x5230;<code class="literal">Blocks[14]</code>&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x7528;&#x7684;&#xFF0C;&#x5C31;&#x53EA;&#x80FD;&#x8868;&#x793A;&#x6700;&#x5927;15KB&#x7684;&#x6587;&#x4EF6;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4E09;&#x4E2A;&#x7D22;&#x5F15;&#x9879;&#x90FD;&#x662F;&#x95F4;&#x63A5;&#x7D22;&#x5F15;&#x3002;</p><p>&#x7D22;&#x5F15;&#x9879;<code class="literal">Blocks[12]</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x5757;&#x5E76;&#x975E;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x800C;&#x662F;&#x79F0;&#x4E3A;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#xFF08;Indirect Block&#xFF09;<a id="id2859276" class="indexterm"></a>&#xFF0C;&#x5176;&#x4E2D;&#x5B58;&#x653E;&#x7684;&#x90FD;&#x662F;&#x7C7B;&#x4F3C;<code class="literal">Blocks[0]</code>&#x8FD9;&#x79CD;&#x7D22;&#x5F15;&#x9879;&#xFF0C;&#x518D;&#x7531;&#x7D22;&#x5F15;&#x9879;&#x6307;&#x5411;&#x6570;&#x636E;&#x5757;&#x3002;&#x8BBE;&#x5757;&#x5927;&#x5C0F;&#x662F;b&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#x4E2D;&#x53EF;&#x4EE5;&#x5B58;&#x653E;b/4&#x4E2A;&#x7D22;&#x5F15;&#x9879;&#xFF0C;&#x6307;&#x5411;b/4&#x4E2A;&#x6570;&#x636E;&#x5757;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x628A;<code class="literal">Blocks[0]</code>&#x5230;<code class="literal">Blocks[12]</code>&#x90FD;&#x7528;&#x4E0A;&#xFF0C;&#x6700;&#x591A;&#x53EF;&#x4EE5;&#x8868;&#x793A;b/4+12&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5BF9;&#x4E8E;&#x5757;&#x5927;&#x5C0F;&#x662F;1K&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6700;&#x5927;&#x53EF;&#x8868;&#x793A;268K&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6CE8;&#x610F;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5757;&#x7F16;&#x53F7;&#x662F;&#x4ECE;0&#x5F00;&#x59CB;&#x7684;&#xFF0C;<code class="literal">Blocks[0]</code>&#x6307;&#x5411;&#x7B2C;0&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;<code class="literal">Blocks[11]</code>&#x6307;&#x5411;&#x7B2C;11&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;<code class="literal">Blocks[12]</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x9879;&#x6307;&#x5411;&#x7B2C;12&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p><div class="figure"><a id="id2859328"></a><p class="title"><b>&#x56FE;&#xA0;29.7.&#xA0;&#x6570;&#x636E;&#x5757;&#x7684;&#x5BFB;&#x5740;</b></p><div class="figure-contents"><div><img src="images/fs.datablockaddr.png" alt="&#x6570;&#x636E;&#x5757;&#x7684;&#x5BFB;&#x5740;"></div></div></div><br class="figure-break"><p>&#x4ECE;&#x4E0A;&#x56FE;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x7D22;&#x5F15;&#x9879;<code class="literal">Blocks[13]</code>&#x6307;&#x5411;&#x4E24;&#x7EA7;&#x7684;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#xFF0C;&#x6700;&#x591A;&#x53EF;&#x8868;&#x793A;(b/4)<sup>2</sup>+b/4+12&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5BF9;&#x4E8E;1K&#x7684;&#x5757;&#x5927;&#x5C0F;&#x6700;&#x5927;&#x53EF;&#x8868;&#x793A;64.26MB&#x7684;&#x6587;&#x4EF6;&#x3002;&#x7D22;&#x5F15;&#x9879;<code class="literal">Blocks[14]</code>&#x6307;&#x5411;&#x4E09;&#x7EA7;&#x7684;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#xFF0C;&#x6700;&#x591A;&#x53EF;&#x8868;&#x793A;(b/4)<sup>3</sup>+(b/4)<sup>2</sup>+b/4+12&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5BF9;&#x4E8E;1K&#x7684;&#x5757;&#x5927;&#x5C0F;&#x6700;&#x5927;&#x53EF;&#x8868;&#x793A;16.06GB&#x7684;&#x6587;&#x4EF6;&#x3002;</p><p>&#x53EF;&#x89C1;&#xFF0C;&#x8FD9;&#x79CD;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x5BF9;&#x4E8E;&#x8BBF;&#x95EE;&#x4E0D;&#x8D85;&#x8FC7;12&#x4E2A;&#x6570;&#x636E;&#x5757;&#x7684;&#x5C0F;&#x6587;&#x4EF6;&#x662F;&#x975E;&#x5E38;&#x5FEB;&#x7684;&#xFF0C;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x6570;&#x636E;&#x53EA;&#x9700;&#x8981;&#x4E24;&#x6B21;&#x8BFB;&#x76D8;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x6B21;&#x8BFB;inode&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8BFB;&#x7D22;&#x5F15;&#x9879;&#xFF09;&#x4E00;&#x6B21;&#x8BFB;&#x6570;&#x636E;&#x5757;&#x3002;&#x800C;&#x8BBF;&#x95EE;&#x5927;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5219;&#x9700;&#x8981;&#x6700;&#x591A;&#x4E94;&#x6B21;&#x8BFB;&#x76D8;&#x64CD;&#x4F5C;&#xFF1A;inode&#x3001;&#x4E00;&#x7EA7;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#x3001;&#x4E8C;&#x7EA7;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#x3001;&#x4E09;&#x7EA7;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x5757;&#x3001;&#x6570;&#x636E;&#x5757;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x78C1;&#x76D8;&#x4E2D;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#x5F80;&#x5F80;&#x5DF2;&#x7ECF;&#x88AB;&#x5185;&#x6838;&#x7F13;&#x5B58;&#x4E86;&#xFF0C;&#x8BFB;&#x5927;&#x6587;&#x4EF6;&#x7684;&#x6548;&#x7387;&#x4E5F;&#x4E0D;&#x4F1A;&#x592A;&#x4F4E;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2859394"></a>2.4.&#xA0;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x64CD;&#x4F5C;&#x7684;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;</h3></div></div></div><p>&#x672C;&#x8282;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x64CD;&#x4F5C;&#x5E38;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x6587;&#x4EF6;&#x64CD;&#x4F5C;&#x547D;&#x4EE4;&#x5982;<code class="literal">ls</code>&#x3001;<code class="literal">cp</code>&#x3001;<code class="literal">mv</code>&#x7B49;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x672C;&#x8282;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x8BB2;&#x89E3;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x7406;&#x89E3;&#x4E86;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x4E4B;&#x540E;&#x518D;&#x770B;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x7684;&#x7528;&#x6CD5;&#x5C31;&#x5F88;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x8BF7;&#x8BFB;&#x8005;&#x81EA;&#x5DF1;&#x67E5;&#x9605;Man Page&#x4E86;&#x89E3;&#x5176;&#x7528;&#x6CD5;&#x3002;</p><p><code class="literal">stat(2)</code>&#x51FD;&#x6570;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x7684;inode&#xFF0C;&#x7136;&#x540E;&#x628A;inode&#x4E2D;&#x7684;&#x5404;&#x79CD;&#x6587;&#x4EF6;&#x5C5E;&#x6027;&#x586B;&#x5165;&#x4E00;&#x4E2A;<code class="literal">struct stat</code>&#x7ED3;&#x6784;&#x4F53;&#x4F20;&#x51FA;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x3002;<code class="literal">stat(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">stat</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;<code class="literal">stat</code>&#x9700;&#x8981;&#x6839;&#x636E;&#x4F20;&#x5165;&#x7684;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x627E;&#x5230;inode&#xFF0C;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x8DEF;&#x5F84;&#x662F;<code class="literal">/opt/file</code>&#xFF0C;&#x5219;&#x67E5;&#x627E;&#x7684;&#x987A;&#x5E8F;&#x662F;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x8BFB;&#x51FA;inode&#x8868;&#x4E2D;&#x7B2C;2&#x9879;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6839;&#x76EE;&#x5F55;&#x7684;inode&#xFF0C;&#x4ECE;&#x4E2D;&#x627E;&#x51FA;&#x6839;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x7684;&#x4F4D;&#x7F6E;</p></li><li><p>&#x4ECE;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x627E;&#x51FA;&#x6587;&#x4EF6;&#x540D;&#x4E3A;<code class="literal">opt</code>&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x4ECE;&#x8BB0;&#x5F55;&#x4E2D;&#x8BFB;&#x51FA;&#x5B83;&#x7684;inode&#x53F7;</p></li><li><p>&#x8BFB;&#x51FA;<code class="literal">opt</code>&#x76EE;&#x5F55;&#x7684;inode&#xFF0C;&#x4ECE;&#x4E2D;&#x627E;&#x51FA;&#x5B83;&#x7684;&#x6570;&#x636E;&#x5757;&#x7684;&#x4F4D;&#x7F6E;</p></li><li><p>&#x4ECE;<code class="literal">opt</code>&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x627E;&#x51FA;&#x6587;&#x4EF6;&#x540D;&#x4E3A;<code class="literal">file</code>&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x4ECE;&#x8BB0;&#x5F55;&#x4E2D;&#x8BFB;&#x51FA;&#x5B83;&#x7684;inode&#x53F7;</p></li><li><p>&#x8BFB;&#x51FA;<code class="literal">file</code>&#x6587;&#x4EF6;&#x7684;inode</p></li></ol></div><p>&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x7C7B;&#x4F3C;<code class="literal">stat</code>&#x7684;&#x51FD;&#x6570;&#xFF1A;<code class="literal">fstat(2)</code>&#x51FD;&#x6570;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x5DF2;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x4F20;&#x51FA;inode&#x4FE1;&#x606F;&#xFF0C;<code class="literal">lstat(2)</code>&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x4F20;&#x5165;&#x8DEF;&#x5F84;&#x4F20;&#x51FA;inode&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x548C;<code class="literal">stat</code>&#x51FD;&#x6570;&#x6709;&#x4E00;&#x70B9;&#x4E0D;&#x540C;&#xFF0C;&#x5F53;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x65F6;&#xFF0C;<code class="literal">stat(2)</code>&#x51FD;&#x6570;&#x4F20;&#x51FA;&#x7684;&#x662F;&#x5B83;&#x6240;&#x6307;&#x5411;&#x7684;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x7684;inode&#xFF0C;&#x800C;<code class="literal">lstat</code>&#x51FD;&#x6570;&#x4F20;&#x51FA;&#x7684;&#x5C31;&#x662F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x6587;&#x4EF6;&#x672C;&#x8EAB;&#x7684;inode&#x3002;</p><p><code class="literal">access(2)</code>&#x51FD;&#x6570;&#x68C0;&#x67E5;&#x6267;&#x884C;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x7684;&#x7528;&#x6237;&#x662F;&#x5426;&#x6709;&#x6743;&#x9650;&#x8BBF;&#x95EE;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4F20;&#x5165;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x548C;&#x8981;&#x6267;&#x884C;&#x7684;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#xFF08;&#x8BFB;/&#x5199;/&#x6267;&#x884C;&#xFF09;&#xFF0C;<code class="literal">access</code>&#x51FD;&#x6570;&#x53D6;&#x51FA;&#x6587;&#x4EF6;inode&#x4E2D;&#x7684;<code class="literal">st_mode</code>&#x5B57;&#x6BB5;&#xFF0C;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;0&#x8868;&#x793A;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#xFF0C;&#x8FD4;&#x56DE;-1&#x8868;&#x793A;&#x9519;&#x8BEF;&#x6216;&#x4E0D;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#x3002;</p><p><code class="literal">chmod(2)</code>&#x548C;<code class="literal">fchmod(2)</code>&#x51FD;&#x6570;&#x6539;&#x53D8;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4FEE;&#x6539;inode&#x4E2D;&#x7684;<code class="literal">st_mode</code>&#x5B57;&#x6BB5;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x533A;&#x522B;&#x7C7B;&#x4F3C;&#x4E8E;<code class="literal">stat</code>/<code class="literal">fstat</code>&#x3002;<code class="literal">chmod(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">chmod</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p><code class="literal">chown(2)</code>/<code class="literal">fchown(2)</code>/<code class="literal">lchown(2)</code>&#x6539;&#x53D8;&#x6587;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x8005;&#x548C;&#x7EC4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4FEE;&#x6539;inode&#x4E2D;&#x7684;<code class="literal">User</code>&#x548C;<code class="literal">Group</code>&#x5B57;&#x6BB5;&#xFF0C;&#x53EA;&#x6709;&#x8D85;&#x7EA7;&#x7528;&#x6237;&#x624D;&#x80FD;&#x6B63;&#x786E;&#x8C03;&#x7528;&#x8FD9;&#x51E0;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x51E0;&#x4E2A;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x7C7B;&#x4F3C;&#x4E8E;<code class="literal">stat</code>/<code class="literal">fstat</code>/<code class="literal">lstat</code>&#x3002;<code class="literal">chown(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">chown</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p><code class="literal">utime(2)</code>&#x51FD;&#x6570;&#x6539;&#x53D8;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x548C;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4FEE;&#x6539;inode&#x4E2D;&#x7684;<code class="literal">atime</code>&#x548C;<code class="literal">mtime</code>&#x5B57;&#x6BB5;&#x3002;<code class="literal">touch(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">utime</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p><code class="literal">truncate(2)</code>&#x548C;<code class="literal">ftruncate(2)</code>&#x51FD;&#x6570;&#x628A;&#x6587;&#x4EF6;&#x622A;&#x65AD;&#x5230;&#x67D0;&#x4E2A;&#x957F;&#x5EA6;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x7684;&#x957F;&#x5EA6;&#x6BD4;&#x539F;&#x6765;&#x7684;&#x957F;&#x5EA6;&#x77ED;&#xFF0C;&#x5219;&#x540E;&#x9762;&#x7684;&#x6570;&#x636E;&#x88AB;&#x622A;&#x6389;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x7684;&#x957F;&#x5EA6;&#x6BD4;&#x539F;&#x6765;&#x7684;&#x957F;&#x5EA6;&#x957F;&#xFF0C;&#x5219;&#x540E;&#x9762;&#x591A;&#x51FA;&#x6765;&#x7684;&#x90E8;&#x5206;&#x7528;0&#x586B;&#x5145;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x4FEE;&#x6539;inode&#x4E2D;&#x7684;<code class="literal">Blocks</code>&#x7D22;&#x5F15;&#x9879;&#x4EE5;&#x53CA;&#x5757;&#x4F4D;&#x56FE;&#x4E2D;&#x76F8;&#x5E94;&#x7684;bit&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x533A;&#x522B;&#x7C7B;&#x4F3C;&#x4E8E;<code class="literal">stat</code>/<code class="literal">fstat</code>&#x3002;</p><p><code class="literal">link(2)</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x786C;&#x94FE;&#x63A5;&#xFF0C;&#x5176;&#x539F;&#x7406;&#x662F;&#x5728;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x6761;&#x65B0;&#x8BB0;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;&#x7684;inode&#x53F7;&#x5B57;&#x6BB5;&#x548C;&#x539F;&#x6587;&#x4EF6;&#x76F8;&#x540C;&#x3002;<code class="literal">symlink(2)</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;inode&#xFF0C;&#x5176;&#x4E2D;<code class="literal">st_mode</code>&#x5B57;&#x6BB5;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x662F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF0C;&#x539F;&#x6587;&#x4EF6;&#x7684;&#x8DEF;&#x5F84;&#x4FDD;&#x5B58;&#x5728;inode&#x4E2D;&#x6216;&#x8005;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x6765;&#x4FDD;&#x5B58;&#x3002;<code class="literal">ln(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">link</code>&#x548C;<code class="literal">symlink</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p><code class="literal">unlink(2)</code>&#x51FD;&#x6570;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x3002;&#x5982;&#x679C;&#x662F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x5219;&#x91CA;&#x653E;&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x6E05;&#x9664;inode&#x4F4D;&#x56FE;&#x548C;&#x5757;&#x4F4D;&#x56FE;&#x4E2D;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x3002;&#x5982;&#x679C;&#x662F;&#x786C;&#x94FE;&#x63A5;&#x5219;&#x4ECE;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x6E05;&#x9664;&#x4E00;&#x6761;&#x6587;&#x4EF6;&#x540D;&#x8BB0;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x6570;&#x5DF2;&#x7ECF;&#x662F;1&#x4E86;&#x8FD8;&#x8981;&#x5220;&#x9664;&#x5B83;&#xFF0C;&#x5C31;&#x540C;&#x65F6;&#x91CA;&#x653E;&#x5B83;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x6E05;&#x9664;inode&#x4F4D;&#x56FE;&#x548C;&#x5757;&#x4F4D;&#x56FE;&#x4E2D;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x771F;&#x7684;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x4E86;&#x3002;<code class="literal">unlink(1)</code>&#x547D;&#x4EE4;&#x548C;<code class="literal">rm(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">unlink</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p><code class="literal">rename(2)</code>&#x51FD;&#x6570;&#x6539;&#x53D8;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x8BB0;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x539F;&#x6587;&#x4EF6;&#x540D;&#x548C;&#x65B0;&#x6587;&#x4EF6;&#x540D;&#x4E0D;&#x5728;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x5219;&#x9700;&#x8981;&#x4ECE;&#x539F;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x6E05;&#x9664;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x7136;&#x540E;&#x6DFB;&#x52A0;&#x5230;&#x65B0;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x3002;<code class="literal">mv(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">rename</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x540C;&#x4E00;&#x5206;&#x533A;&#x7684;&#x4E0D;&#x540C;&#x76EE;&#x5F55;&#x4E2D;&#x79FB;&#x52A8;&#x6587;&#x4EF6;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x590D;&#x5236;&#x548C;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6539;&#x540D;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x4F7F;&#x8981;&#x79FB;&#x52A8;&#x6574;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x5F88;&#x591A;&#x5B50;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#x4E5F;&#x8981;&#x968F;&#x7740;&#x4E00;&#x8D77;&#x79FB;&#x52A8;&#xFF0C;&#x79FB;&#x52A8;&#x64CD;&#x4F5C;&#x4E5F;&#x53EA;&#x662F;&#x5BF9;&#x9876;&#x7EA7;&#x76EE;&#x5F55;&#x7684;&#x6539;&#x540D;&#x64CD;&#x4F5C;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x533A;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#x6587;&#x4EF6;&#x5C31;&#x5FC5;&#x987B;&#x590D;&#x5236;&#x548C;&#x5220;&#x9664;inode&#x548C;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x79FB;&#x52A8;&#x6574;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x6240;&#x6709;&#x5B50;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#x90FD;&#x8981;&#x590D;&#x5236;&#x5220;&#x9664;&#xFF0C;&#x8FD9;&#x5C31;&#x5F88;&#x6162;&#x4E86;&#x3002;</p><p><code class="literal">readlink(2)</code>&#x51FD;&#x6570;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x6240;&#x6307;&#x5411;&#x7684;&#x76EE;&#x6807;&#x8DEF;&#x5F84;&#xFF0C;&#x5176;&#x539F;&#x7406;&#x662F;&#x4ECE;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x7684;inode&#x6216;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x8BFB;&#x51FA;&#x4FDD;&#x5B58;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x76EE;&#x6807;&#x8DEF;&#x5F84;&#x3002;</p><p><code class="literal">mkdir(2)</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x8981;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x5728;&#x5B83;&#x7684;&#x7236;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x914D;&#x65B0;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#xFF0C;inode&#x7684;<code class="literal">st_mode</code>&#x5B57;&#x6BB5;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x662F;&#x76EE;&#x5F55;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x586B;&#x4E24;&#x4E2A;&#x8BB0;&#x5F55;&#xFF0C;&#x5206;&#x522B;&#x662F;<code class="literal">.</code>&#x548C;<code class="literal">..</code>&#xFF0C;&#x7531;&#x4E8E;<code class="literal">..</code>&#x8868;&#x793A;&#x7236;&#x76EE;&#x5F55;&#xFF0C;&#x56E0;&#x6B64;&#x7236;&#x76EE;&#x5F55;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x6570;&#x8981;&#x52A0;1&#x3002;<code class="literal">mkdir(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">mkdir</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p><code class="literal">rmdir(2)</code>&#x51FD;&#x6570;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x5FC5;&#x987B;&#x662F;&#x7A7A;&#x7684;&#xFF08;&#x53EA;&#x5305;&#x542B;<code class="literal">.</code>&#x548C;<code class="literal">..</code>&#xFF09;&#x624D;&#x80FD;&#x5220;&#x9664;&#xFF0C;&#x8981;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x91CA;&#x653E;&#x5B83;&#x7684;inode&#x548C;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x6E05;&#x9664;inode&#x4F4D;&#x56FE;&#x548C;&#x5757;&#x4F4D;&#x56FE;&#x4E2D;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#xFF0C;&#x6E05;&#x9664;&#x7236;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x7236;&#x76EE;&#x5F55;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x6570;&#x8981;&#x51CF;1&#x3002;<code class="literal">rmdir(1)</code>&#x547D;&#x4EE4;&#x662F;&#x57FA;&#x4E8E;<code class="literal">rmdir</code>&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p><p><code class="literal">opendir(3)</code>/<code class="literal">readdir(3)</code>/<code class="literal">closedir(3)</code>&#x7528;&#x4E8E;&#x904D;&#x5386;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#x3002;<code class="literal">opendir</code>&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code class="literal">DIR *</code>&#x6307;&#x9488;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;<code class="literal">FILE *</code>&#x6307;&#x9488;&#x7684;&#x53E5;&#x67C4;&#xFF0C;<code class="literal">closedir</code>&#x7528;&#x4E8E;&#x5173;&#x95ED;&#x8FD9;&#x4E2A;&#x53E5;&#x67C4;&#xFF0C;&#x628A;<code class="literal">DIR *</code>&#x6307;&#x9488;&#x4F20;&#x7ED9;<code class="literal">readdir</code>&#x8BFB;&#x53D6;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x6BCF;&#x6B21;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6307;&#x5411;<code class="literal">struct dirent</code>&#x7684;&#x6307;&#x9488;&#xFF0C;&#x53CD;&#x590D;&#x8BFB;&#x5C31;&#x53EF;&#x4EE5;&#x904D;&#x5386;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#xFF0C;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x904D;&#x5386;&#x5B8C;&#x4E4B;&#x540E;<code class="literal">readdir</code>&#x8FD4;&#x56DE;<code class="literal">NULL</code>&#x3002;&#x7ED3;&#x6784;&#x4F53;<code class="literal">struct dirent</code>&#x7684;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="programlisting">struct dirent {
	ino_t          d_ino;       /* inode number */
	off_t          d_off;       /* offset to the next dirent */
	unsigned short d_reclen;    /* length of this record */
	unsigned char  d_type;      /* type of file */
	char           d_name[256]; /* filename */
};</pre><p>&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#x548C;<a class="xref" href="ch29s02.html#fs.datablock">&#x56FE;&#xA0;29.6 &#x201C;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x201D;</a>&#x57FA;&#x672C;&#x4E00;&#x81F4;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x6587;&#x4EF6;&#x540D;<code class="literal">d_name</code>&#x88AB;&#x5E93;&#x51FD;&#x6570;&#x5904;&#x7406;&#x8FC7;&#xFF0C;&#x5DF2;&#x7ECF;&#x5728;&#x7ED3;&#x5C3E;&#x52A0;&#x4E86;&apos;\0&apos;&#xFF0C;&#x800C;<a class="xref" href="ch29s02.html#fs.datablock">&#x56FE;&#xA0;29.6 &#x201C;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5757;&#x201D;</a>&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x5B57;&#x6BB5;&#x4E0D;&#x4FDD;&#x8BC1;&#x662F;&#x4EE5;&apos;\0&apos;&#x7ED3;&#x5C3E;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x524D;&#x9762;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x957F;&#x5EA6;&#x5B57;&#x6BB5;&#x786E;&#x5B9A;&#x6587;&#x4EF6;&#x540D;&#x5230;&#x54EA;&#x91CC;&#x7ED3;&#x675F;&#x3002;</p><p>&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.kr" title="The C Programming Language">[<abbr class="abbrev">K&amp;R</abbr>]</a>&#xFF0C;&#x4F5C;&#x7528;&#x662F;&#x9012;&#x5F52;&#x5730;&#x6253;&#x5370;&#x51FA;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6240;&#x6709;&#x5B50;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#xFF0C;&#x7C7B;&#x4F3C;<code class="literal">ls -R</code>&#x3002;</p><div class="example"><a id="id2860134"></a><p class="title"><b>&#x4F8B;&#xA0;29.1.&#xA0;&#x9012;&#x5F52;&#x5217;&#x51FA;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5217;&#x8868;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;sys/types.h&gt;
#include &lt;sys/stat.h&gt;
#include &lt;unistd.h&gt;
#include &lt;dirent.h&gt;
#include &lt;stdio.h&gt;
#include &lt;string.h&gt;

#define MAX_PATH 1024

/* dirwalk:  apply fcn to all files in dir */
void dirwalk(char *dir, void (*fcn)(char *))
{
	char name[MAX_PATH];
	struct dirent *dp;
	DIR *dfd;

	if ((dfd = opendir(dir)) == NULL) {
		fprintf(stderr, &quot;dirwalk: can&apos;t open %s\n&quot;, dir);
		return;
	}
	while ((dp = readdir(dfd)) != NULL) {
		if (strcmp(dp-&gt;d_name, &quot;.&quot;) == 0
		    || strcmp(dp-&gt;d_name, &quot;..&quot;) == 0)
			continue;    /* skip self and parent */
		if (strlen(dir)+strlen(dp-&gt;d_name)+2 &gt; sizeof(name))
			fprintf(stderr, &quot;dirwalk: name %s %s too long\n&quot;,
				dir, dp-&gt;d_name);
		else {
			sprintf(name, &quot;%s/%s&quot;, dir, dp-&gt;d_name);
			(*fcn)(name);
		}
	}
	closedir(dfd);
}

/* fsize:  print the size and name of file &quot;name&quot; */
void fsize(char *name)
{
	struct stat stbuf;

	if (stat(name, &amp;stbuf) == -1) {
		fprintf(stderr, &quot;fsize: can&apos;t access %s\n&quot;, name);
		return;
	}
	if ((stbuf.st_mode &amp; S_IFMT) == S_IFDIR)
		dirwalk(name, fsize);
	printf(&quot;%8ld %s\n&quot;, stbuf.st_size, name);
}

int main(int argc, char **argv)
{
	if (argc == 1)  /* default: current directory */
		fsize(&quot;.&quot;);
	else
		while (--argc &gt; 0)
			fsize(*++argv);
	return 0;
}</pre></div></div><br class="example-break"><p>&#x7136;&#x800C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x8FD8;&#x662F;&#x4E0D;&#x5982;<code class="literal">ls -R</code>&#x5065;&#x58EE;&#xFF0C;&#x5B83;&#x6709;&#x53EF;&#x80FD;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4F1A;&#x5BFC;&#x81F4;&#x6B7B;&#x5FAA;&#x73AF;&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch29s01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch29.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch29s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">1.&#xA0;&#x5F15;&#x8A00;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;3.&#xA0;VFS</td></tr></tbody></table></div>
</body></html>