<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch30.html" title="&#x7B2C;&#xA0;30&#xA0;&#x7AE0;&#xA0;&#x8FDB;&#x7A0B;"><link rel="prev" href="ch30s03.html" title="3.&#xA0;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;"><link rel="next" href="ch30s05.html" title="5.&#xA0;&#x7EC3;&#x4E60;&#xFF1A;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x7684;Shell"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch30s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;30&#xA0;&#x7AE0;&#xA0;&#x8FDB;&#x7A0B;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch30s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2867770"></a>4.&#xA0;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;</h2></div></div></div><p>&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5404;&#x81EA;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x8981;&#x4EA4;&#x6362;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5185;&#x6838;&#xFF0C;&#x5728;&#x5185;&#x6838;&#x4E2D;&#x5F00;&#x8F9F;&#x4E00;&#x5757;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x8FDB;&#x7A0B;1&#x628A;&#x6570;&#x636E;&#x4ECE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x62F7;&#x5230;&#x5185;&#x6838;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x8FDB;&#x7A0B;2&#x518D;&#x4ECE;&#x5185;&#x6838;&#x7F13;&#x51B2;&#x533A;&#x628A;&#x6570;&#x636E;&#x8BFB;&#x8D70;&#xFF0C;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#x7684;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x79F0;&#x4E3A;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#xFF08;IPC&#xFF0C;InterProcess Communication&#xFF09;<a id="id2867790" class="indexterm"></a>&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p><div class="figure"><a id="id2867799"></a><p class="title"><b>&#x56FE;&#xA0;30.6.&#xA0;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;</b></p><div class="figure-contents"><div><img src="images/process.ipc.png" alt="&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;"></div></div></div><br class="figure-break"><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2867812"></a>4.1.&#xA0;&#x7BA1;&#x9053;</h3></div></div></div><p>&#x7BA1;&#x9053;&#x662F;&#x4E00;&#x79CD;&#x6700;&#x57FA;&#x672C;&#x7684;IPC&#x673A;&#x5236;&#xFF0C;&#x7531;<code class="literal">pipe</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#xFF1A;</p><pre class="programlisting">#include &lt;unistd.h&gt;

int pipe(int filedes[2]);</pre><p>&#x8C03;&#x7528;<code class="literal">pipe</code>&#x51FD;&#x6570;&#x65F6;&#x5728;&#x5185;&#x6838;&#x4E2D;&#x5F00;&#x8F9F;&#x4E00;&#x5757;&#x7F13;&#x51B2;&#x533A;&#xFF08;&#x79F0;&#x4E3A;&#x7BA1;&#x9053;&#xFF09;&#x7528;&#x4E8E;&#x901A;&#x4FE1;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x8BFB;&#x7AEF;&#x4E00;&#x4E2A;&#x5199;&#x7AEF;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;<code class="literal">filedes</code>&#x53C2;&#x6570;&#x4F20;&#x51FA;&#x7ED9;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;<code class="literal">filedes[0]</code>&#x6307;&#x5411;&#x7BA1;&#x9053;&#x7684;&#x8BFB;&#x7AEF;&#xFF0C;<code class="literal">filedes[1]</code>&#x6307;&#x5411;&#x7BA1;&#x9053;&#x7684;&#x5199;&#x7AEF;&#xFF08;&#x5F88;&#x597D;&#x8BB0;&#xFF0C;&#x5C31;&#x50CF;0&#x662F;&#x6807;&#x51C6;&#x8F93;&#x5165;1&#x662F;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x4E00;&#x6837;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x7BA1;&#x9053;&#x5728;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x901A;&#x8FC7;<code class="literal">read(filedes[0]);</code>&#x6216;&#x8005;<code class="literal">write(filedes[1]);</code>&#x5411;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x8BFB;&#x5199;&#x6570;&#x636E;&#x5176;&#x5B9E;&#x662F;&#x5728;&#x8BFB;&#x5199;&#x5185;&#x6838;&#x7F13;&#x51B2;&#x533A;&#x3002;<code class="literal">pipe</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6210;&#x529F;&#x8FD4;&#x56DE;0&#xFF0C;&#x8C03;&#x7528;&#x5931;&#x8D25;&#x8FD4;&#x56DE;-1&#x3002;</p><p>&#x5F00;&#x8F9F;&#x4E86;&#x7BA1;&#x9053;&#x4E4B;&#x540E;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x5462;&#xFF1F;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x6309;&#x4E0B;&#x9762;&#x7684;&#x6B65;&#x9AA4;&#x901A;&#x4FE1;&#x3002;</p><div class="figure"><a id="id2867888"></a><p class="title"><b>&#x56FE;&#xA0;30.7.&#xA0;&#x7BA1;&#x9053;</b></p><div class="figure-contents"><div><img src="images/process.pipe.png" alt="&#x7BA1;&#x9053;"></div></div></div><br class="figure-break"><div class="orderedlist"><ol type="1"><li><p>&#x7236;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;<code class="literal">pipe</code>&#x5F00;&#x8F9F;&#x7BA1;&#x9053;&#xFF0C;&#x5F97;&#x5230;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6307;&#x5411;&#x7BA1;&#x9053;&#x7684;&#x4E24;&#x7AEF;&#x3002;</p></li><li><p>&#x7236;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;<code class="literal">fork</code>&#x521B;&#x5EFA;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x5B50;&#x8FDB;&#x7A0B;&#x4E5F;&#x6709;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6307;&#x5411;&#x540C;&#x4E00;&#x7BA1;&#x9053;&#x3002;</p></li><li><p>&#x7236;&#x8FDB;&#x7A0B;&#x5173;&#x95ED;&#x7BA1;&#x9053;&#x8BFB;&#x7AEF;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x5173;&#x95ED;&#x7BA1;&#x9053;&#x5199;&#x7AEF;&#x3002;&#x7236;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x5F80;&#x7BA1;&#x9053;&#x91CC;&#x5199;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x4ECE;&#x7BA1;&#x9053;&#x91CC;&#x8BFB;&#xFF0C;&#x7BA1;&#x9053;&#x662F;&#x7528;&#x73AF;&#x5F62;&#x961F;&#x5217;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6570;&#x636E;&#x4ECE;&#x5199;&#x7AEF;&#x6D41;&#x5165;&#x4ECE;&#x8BFB;&#x7AEF;&#x6D41;&#x51FA;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x3002;</p></li></ol></div><div class="example"><a id="id2867940"></a><p class="title"><b>&#x4F8B;&#xA0;30.7.&#xA0;&#x7BA1;&#x9053;</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdlib.h&gt;
#include &lt;unistd.h&gt;
#define MAXLINE 80

int main(void)
{
	int n;
	int fd[2];
	pid_t pid;
	char line[MAXLINE];

	if (pipe(fd) &lt; 0) {
		perror(&quot;pipe&quot;);
		exit(1);
	}
	if ((pid = fork()) &lt; 0) {
		perror(&quot;fork&quot;);
		exit(1);
	}
	if (pid &gt; 0) { /* parent */
		close(fd[0]);
		write(fd[1], &quot;hello world\n&quot;, 12);
		wait(NULL);
	} else {       /* child */
		close(fd[1]);
		n = read(fd[0], line, MAXLINE);
		write(STDOUT_FILENO, line, n);
	}
	return 0;
}</pre></div></div><br class="example-break"><p>&#x4F7F;&#x7528;&#x7BA1;&#x9053;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7BA1;&#x9053;&#x53EA;&#x80FD;&#x5B9E;&#x73B0;&#x5355;&#x5411;&#x901A;&#x4FE1;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7236;&#x8FDB;&#x7A0B;&#x5199;&#x5B50;&#x8FDB;&#x7A0B;&#x8BFB;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x9700;&#x8981;&#x5B50;&#x8FDB;&#x7A0B;&#x5199;&#x7236;&#x8FDB;&#x7A0B;&#x8BFB;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x53E6;&#x5F00;&#x4E00;&#x4E2A;&#x7BA1;&#x9053;&#x3002;&#x8BF7;&#x8BFB;&#x8005;&#x601D;&#x8003;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x5F00;&#x4E00;&#x4E2A;&#x7BA1;&#x9053;&#xFF0C;&#x4F46;&#x662F;&#x7236;&#x8FDB;&#x7A0B;&#x4E0D;&#x5173;&#x95ED;&#x8BFB;&#x7AEF;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x4E5F;&#x4E0D;&#x5173;&#x95ED;&#x5199;&#x7AEF;&#xFF0C;&#x53CC;&#x65B9;&#x90FD;&#x6709;&#x8BFB;&#x7AEF;&#x548C;&#x5199;&#x7AEF;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x5B9E;&#x73B0;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#xFF1F;</p></li><li><p>&#x7BA1;&#x9053;&#x7684;&#x8BFB;&#x5199;&#x7AEF;&#x901A;&#x8FC7;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6765;&#x4F20;&#x9012;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x901A;&#x4FE1;&#x7684;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x4ECE;&#x5B83;&#x4EEC;&#x7684;&#x516C;&#x5171;&#x7956;&#x5148;&#x90A3;&#x91CC;&#x7EE7;&#x627F;&#x7BA1;&#x9053;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x7236;&#x8FDB;&#x7A0B;&#x628A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4F20;&#x7ED9;&#x5B50;&#x8FDB;&#x7A0B;&#x4E4B;&#x540E;&#x7236;&#x5B50;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7236;&#x8FDB;&#x7A0B;<code class="literal">fork</code>&#x4E24;&#x6B21;&#xFF0C;&#x628A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4F20;&#x7ED9;&#x4E24;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x4E24;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#xFF0C;&#x603B;&#x4E4B;&#x9700;&#x8981;&#x901A;&#x8FC7;<code class="literal">fork</code>&#x4F20;&#x9012;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4F7F;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x80FD;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x7BA1;&#x9053;&#xFF0C;&#x5B83;&#x4EEC;&#x624D;&#x80FD;&#x901A;&#x4FE1;&#x3002;</p></li></ul></div><p>&#x4F7F;&#x7528;&#x7BA1;&#x9053;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;4&#x79CD;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF08;&#x5047;&#x8BBE;&#x90FD;&#x662F;&#x963B;&#x585E;I/O&#x64CD;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;<code class="literal">O_NONBLOCK</code>&#x6807;&#x5FD7;&#xFF09;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x5982;&#x679C;&#x6240;&#x6709;&#x6307;&#x5411;&#x7BA1;&#x9053;&#x5199;&#x7AEF;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x90FD;&#x5173;&#x95ED;&#x4E86;&#xFF08;&#x7BA1;&#x9053;&#x5199;&#x7AEF;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7B49;&#x4E8E;0&#xFF09;&#xFF0C;&#x800C;&#x4ECD;&#x7136;&#x6709;&#x8FDB;&#x7A0B;&#x4ECE;&#x7BA1;&#x9053;&#x7684;&#x8BFB;&#x7AEF;&#x8BFB;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x7BA1;&#x9053;&#x4E2D;&#x5269;&#x4F59;&#x7684;&#x6570;&#x636E;&#x90FD;&#x88AB;&#x8BFB;&#x53D6;&#x540E;&#xFF0C;&#x518D;&#x6B21;<code class="literal">read</code>&#x4F1A;&#x8FD4;&#x56DE;0&#xFF0C;&#x5C31;&#x50CF;&#x8BFB;&#x5230;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x4E00;&#x6837;&#x3002;</p></li><li><p>&#x5982;&#x679C;&#x6709;&#x6307;&#x5411;&#x7BA1;&#x9053;&#x5199;&#x7AEF;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6CA1;&#x5173;&#x95ED;&#xFF08;&#x7BA1;&#x9053;&#x5199;&#x7AEF;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5927;&#x4E8E;0&#xFF09;&#xFF0C;&#x800C;&#x6301;&#x6709;&#x7BA1;&#x9053;&#x5199;&#x7AEF;&#x7684;&#x8FDB;&#x7A0B;&#x4E5F;&#x6CA1;&#x6709;&#x5411;&#x7BA1;&#x9053;&#x4E2D;&#x5199;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x65F6;&#x6709;&#x8FDB;&#x7A0B;&#x4ECE;&#x7BA1;&#x9053;&#x8BFB;&#x7AEF;&#x8BFB;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x7BA1;&#x9053;&#x4E2D;&#x5269;&#x4F59;&#x7684;&#x6570;&#x636E;&#x90FD;&#x88AB;&#x8BFB;&#x53D6;&#x540E;&#xFF0C;&#x518D;&#x6B21;<code class="literal">read</code>&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x7BA1;&#x9053;&#x4E2D;&#x6709;&#x6570;&#x636E;&#x53EF;&#x8BFB;&#x4E86;&#x624D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E76;&#x8FD4;&#x56DE;&#x3002;</p></li><li><p>&#x5982;&#x679C;&#x6240;&#x6709;&#x6307;&#x5411;&#x7BA1;&#x9053;&#x8BFB;&#x7AEF;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x90FD;&#x5173;&#x95ED;&#x4E86;&#xFF08;&#x7BA1;&#x9053;&#x8BFB;&#x7AEF;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7B49;&#x4E8E;0&#xFF09;&#xFF0C;&#x8FD9;&#x65F6;&#x6709;&#x8FDB;&#x7A0B;&#x5411;&#x7BA1;&#x9053;&#x7684;&#x5199;&#x7AEF;<code class="literal">write</code>&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8FDB;&#x7A0B;&#x4F1A;&#x6536;&#x5230;&#x4FE1;&#x53F7;<code class="literal">SIGPIPE</code>&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x8FDB;&#x7A0B;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#x3002;&#x5728;<a class="xref" href="ch33.html#signal">&#x7B2C;&#xA0;33&#xA0;&#x7AE0; <i>&#x4FE1;&#x53F7;</i></a>&#x4F1A;&#x8BB2;&#x5230;&#x600E;&#x6837;&#x4F7F;<code class="literal">SIGPIPE</code>&#x4FE1;&#x53F7;&#x4E0D;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x3002;</p></li><li><p>&#x5982;&#x679C;&#x6709;&#x6307;&#x5411;&#x7BA1;&#x9053;&#x8BFB;&#x7AEF;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6CA1;&#x5173;&#x95ED;&#xFF08;&#x7BA1;&#x9053;&#x8BFB;&#x7AEF;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5927;&#x4E8E;0&#xFF09;&#xFF0C;&#x800C;&#x6301;&#x6709;&#x7BA1;&#x9053;&#x8BFB;&#x7AEF;&#x7684;&#x8FDB;&#x7A0B;&#x4E5F;&#x6CA1;&#x6709;&#x4ECE;&#x7BA1;&#x9053;&#x4E2D;&#x8BFB;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x65F6;&#x6709;&#x8FDB;&#x7A0B;&#x5411;&#x7BA1;&#x9053;&#x5199;&#x7AEF;&#x5199;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x7BA1;&#x9053;&#x88AB;&#x5199;&#x6EE1;&#x65F6;&#x518D;&#x6B21;<code class="literal">write</code>&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x7BA1;&#x9053;&#x4E2D;&#x6709;&#x7A7A;&#x4F4D;&#x7F6E;&#x4E86;&#x624D;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E76;&#x8FD4;&#x56DE;&#x3002;</p></li></ol></div><p>&#x7BA1;&#x9053;&#x7684;&#x8FD9;&#x56DB;&#x79CD;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x5177;&#x6709;&#x666E;&#x904D;&#x610F;&#x4E49;&#x3002;&#x5728;<a class="xref" href="ch37.html#socket">&#x7B2C;&#xA0;37&#xA0;&#x7AE0; <i>socket&#x7F16;&#x7A0B;</i></a>&#x8981;&#x8BB2;&#x7684;TCP socket&#x4E5F;&#x5177;&#x6709;&#x7BA1;&#x9053;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a id="id2868118"></a>&#x4E60;&#x9898;</h4></div></div></div><p>1&#x3001;&#x5728;<a class="xref" href="ch30s04.html#process.pipe">&#x4F8B;&#xA0;30.7 &#x201C;&#x7BA1;&#x9053;&#x201D;</a>&#x4E2D;&#xFF0C;&#x7236;&#x8FDB;&#x7A0B;&#x53EA;&#x7528;&#x5230;&#x5199;&#x7AEF;&#xFF0C;&#x56E0;&#x800C;&#x628A;&#x8BFB;&#x7AEF;&#x5173;&#x95ED;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x53EA;&#x7528;&#x5230;&#x8BFB;&#x7AEF;&#xFF0C;&#x56E0;&#x800C;&#x628A;&#x5199;&#x7AEF;&#x5173;&#x95ED;&#xFF0C;&#x7136;&#x540E;&#x4E92;&#x76F8;&#x901A;&#x4FE1;&#xFF0C;&#x4E0D;&#x4F7F;&#x7528;&#x7684;&#x8BFB;&#x7AEF;&#x6216;&#x5199;&#x7AEF;&#x5FC5;&#x987B;&#x5173;&#x95ED;&#xFF0C;&#x8BF7;&#x8BFB;&#x8005;&#x60F3;&#x4E00;&#x60F3;&#x5982;&#x679C;&#x4E0D;&#x5173;&#x95ED;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;</p><p>2&#x3001;&#x8BF7;&#x8BFB;&#x8005;&#x4FEE;&#x6539;<a class="xref" href="ch30s04.html#process.pipe">&#x4F8B;&#xA0;30.7 &#x201C;&#x7BA1;&#x9053;&#x201D;</a>&#x7684;&#x4EE3;&#x7801;&#x548C;&#x5B9E;&#x9A8C;&#x6761;&#x4EF6;&#xFF0C;&#x9A8C;&#x8BC1;&#x6211;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x56DB;&#x79CD;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;</p></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2868153"></a>4.2.&#xA0;&#x5176;&#x5B83;IPC&#x673A;&#x5236;</h3></div></div></div><p>&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x800C;&#x4E14;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#x5728;&#x8FDB;&#x7A0B;&#x4E2D;&#x6807;&#x8BC6;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#x7684;&#x67D0;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x4E0A;&#x4E00;&#x8282;&#x8BB2;&#x7684;&#x7BA1;&#x9053;&#x662F;&#x7528;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6765;&#x6807;&#x8BC6;&#x7684;&#x3002;&#x5982;&#x679C;&#x8981;&#x4E92;&#x76F8;&#x901A;&#x4FE1;&#x7684;&#x51E0;&#x4E2A;&#x8FDB;&#x7A0B;&#x6CA1;&#x6709;&#x4ECE;&#x516C;&#x5171;&#x7956;&#x5148;&#x90A3;&#x91CC;&#x7EE7;&#x627F;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x5B83;&#x4EEC;&#x600E;&#x4E48;&#x901A;&#x4FE1;&#x5462;&#xFF1F;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#x4E00;&#x6761;&#x901A;&#x9053;&#x4E0D;&#x6210;&#x95EE;&#x9898;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x6807;&#x8BC6;&#x8FD9;&#x6761;&#x901A;&#x9053;&#x624D;&#x80FD;&#x4F7F;&#x5404;&#x8FDB;&#x7A0B;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5B83;&#xFF1F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8DEF;&#x5F84;&#x540D;&#x662F;&#x5168;&#x5C40;&#x7684;&#xFF0C;&#x5404;&#x8FDB;&#x7A0B;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x7528;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8DEF;&#x5F84;&#x540D;&#x6765;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;IPC&#x901A;&#x9053;&#x3002;</p><p>FIFO&#x548C;UNIX Domain Socket&#x8FD9;&#x4E24;&#x79CD;IPC&#x673A;&#x5236;&#x90FD;&#x662F;&#x5229;&#x7528;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x7279;&#x6B8A;&#x6587;&#x4EF6;&#x6765;&#x6807;&#x8BC6;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x7528;<code class="literal">mkfifo</code>&#x547D;&#x4EE4;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;FIFO&#x6587;&#x4EF6;&#xFF1A;</p><pre class="screen">$ mkfifo hello
$ ls -l hello
prw-r--r-- 1 akaedu akaedu 0 2008-10-30 10:44 hello</pre><p>FIFO&#x6587;&#x4EF6;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x4EC5;&#x7528;&#x6765;&#x6807;&#x8BC6;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x4E00;&#x6761;&#x901A;&#x9053;&#xFF0C;&#x5404;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x8FDB;&#x884C;<code class="literal">read</code>/<code class="literal">write</code>&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x8BFB;&#x5199;&#x5185;&#x6838;&#x901A;&#x9053;&#xFF08;&#x6839;&#x672C;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#x8FD9;&#x4E2A;<code class="literal">file</code>&#x7ED3;&#x6784;&#x4F53;&#x6240;&#x6307;&#x5411;&#x7684;<code class="literal">read</code>&#x3001;<code class="literal">write</code>&#x51FD;&#x6570;&#x548C;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x4E0D;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x3002;UNIX Domain Socket&#x548C;FIFO&#x7684;&#x539F;&#x7406;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;socket&#x6587;&#x4EF6;&#x6765;&#x6807;&#x8BC6;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">/var/run</code>&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x7684;socket&#x6587;&#x4EF6;&#xFF1A;</p><pre class="screen">$ ls -l /var/run/
total 52
srw-rw-rw- 1 root        root           0 2008-10-30 00:24 acpid.socket
...
srw-rw-rw- 1 root        root           0 2008-10-30 00:25 gdm_socket
...
srw-rw-rw- 1 root        root           0 2008-10-30 00:24 sdp
...
srwxr-xr-x 1 root        root           0 2008-10-30 00:42 synaptic.socket</pre><p>&#x6587;&#x4EF6;&#x7C7B;&#x578B;s&#x8868;&#x793A;socket&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x4E5F;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5757;&#x3002;UNIX Domain Socket&#x662F;&#x76EE;&#x524D;&#x6700;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;IPC&#x673A;&#x5236;&#xFF0C;&#x5230;&#x540E;&#x9762;&#x8BB2;socket&#x7F16;&#x7A0B;&#x65F6;&#x518D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;</p><p>&#x73B0;&#x5728;&#x628A;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x4FE1;&#x606F;&#x7684;&#x5404;&#x79CD;&#x9014;&#x5F84;&#xFF08;&#x5305;&#x62EC;&#x5404;&#x79CD;IPC&#x673A;&#x5236;&#xFF09;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x7236;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;<code class="literal">fork</code>&#x53EF;&#x4EE5;&#x5C06;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x63CF;&#x8FF0;&#x7B26;&#x4F20;&#x9012;&#x7ED9;&#x5B50;&#x8FDB;&#x7A0B;</p></li><li><p>&#x5B50;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x7236;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;<code class="literal">wait</code>&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x7EC8;&#x6B62;&#x4FE1;&#x606F;</p></li><li><p>&#x51E0;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x8BFB;&#x5199;&#x67D0;&#x4E2A;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED9;&#x6587;&#x4EF6;&#x52A0;&#x9501;&#x6765;&#x5B9E;&#x73B0;&#x8FDB;&#x7A0B;&#x95F4;&#x540C;&#x6B65;</p></li><li><p>&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x4E92;&#x53D1;&#x4FE1;&#x53F7;&#xFF0C;&#x4E00;&#x822C;&#x4F7F;&#x7528;<code class="literal">SIGUSR1</code>&#x548C;<code class="literal">SIGUSR2</code>&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x529F;&#x80FD;</p></li><li><p>&#x7BA1;&#x9053;</p></li><li><p>FIFO</p></li><li><p>mmap&#x51FD;&#x6570;&#xFF0C;&#x51E0;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x540C;&#x4E00;&#x5185;&#x5B58;&#x533A;</p></li><li><p>SYS V IPC&#xFF0C;&#x4EE5;&#x524D;&#x7684;SYS V UNIX&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7684;IPC&#x673A;&#x5236;&#xFF0C;&#x5305;&#x62EC;&#x6D88;&#x606F;&#x961F;&#x5217;&#x3001;&#x4FE1;&#x53F7;&#x91CF;&#x548C;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x57FA;&#x672C;&#x5E9F;&#x5F03;</p></li><li><p>UNIX Domain Socket&#xFF0C;&#x76EE;&#x524D;&#x6700;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;IPC&#x673A;&#x5236;</p></li></ul></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch30s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch30.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch30s05.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;5.&#xA0;&#x7EC3;&#x4E60;&#xFF1A;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x7684;Shell</td></tr></tbody></table></div>
</body></html>