<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x7EBF;&#x7A0B;&#x7684;&#x6982;&#x5FF5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch35.html" title="&#x7B2C;&#xA0;35&#xA0;&#x7AE0;&#xA0;&#x7EBF;&#x7A0B;"><link rel="prev" href="ch35.html" title="&#x7B2C;&#xA0;35&#xA0;&#x7AE0;&#xA0;&#x7EBF;&#x7A0B;"><link rel="next" href="ch35s02.html" title="2.&#xA0;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x7EBF;&#x7A0B;&#x7684;&#x6982;&#x5FF5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch35.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;35&#xA0;&#x7AE0;&#xA0;&#x7EBF;&#x7A0B;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch35s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2895482"></a>1.&#xA0;&#x7EBF;&#x7A0B;&#x7684;&#x6982;&#x5FF5;</h2></div></div></div><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x8FDB;&#x7A0B;&#x5728;&#x5404;&#x81EA;&#x72EC;&#x7ACB;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x9700;&#x8981;&#x7528;<code class="literal">mmap</code>&#x6216;&#x8005;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x673A;&#x5236;&#xFF0C;&#x672C;&#x8282;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x7EBF;&#x7A0B;&#x5C31;&#x6D3E;&#x4E0A;&#x4E86;&#x7528;&#x573A;&#xFF0C;&#x6BD4;&#x5982;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x7684;&#x4E0B;&#x8F7D;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x9700;&#x8981;&#x548C;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#xFF0C;&#x7B49;&#x5F85;&#x548C;&#x5904;&#x7406;&#x7528;&#x6237;&#x7684;&#x9F20;&#x6807;&#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x53C8;&#x9700;&#x8981;&#x540C;&#x65F6;&#x4E0B;&#x8F7D;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x7B49;&#x5F85;&#x548C;&#x5904;&#x7406;&#x4ECE;&#x591A;&#x4E2A;&#x7F51;&#x7EDC;&#x4E3B;&#x673A;&#x53D1;&#x6765;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x201C;<span class="quote">&#x7B49;&#x5F85;-&#x5904;&#x7406;</span>&#x201D;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#xFF0C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E13;&#x95E8;&#x8D1F;&#x8D23;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#xFF0C;&#x53E6;&#x5916;&#x51E0;&#x4E2A;&#x7EBF;&#x7A0B;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x8D1F;&#x8D23;&#x548C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4E3B;&#x673A;&#x901A;&#x4FE1;&#x3002;</p><p>&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x8BB2;&#x8FC7;&#xFF0C;<code class="literal">main</code>&#x51FD;&#x6570;&#x548C;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x51FD;&#x6570;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x662F;&#x6BD4;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x51FD;&#x6570;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#xFF0C;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x51FD;&#x6570;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x53EA;&#x662F;&#x5728;&#x4FE1;&#x53F7;&#x9012;&#x8FBE;&#x65F6;&#x4EA7;&#x751F;&#xFF0C;&#x5728;&#x5904;&#x7406;&#x5B8C;&#x4FE1;&#x53F7;&#x4E4B;&#x540E;&#x5C31;&#x7ED3;&#x675F;&#xFF0C;&#x800C;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x957F;&#x671F;&#x5E76;&#x5B58;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5728;&#x5404;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x8C03;&#x5EA6;&#x548C;&#x5207;&#x6362;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x8C03;&#x5EA6;&#x548C;&#x5207;&#x6362;&#x4E00;&#x6837;&#x3002;&#x7531;&#x4E8E;&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x7684;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;Text Segment&#x3001;Data Segment&#x90FD;&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x5404;&#x7EBF;&#x7A0B;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x5404;&#x7EBF;&#x7A0B;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5404;&#x7EBF;&#x7A0B;&#x8FD8;&#x5171;&#x4EAB;&#x4EE5;&#x4E0B;&#x8FDB;&#x7A0B;&#x8D44;&#x6E90;&#x548C;&#x73AF;&#x5883;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x8868;</p></li><li><p>&#x6BCF;&#x79CD;&#x4FE1;&#x53F7;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF08;<code class="literal">SIG_IGN</code>&#x3001;<code class="literal">SIG_DFL</code>&#x6216;&#x8005;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x51FD;&#x6570;&#xFF09;</p></li><li><p>&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;</p></li><li><p>&#x7528;&#x6237;id&#x548C;&#x7EC4;id</p></li></ul></div><p>&#x4F46;&#x6709;&#x4E9B;&#x8D44;&#x6E90;&#x662F;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5404;&#x6709;&#x4E00;&#x4EFD;&#x7684;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x7EBF;&#x7A0B;id</p></li><li><p>&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5305;&#x62EC;&#x5404;&#x79CD;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x3001;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x548C;&#x6808;&#x6307;&#x9488;</p></li><li><p>&#x6808;&#x7A7A;&#x95F4;</p></li><li><p><code class="literal">errno</code>&#x53D8;&#x91CF;</p></li><li><p>&#x4FE1;&#x53F7;&#x5C4F;&#x853D;&#x5B57;</p></li><li><p>&#x8C03;&#x5EA6;&#x4F18;&#x5148;&#x7EA7;</p></li></ul></div><p>&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x7EBF;&#x7A0B;&#x5E93;&#x51FD;&#x6570;&#x662F;&#x7531;POSIX&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x79F0;&#x4E3A;POSIX thread&#x6216;&#x8005;pthread&#x3002;&#x5728;Linux&#x4E0A;&#x7EBF;&#x7A0B;&#x51FD;&#x6570;&#x4F4D;&#x4E8E;<code class="literal">libpthread</code>&#x5171;&#x4EAB;&#x5E93;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x8981;&#x52A0;&#x4E0A;<code class="literal">-lpthread</code>&#x9009;&#x9879;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch35.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch35.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch35s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;35&#xA0;&#x7AE0;&#xA0;&#x7EBF;&#x7A0B;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;</td></tr></tbody></table></div>
</body></html>