<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch35.html" title="&#x7B2C;&#xA0;35&#xA0;&#x7AE0;&#xA0;&#x7EBF;&#x7A0B;"><link rel="prev" href="ch35s02.html" title="2.&#xA0;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;"><link rel="next" href="ch35s04.html" title="4.&#xA0;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch35s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;35&#xA0;&#x7AE0;&#xA0;&#x7EBF;&#x7A0B;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch35s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2896458"></a>3.&#xA0;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;</h2></div></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2896462"></a>3.1.&#xA0;mutex</h3></div></div></div><p>&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x51B2;&#x7A81;&#xFF0C;&#x8FD9;&#x8DDF;&#x524D;&#x9762;&#x8BB2;&#x4FE1;&#x53F7;&#x65F6;&#x6240;&#x8BF4;&#x7684;&#x53EF;&#x91CD;&#x5165;&#x6027;&#x662F;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6BD4;&#x5982;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x8981;&#x628A;&#x67D0;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x589E;&#x52A0;1&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x5728;&#x67D0;&#x5E73;&#x53F0;&#x9700;&#x8981;&#x4E09;&#x6761;&#x6307;&#x4EE4;&#x5B8C;&#x6210;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x4ECE;&#x5185;&#x5B58;&#x8BFB;&#x53D8;&#x91CF;&#x503C;&#x5230;&#x5BC4;&#x5B58;&#x5668;</p></li><li><p>&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x52A0;1</p></li><li><p>&#x5C06;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x5199;&#x56DE;&#x5185;&#x5B58;</p></li></ol></div><p>&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x591A;&#x5904;&#x7406;&#x5668;&#x5E73;&#x53F0;&#x4E0A;&#x540C;&#x65F6;&#x6267;&#x884C;&#x8FD9;&#x4E09;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x540E;&#x53D8;&#x91CF;&#x53EA;&#x52A0;&#x4E86;&#x4E00;&#x6B21;&#x800C;&#x975E;&#x4E24;&#x6B21;&#x3002;</p><div class="figure"><a id="id2896510"></a><p class="title"><b>&#x56FE;&#xA0;35.1.&#xA0;&#x5E76;&#x884C;&#x8BBF;&#x95EE;&#x51B2;&#x7A81;</b></p><div class="figure-contents"><div><img src="images/thread.corrupt.png" alt="&#x5E76;&#x884C;&#x8BBF;&#x95EE;&#x51B2;&#x7A81;"></div></div></div><br class="figure-break"><p>&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x5355;&#x5904;&#x7406;&#x5668;&#x5E73;&#x53F0;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x80FD;&#x591F;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x5417;&#xFF1F;</p><p>&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#x89C2;&#x5BDF;&#x8FD9;&#x4E00;&#x73B0;&#x8C61;&#x3002;&#x4E0A;&#x56FE;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x73B0;&#x8C61;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x5B58;&#x5728;&#x8FD9;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x65F6;&#x5F88;&#x96BE;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x73B0;&#x8C61;&#x66F4;&#x5BB9;&#x6613;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x4E0A;&#x8FF0;&#x4E09;&#x6761;&#x6307;&#x4EE4;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x7528;&#x66F4;&#x591A;&#x6761;&#x6307;&#x4EE4;&#x6765;&#x505A;&#xFF1A;</p><pre class="programlisting">		val = counter;
		printf(&quot;%x: %d\n&quot;, (unsigned int)pthread_self(), val + 1);
		counter = val + 1;</pre><p>&#x6211;&#x4EEC;&#x5728;&#x201C;<span class="quote">&#x8BFB;&#x53D6;&#x53D8;&#x91CF;&#x7684;&#x503C;</span>&#x201D;&#x548C;&#x201C;<span class="quote">&#x628A;&#x53D8;&#x91CF;&#x7684;&#x65B0;&#x503C;&#x4FDD;&#x5B58;&#x56DE;&#x53BB;</span>&#x201D;&#x8FD9;&#x4E24;&#x6B65;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x63D2;&#x5165;&#x4E00;&#x4E2A;<code class="literal">printf</code>&#x8C03;&#x7528;&#xFF0C;&#x5B83;&#x4F1A;&#x6267;&#x884C;<code class="literal">write</code>&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x8FDB;&#x5185;&#x6838;&#xFF0C;&#x4E3A;&#x5185;&#x6838;&#x8C03;&#x5EA6;&#x522B;&#x7684;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x65F6;&#x673A;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x4E2D;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x64CD;&#x4F5C;&#x51E0;&#x5343;&#x6B21;&#xFF0C;&#x5C31;&#x4F1A;&#x89C2;&#x5BDF;&#x5230;&#x8BBF;&#x95EE;&#x51B2;&#x7A81;&#x7684;&#x73B0;&#x8C61;&#x3002;</p><pre class="programlisting">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;pthread.h&gt;

#define NLOOP 5000

int counter;                /* incremented by threads */

void *doit(void *);

int main(int argc, char **argv)
{
	pthread_t tidA, tidB;

	pthread_create(&amp;tidA, NULL, &amp;doit, NULL);
	pthread_create(&amp;tidB, NULL, &amp;doit, NULL);

        /* wait for both threads to terminate */
	pthread_join(tidA, NULL);
	pthread_join(tidB, NULL);

	return 0;
}

void *doit(void *vptr)
{
	int    i, val;

	/*
	 * Each thread fetches, prints, and increments the counter NLOOP times.
	 * The value of the counter should increase monotonically.
	 */

	for (i = 0; i &lt; NLOOP; i++) {
		val = counter;
		printf(&quot;%x: %d\n&quot;, (unsigned int)pthread_self(), val + 1);
		counter = val + 1;
	}

	return NULL;
}</pre><p>&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5404;&#x81EA;&#x628A;<code class="literal">counter</code>&#x589E;&#x52A0;5000&#x6B21;&#xFF0C;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x6700;&#x540E;<code class="literal">counter</code>&#x5E94;&#x8BE5;&#x7B49;&#x4E8E;10000&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x8BE5;&#x7A0B;&#x5E8F;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6570;&#x5230;5000&#x591A;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6570;&#x5230;6000&#x591A;&#x3002;</p><pre class="screen">$ ./a.out
b76acb90: 1
b76acb90: 2
b76acb90: 3
b76acb90: 4
b76acb90: 5
b7eadb90: 1
b7eadb90: 2
b7eadb90: 3
b7eadb90: 4
b7eadb90: 5
b76acb90: 6
b76acb90: 7
b7eadb90: 6
b76acb90: 8
...</pre><p>&#x5BF9;&#x4E8E;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BBF;&#x95EE;&#x51B2;&#x7A81;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5F88;&#x666E;&#x904D;&#x7684;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x5F15;&#x5165;&#x4E92;&#x65A5;&#x9501;&#xFF08;Mutex&#xFF0C;Mutual Exclusive Lock&#xFF09;<a id="id2896624" class="indexterm"></a>&#xFF0C;&#x83B7;&#x5F97;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x201C;<span class="quote">&#x8BFB;-&#x4FEE;&#x6539;-&#x5199;</span>&#x201D;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x91CA;&#x653E;&#x9501;&#x7ED9;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#xFF0C;&#x6CA1;&#x6709;&#x83B7;&#x5F97;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x53EA;&#x80FD;&#x7B49;&#x5F85;&#x800C;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x201C;<span class="quote">&#x8BFB;-&#x4FEE;&#x6539;-&#x5199;</span>&#x201D;&#x4E09;&#x6B65;&#x64CD;&#x4F5C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x90FD;&#x6267;&#x884C;&#xFF0C;&#x8981;&#x4E48;&#x90FD;&#x4E0D;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x5230;&#x4E2D;&#x95F4;&#x88AB;&#x6253;&#x65AD;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5728;&#x5176;&#x5B83;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x5E76;&#x884C;&#x505A;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x3002;</p><p>Mutex&#x7528;<code class="literal">pthread_mutex_t</code>&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x8868;&#x793A;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x521D;&#x59CB;&#x5316;&#x548C;&#x9500;&#x6BC1;&#xFF1A;</p><pre class="programlisting">#include &lt;pthread.h&gt;

int pthread_mutex_destroy(pthread_mutex_t *mutex);
int pthread_mutex_init(pthread_mutex_t *restrict mutex,
       const pthread_mutexattr_t *restrict attr);
pthread_mutex_t mutex = PTHREAD_MUTEX_INITIALIZER;</pre><p>&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x6210;&#x529F;&#x8FD4;&#x56DE;0&#xFF0C;&#x5931;&#x8D25;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x53F7;&#x3002;</p><p><code class="literal">pthread_mutex_init</code>&#x51FD;&#x6570;&#x5BF9;Mutex&#x505A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x53C2;&#x6570;<code class="literal">attr</code>&#x8BBE;&#x5B9A;Mutex&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5982;&#x679C;<code class="literal">attr</code>&#x4E3A;<code class="literal">NULL</code>&#x5219;&#x8868;&#x793A;&#x7F3A;&#x7701;&#x5C5E;&#x6027;&#xFF0C;&#x672C;&#x7AE0;&#x4E0D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;Mutex&#x5C5E;&#x6027;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a class="xref" href="bi01.html#bibli.apue" title="Advanced Programming in the UNIX Environment">[<abbr class="abbrev">APUE2e</abbr>]</a>&#x3002;&#x7528;<code class="literal">pthread_mutex_init</code>&#x51FD;&#x6570;&#x521D;&#x59CB;&#x5316;&#x7684;Mutex&#x53EF;&#x4EE5;&#x7528;<code class="literal">pthread_mutex_destroy</code>&#x9500;&#x6BC1;&#x3002;&#x5982;&#x679C;Mutex&#x53D8;&#x91CF;&#x662F;&#x9759;&#x6001;&#x5206;&#x914D;&#x7684;&#xFF08;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6216;<code class="literal">static</code>&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5B8F;&#x5B9A;&#x4E49;<code class="literal">PTHREAD_MUTEX_INITIALIZER</code>&#x6765;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x7528;<code class="literal">pthread_mutex_init</code>&#x521D;&#x59CB;&#x5316;&#x5E76;&#x4E14;<code class="literal">attr</code>&#x53C2;&#x6570;&#x4E3A;<code class="literal">NULL</code>&#x3002;Mutex&#x7684;&#x52A0;&#x9501;&#x548C;&#x89E3;&#x9501;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x5217;&#x51FD;&#x6570;&#xFF1A;</p><pre class="programlisting">#include &lt;pthread.h&gt;

int pthread_mutex_lock(pthread_mutex_t *mutex);
int pthread_mutex_trylock(pthread_mutex_t *mutex);
int pthread_mutex_unlock(pthread_mutex_t *mutex);</pre><p>&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x6210;&#x529F;&#x8FD4;&#x56DE;0&#xFF0C;&#x5931;&#x8D25;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x53F7;&#x3002;</p><p>&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8C03;&#x7528;pthread_mutex_lock&#x83B7;&#x5F97;Mutex&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x65F6;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x8C03;&#x7528;pthread_mutex_lock&#x83B7;&#x5F97;&#x4E86;&#x8BE5;Mutex&#xFF0C;&#x5219;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;pthread_mutex_unlock&#x91CA;&#x653E;Mutex&#xFF0C;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x88AB;&#x5524;&#x9192;&#xFF0C;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x8BE5;Mutex&#x5E76;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</p><p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x65E2;&#x60F3;&#x83B7;&#x5F97;&#x9501;&#xFF0C;&#x53C8;&#x4E0D;&#x60F3;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x7528;pthread_mutex_trylock&#xFF0C;&#x5982;&#x679C;Mutex&#x5DF2;&#x7ECF;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F1A;&#x5931;&#x8D25;&#x8FD4;&#x56DE;EBUSY&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x4F7F;&#x7EBF;&#x7A0B;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x3002;</p><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7528;Mutex&#x89E3;&#x51B3;&#x5148;&#x524D;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p><pre class="programlisting">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;pthread.h&gt;


#define NLOOP 5000

int counter;                /* incremented by threads */
pthread_mutex_t counter_mutex = PTHREAD_MUTEX_INITIALIZER;

void *doit(void *);

int main(int argc, char **argv)
{
	pthread_t tidA, tidB;

	pthread_create(&amp;tidA, NULL, doit, NULL);
	pthread_create(&amp;tidB, NULL, doit, NULL);

        /* wait for both threads to terminate */
	pthread_join(tidA, NULL);
	pthread_join(tidB, NULL);

	return 0;
}

void *doit(void *vptr)
{
	int     i, val;

	/*
	 * Each thread fetches, prints, and increments the counter NLOOP times.
	 * The value of the counter should increase monotonically.
	 */

	for (i = 0; i &lt; NLOOP; i++) {
		pthread_mutex_lock(&amp;counter_mutex);

		val = counter;
		printf(&quot;%x: %d\n&quot;, (unsigned int)pthread_self(), val + 1);
		counter = val + 1;

		pthread_mutex_unlock(&amp;counter_mutex);
	}

	return NULL;
}</pre><p>&#x8FD9;&#x6837;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5C31;&#x6B63;&#x5E38;&#x4E86;&#xFF0C;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x90FD;&#x80FD;&#x6570;&#x5230;10000&#x3002;</p><p>&#x770B;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x8BFB;&#x8005;&#x4E00;&#x5B9A;&#x4F1A;&#x597D;&#x5947;&#xFF1A;Mutex&#x7684;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x64CD;&#x4F5C;lock&#x548C;unlock&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x5462;&#xFF1F;&#x5047;&#x8BBE;Mutex&#x53D8;&#x91CF;&#x7684;&#x503C;&#x4E3A;1&#x8868;&#x793A;&#x4E92;&#x65A5;&#x9501;&#x7A7A;&#x95F2;&#xFF0C;&#x8FD9;&#x65F6;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;lock&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x9501;&#xFF0C;&#x800C;Mutex&#x7684;&#x503C;&#x4E3A;0&#x8868;&#x793A;&#x4E92;&#x65A5;&#x9501;&#x5DF2;&#x7ECF;&#x88AB;&#x67D0;&#x4E2A;&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;&#xFF0C;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x518D;&#x8C03;&#x7528;lock&#x53EA;&#x80FD;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x3002;&#x90A3;&#x4E48;lock&#x548C;unlock&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="programlisting">lock:
	if(mutex &gt; 0){
		mutex = 0;
		return 0;
	} else
		&#x6302;&#x8D77;&#x7B49;&#x5F85;;
	goto lock;

unlock:
	mutex = 1;
	&#x5524;&#x9192;&#x7B49;&#x5F85;Mutex&#x7684;&#x7EBF;&#x7A0B;;
	return 0;</pre><p>unlock&#x64CD;&#x4F5C;&#x4E2D;&#x5524;&#x9192;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;&#x7684;&#x6B65;&#x9AA4;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x53EA;&#x5524;&#x9192;&#x4E00;&#x4E2A;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5524;&#x9192;&#x6240;&#x6709;&#x7B49;&#x5F85;&#x8BE5;Mutex&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x88AB;&#x5524;&#x9192;&#x7684;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x53BB;&#x7ADE;&#x4E89;&#x83B7;&#x5F97;&#x8FD9;&#x4E2A;Mutex&#xFF0C;&#x7ADE;&#x4E89;&#x5931;&#x8D25;&#x7684;&#x7EBF;&#x7A0B;&#x7EE7;&#x7EED;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x3002;</p><p>&#x7EC6;&#x5FC3;&#x7684;&#x8BFB;&#x8005;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x770B;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#xFF1A;&#x5BF9;Mutex&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x53D6;&#x3001;&#x5224;&#x65AD;&#x548C;&#x4FEE;&#x6539;&#x4E0D;&#x662F;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x8C03;&#x7528;lock&#xFF0C;&#x8FD9;&#x65F6;Mutex&#x662F;1&#xFF0C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x5224;&#x65AD;mutex&gt;0&#x6210;&#x7ACB;&#xFF0C;&#x7136;&#x540E;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7F6E;mutex=0&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x7F6E;mutex=0&#xFF0C;&#x4E8E;&#x662F;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x83B7;&#x5F97;&#x4E86;&#x9501;&#x3002;</p><p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x4E92;&#x65A5;&#x9501;&#x64CD;&#x4F5C;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;swap&#x6216;exchange&#x6307;&#x4EE4;&#xFF0C;&#x8BE5;&#x6307;&#x4EE4;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x628A;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x5185;&#x5B58;&#x5355;&#x5143;&#x7684;&#x6570;&#x636E;&#x76F8;&#x4EA4;&#x6362;&#xFF0C;&#x7531;&#x4E8E;&#x53EA;&#x6709;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x591A;&#x5904;&#x7406;&#x5668;&#x5E73;&#x53F0;&#xFF0C;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x603B;&#x7EBF;&#x5468;&#x671F;&#x4E5F;&#x6709;&#x5148;&#x540E;&#xFF0C;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x7684;&#x4EA4;&#x6362;&#x6307;&#x4EE4;&#x6267;&#x884C;&#x65F6;&#x53E6;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x7684;&#x4EA4;&#x6362;&#x6307;&#x4EE4;&#x53EA;&#x80FD;&#x7B49;&#x5F85;&#x603B;&#x7EBF;&#x5468;&#x671F;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x628A;lock&#x548C;unlock&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x6539;&#x4E00;&#x4E0B;&#xFF08;&#x4EE5;x86&#x7684;xchg&#x6307;&#x4EE4;&#x4E3A;&#x4F8B;&#xFF09;&#xFF1A;</p><pre class="programlisting">lock:
	movb $0, %al
	xchgb %al, mutex
	if(al&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5BB9; &gt; 0){
		return 0;
	} else
		&#x6302;&#x8D77;&#x7B49;&#x5F85;;
	goto lock;

unlock:
	movb $1, mutex
	&#x5524;&#x9192;&#x7B49;&#x5F85;Mutex&#x7684;&#x7EBF;&#x7A0B;;
	return 0;</pre><p>unlock&#x4E2D;&#x7684;&#x91CA;&#x653E;&#x9501;&#x64CD;&#x4F5C;&#x540C;&#x6837;&#x53EA;&#x7528;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x5B83;&#x7684;&#x539F;&#x5B50;&#x6027;&#x3002;</p><p>&#x4E5F;&#x8BB8;&#x8FD8;&#x6709;&#x8BFB;&#x8005;&#x597D;&#x5947;&#xFF0C;&#x201C;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x201D;&#x548C;&#x201C;&#x5524;&#x9192;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;&#x201D;&#x7684;&#x64CD;&#x4F5C;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#xFF1F;&#x6BCF;&#x4E2A;Mutex&#x6709;&#x4E00;&#x4E2A;&#x7B49;&#x5F85;&#x961F;&#x5217;&#xFF0C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8981;&#x5728;Mutex&#x4E0A;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#xFF0C;&#x9996;&#x5148;&#x5728;&#x628A;&#x81EA;&#x5DF1;&#x52A0;&#x5165;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7F6E;&#x7EBF;&#x7A0B;&#x72B6;&#x6001;&#x4E3A;&#x7761;&#x7720;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x8C03;&#x5EA6;&#x5668;&#x51FD;&#x6570;&#x5207;&#x6362;&#x5230;&#x522B;&#x7684;&#x7EBF;&#x7A0B;&#x3002;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8981;&#x5524;&#x9192;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#xFF0C;&#x53EA;&#x9700;&#x4ECE;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x51FA;&#x4E00;&#x9879;&#xFF0C;&#x628A;&#x5B83;&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x7761;&#x7720;&#x6539;&#x4E3A;&#x5C31;&#x7EEA;&#xFF0C;&#x52A0;&#x5165;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x6B21;&#x8C03;&#x5EA6;&#x5668;&#x51FD;&#x6570;&#x6267;&#x884C;&#x65F6;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5207;&#x6362;&#x5230;&#x88AB;&#x5524;&#x9192;&#x7684;&#x7EBF;&#x7A0B;&#x3002;</p><p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5148;&#x540E;&#x4E24;&#x6B21;&#x8C03;&#x7528;lock&#xFF0C;&#x5728;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x9501;&#x5DF2;&#x7ECF;&#x88AB;&#x5360;&#x7528;&#xFF0C;&#x8BE5;&#x7EBF;&#x7A0B;&#x4F1A;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x522B;&#x7684;&#x7EBF;&#x7A0B;&#x91CA;&#x653E;&#x9501;&#xFF0C;&#x7136;&#x800C;&#x9501;&#x6B63;&#x662F;&#x88AB;&#x81EA;&#x5DF1;&#x5360;&#x7528;&#x7740;&#x7684;&#xFF0C;&#x8BE5;&#x7EBF;&#x7A0B;&#x53C8;&#x88AB;&#x6302;&#x8D77;&#x800C;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x91CA;&#x653E;&#x9501;&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x6C38;&#x8FDC;&#x5904;&#x4E8E;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#x4E86;&#xFF0C;&#x8FD9;&#x53EB;&#x505A;&#x6B7B;&#x9501;&#xFF08;Deadlock&#xFF09;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x6B7B;&#x9501;&#x60C5;&#x5F62;&#x662F;&#x8FD9;&#x6837;&#xFF1A;&#x7EBF;&#x7A0B;A&#x83B7;&#x5F97;&#x4E86;&#x9501;1&#xFF0C;&#x7EBF;&#x7A0B;B&#x83B7;&#x5F97;&#x4E86;&#x9501;2&#xFF0C;&#x8FD9;&#x65F6;&#x7EBF;&#x7A0B;A&#x8C03;&#x7528;lock&#x8BD5;&#x56FE;&#x83B7;&#x5F97;&#x9501;2&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x9700;&#x8981;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;B&#x91CA;&#x653E;&#x9501;2&#xFF0C;&#x800C;&#x8FD9;&#x65F6;&#x7EBF;&#x7A0B;B&#x4E5F;&#x8C03;&#x7528;lock&#x8BD5;&#x56FE;&#x83B7;&#x5F97;&#x9501;1&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x9700;&#x8981;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;A&#x91CA;&#x653E;&#x9501;1&#xFF0C;&#x4E8E;&#x662F;&#x7EBF;&#x7A0B;A&#x548C;B&#x90FD;&#x6C38;&#x8FDC;&#x5904;&#x4E8E;&#x6302;&#x8D77;&#x72B6;&#x6001;&#x4E86;&#x3002;&#x4E0D;&#x96BE;&#x60F3;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x6D89;&#x53CA;&#x5230;&#x66F4;&#x591A;&#x7684;&#x7EBF;&#x7A0B;&#x548C;&#x66F4;&#x591A;&#x7684;&#x9501;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x53EF;&#x80FD;&#x6B7B;&#x9501;&#x7684;&#x95EE;&#x9898;&#x5C06;&#x4F1A;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x548C;&#x96BE;&#x4EE5;&#x5224;&#x65AD;&#x3002;</p><p>&#x5199;&#x7A0B;&#x5E8F;&#x65F6;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x540C;&#x65F6;&#x83B7;&#x5F97;&#x591A;&#x4E2A;&#x9501;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x6709;&#x5FC5;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5219;&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF1A;&#x5982;&#x679C;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5728;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x9501;&#x65F6;&#x90FD;&#x6309;&#x76F8;&#x540C;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF08;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x6309;Mutex&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#x987A;&#x5E8F;&#xFF09;&#x83B7;&#x5F97;&#x9501;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x7528;&#x5230;&#x9501;1&#x3001;&#x9501;2&#x3001;&#x9501;3&#xFF0C;&#x5B83;&#x4EEC;&#x6240;&#x5BF9;&#x5E94;&#x7684;Mutex&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#x662F;&#x9501;1&lt;&#x9501;2&lt;&#x9501;3&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5728;&#x9700;&#x8981;&#x540C;&#x65F6;&#x83B7;&#x5F97;2&#x4E2A;&#x6216;3&#x4E2A;&#x9501;&#x65F6;&#x90FD;&#x5E94;&#x8BE5;&#x6309;&#x9501;1&#x3001;&#x9501;2&#x3001;&#x9501;3&#x7684;&#x987A;&#x5E8F;&#x83B7;&#x5F97;&#x3002;&#x5982;&#x679C;&#x8981;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x9501;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;pthread_mutex_trylock&#x8C03;&#x7528;&#x4EE3;&#x66FF;pthread_mutex_lock&#x8C03;&#x7528;&#xFF0C;&#x4EE5;&#x514D;&#x6B7B;&#x9501;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2895424"></a>3.2.&#xA0;Condition Variable</h3></div></div></div><p>&#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x8FD8;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x7EBF;&#x7A0B;A&#x9700;&#x8981;&#x7B49;&#x67D0;&#x4E2A;&#x6761;&#x4EF6;&#x6210;&#x7ACB;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x6267;&#x884C;&#xFF0C;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x4E0D;&#x6210;&#x7ACB;&#xFF0C;&#x7EBF;&#x7A0B;A&#x5C31;&#x963B;&#x585E;&#x7B49;&#x5F85;&#xFF0C;&#x800C;&#x7EBF;&#x7A0B;B&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x6210;&#x7ACB;&#x4E86;&#xFF0C;&#x5C31;&#x5524;&#x9192;&#x7EBF;&#x7A0B;A&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x5728;pthread&#x5E93;&#x4E2D;&#x901A;&#x8FC7;&#x6761;&#x4EF6;&#x53D8;&#x91CF;&#xFF08;Condition Variable&#xFF09;<a id="id2895445" class="indexterm"></a>&#x6765;&#x963B;&#x585E;&#x7B49;&#x5F85;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x5524;&#x9192;&#x7B49;&#x5F85;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x7684;&#x7EBF;&#x7A0B;&#x3002;Condition Variable&#x7528;<code class="literal">pthread_cond_t</code>&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x8868;&#x793A;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x521D;&#x59CB;&#x5316;&#x548C;&#x9500;&#x6BC1;&#xFF1A;</p><pre class="programlisting">#include &lt;pthread.h&gt;

int pthread_cond_destroy(pthread_cond_t *cond);
int pthread_cond_init(pthread_cond_t *restrict cond,
       const pthread_condattr_t *restrict attr);
pthread_cond_t cond = PTHREAD_COND_INITIALIZER;</pre><p>&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x6210;&#x529F;&#x8FD4;&#x56DE;0&#xFF0C;&#x5931;&#x8D25;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x53F7;&#x3002;</p><p>&#x548C;Mutex&#x7684;&#x521D;&#x59CB;&#x5316;&#x548C;&#x9500;&#x6BC1;&#x7C7B;&#x4F3C;&#xFF0C;<code class="literal">pthread_cond_init</code>&#x51FD;&#x6570;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;Condition Variable&#xFF0C;<code class="literal">attr</code>&#x53C2;&#x6570;&#x4E3A;<code class="literal">NULL</code>&#x5219;&#x8868;&#x793A;&#x7F3A;&#x7701;&#x5C5E;&#x6027;&#xFF0C;<code class="literal">pthread_cond_destroy</code>&#x51FD;&#x6570;&#x9500;&#x6BC1;&#x4E00;&#x4E2A;Condition Variable&#x3002;&#x5982;&#x679C;Condition Variable&#x662F;&#x9759;&#x6001;&#x5206;&#x914D;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5B8F;&#x5B9A;&#x4E49;<code class="literal">PTHEAD_COND_INITIALIZER</code>&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x7528;<code class="literal">pthread_cond_init</code>&#x51FD;&#x6570;&#x521D;&#x59CB;&#x5316;&#x5E76;&#x4E14;<code class="literal">attr</code>&#x53C2;&#x6570;&#x4E3A;<code class="literal">NULL</code>&#x3002;Condition Variable&#x7684;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x5217;&#x51FD;&#x6570;&#xFF1A;</p><pre class="programlisting">#include &lt;pthread.h&gt;

int pthread_cond_timedwait(pthread_cond_t *restrict cond,
       pthread_mutex_t *restrict mutex,
       const struct timespec *restrict abstime);
int pthread_cond_wait(pthread_cond_t *restrict cond,
       pthread_mutex_t *restrict mutex);
int pthread_cond_broadcast(pthread_cond_t *cond);
int pthread_cond_signal(pthread_cond_t *cond);</pre><p>&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x6210;&#x529F;&#x8FD4;&#x56DE;0&#xFF0C;&#x5931;&#x8D25;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x53F7;&#x3002;</p><p>&#x53EF;&#x89C1;&#xFF0C;&#x4E00;&#x4E2A;Condition Variable&#x603B;&#x662F;&#x548C;&#x4E00;&#x4E2A;Mutex&#x642D;&#x914D;&#x4F7F;&#x7528;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code class="literal">pthread_cond_wait</code>&#x5728;&#x4E00;&#x4E2A;Condition Variable&#x4E0A;&#x963B;&#x585E;&#x7B49;&#x5F85;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x505A;&#x4EE5;&#x4E0B;&#x4E09;&#x6B65;&#x64CD;&#x4F5C;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x91CA;&#x653E;Mutex</p></li><li><p>&#x963B;&#x585E;&#x7B49;&#x5F85;</p></li><li><p>&#x5F53;&#x88AB;&#x5524;&#x9192;&#x65F6;&#xFF0C;&#x91CD;&#x65B0;&#x83B7;&#x5F97;Mutex&#x5E76;&#x8FD4;&#x56DE;</p></li></ol></div><p><code class="literal">pthread_cond_timedwait</code>&#x51FD;&#x6570;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x7B49;&#x5F85;&#x8D85;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x5230;&#x8FBE;&#x4E86;<code class="literal">abstime</code>&#x6240;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x523B;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x522B;&#x7684;&#x7EBF;&#x7A0B;&#x6765;&#x5524;&#x9192;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF0C;&#x5C31;&#x8FD4;&#x56DE;<code class="literal">ETIMEDOUT</code>&#x3002;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code class="literal">pthread_cond_signal</code>&#x5524;&#x9192;&#x5728;&#x67D0;&#x4E2A;Condition Variable&#x4E0A;&#x7B49;&#x5F85;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code class="literal">pthread_cond_broadcast</code>&#x5524;&#x9192;&#x5728;&#x8FD9;&#x4E2A;Condition Variable&#x4E0A;&#x7B49;&#x5F85;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x3002;</p><p>&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x6F14;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x751F;&#x4EA7;&#x8005;-&#x6D88;&#x8D39;&#x8005;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x751F;&#x4EA7;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x4E32;&#x5728;&#x94FE;&#x8868;&#x7684;&#x8868;&#x5934;&#x4E0A;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x4ECE;&#x8868;&#x5934;&#x53D6;&#x8D70;&#x7ED3;&#x6784;&#x4F53;&#x3002;</p><pre class="programlisting">#include &lt;stdlib.h&gt;
#include &lt;pthread.h&gt;
#include &lt;stdio.h&gt;

struct msg {
	struct msg *next;
	int num;
};

struct msg *head;
pthread_cond_t has_product = PTHREAD_COND_INITIALIZER;
pthread_mutex_t lock = PTHREAD_MUTEX_INITIALIZER;

void *consumer(void *p)
{
	struct msg *mp;

	for (;;) {
		pthread_mutex_lock(&amp;lock);
		while (head == NULL)
			pthread_cond_wait(&amp;has_product, &amp;lock);
		mp = head;
		head = mp-&gt;next;
		pthread_mutex_unlock(&amp;lock);
		printf(&quot;Consume %d\n&quot;, mp-&gt;num);
		free(mp);
		sleep(rand() % 5);
	}
}

void *producer(void *p)
{
	struct msg *mp;
	for (;;) {
		mp = malloc(sizeof(struct msg));
		mp-&gt;num = rand() % 1000 + 1;
		printf(&quot;Produce %d\n&quot;, mp-&gt;num);
		pthread_mutex_lock(&amp;lock);
		mp-&gt;next = head;
		head = mp;
		pthread_mutex_unlock(&amp;lock);
		pthread_cond_signal(&amp;has_product);
		sleep(rand() % 5);
	}
}

int main(int argc, char *argv[]) 
{
	pthread_t pid, cid;  

	srand(time(NULL));
	pthread_create(&amp;pid, NULL, producer, NULL);
	pthread_create(&amp;cid, NULL, consumer, NULL);
	pthread_join(pid, NULL);
	pthread_join(cid, NULL);
	return 0;
}</pre><p>&#x6267;&#x884C;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="screen">$ ./a.out 
Produce 744
Consume 744
Produce 567
Produce 881
Consume 881
Produce 911
Consume 911
Consume 567
Produce 698
Consume 698</pre><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a id="id2897298"></a>&#x4E60;&#x9898;</h4></div></div></div><p>1&#x3001;&#x5728;&#x672C;&#x8282;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x8BBF;&#x95EE;&#x94FE;&#x8868;&#x7684;&#x987A;&#x5E8F;&#x662F;LIFO&#x7684;&#xFF0C;&#x8BF7;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#xFF0C;&#x628A;&#x8BBF;&#x95EE;&#x987A;&#x5E8F;&#x6539;&#x6210;FIFO&#x3002;</p></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2897332"></a>3.3.&#xA0;Semaphore</h3></div></div></div><p>Mutex&#x53D8;&#x91CF;&#x662F;&#x975E;0&#x5373;1&#x7684;&#xFF0C;&#x53EF;&#x770B;&#x4F5C;&#x4E00;&#x79CD;&#x8D44;&#x6E90;&#x7684;&#x53EF;&#x7528;&#x6570;&#x91CF;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x65F6;Mutex&#x662F;1&#xFF0C;&#x8868;&#x793A;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#xFF0C;&#x52A0;&#x9501;&#x65F6;&#x83B7;&#x5F97;&#x8BE5;&#x8D44;&#x6E90;&#xFF0C;&#x5C06;Mutex&#x51CF;&#x5230;0&#xFF0C;&#x8868;&#x793A;&#x4E0D;&#x518D;&#x6709;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#xFF0C;&#x89E3;&#x9501;&#x65F6;&#x91CA;&#x653E;&#x8BE5;&#x8D44;&#x6E90;&#xFF0C;&#x5C06;Mutex&#x91CD;&#x65B0;&#x52A0;&#x5230;1&#xFF0C;&#x8868;&#x793A;&#x53C8;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x3002;</p><p>&#x4FE1;&#x53F7;&#x91CF;&#xFF08;Semaphore&#xFF09;<a id="id2897351" class="indexterm"></a>&#x548C;Mutex&#x7C7B;&#x4F3C;&#xFF0C;&#x8868;&#x793A;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x548C;Mutex&#x4E0D;&#x540C;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x6570;&#x91CF;&#x53EF;&#x4EE5;&#x5927;&#x4E8E;1&#x3002;</p><p>&#x672C;&#x8282;&#x4ECB;&#x7ECD;&#x7684;&#x662F;POSIX semaphore&#x5E93;&#x51FD;&#x6570;&#xFF0C;&#x8BE6;&#x89C1;sem_overview(7)&#xFF0C;&#x8FD9;&#x79CD;&#x4FE1;&#x53F7;&#x91CF;&#x4E0D;&#x4EC5;&#x53EF;&#x7528;&#x4E8E;&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x7684;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;&#xFF0C;&#x4E5F;&#x53EF;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x3002;</p><pre class="programlisting">#include &lt;semaphore.h&gt;

int sem_init(sem_t *sem, int pshared, unsigned int value);
int sem_wait(sem_t *sem);
int sem_trywait(sem_t *sem);
int sem_post(sem_t * sem);
int sem_destroy(sem_t * sem);</pre><p>semaphore&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x4E3A;sem_t&#xFF0C;sem_init()&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;semaphore&#x53D8;&#x91CF;&#xFF0C;value&#x53C2;&#x6570;&#x8868;&#x793A;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x7684;&#x6570;&#x91CF;&#xFF0C;pshared&#x53C2;&#x6570;&#x4E3A;0&#x8868;&#x793A;&#x4FE1;&#x53F7;&#x91CF;&#x7528;&#x4E8E;&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x7684;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;&#xFF0C;&#x672C;&#x8282;&#x53EA;&#x4ECB;&#x7ECD;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5728;&#x7528;&#x5B8C;semaphore&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#x5E94;&#x8BE5;&#x8C03;&#x7528;sem_destroy()&#x91CA;&#x653E;&#x4E0E;semaphore&#x76F8;&#x5173;&#x7684;&#x8D44;&#x6E90;&#x3002;</p><p>&#x8C03;&#x7528;sem_wait()&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x8D44;&#x6E90;&#xFF0C;&#x4F7F;semaphore&#x7684;&#x503C;&#x51CF;1&#xFF0C;&#x5982;&#x679C;&#x8C03;&#x7528;sem_wait()&#x65F6;semaphore&#x7684;&#x503C;&#x5DF2;&#x7ECF;&#x662F;0&#xFF0C;&#x5219;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5E0C;&#x671B;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x7528;sem_trywait()&#x3002;&#x8C03;&#x7528;sem_post()&#x53EF;&#x4EE5;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#xFF0C;&#x4F7F;semaphore&#x7684;&#x503C;&#x52A0;1&#xFF0C;&#x540C;&#x65F6;&#x5524;&#x9192;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x7684;&#x7EBF;&#x7A0B;&#x3002;</p><p>&#x4E0A;&#x4E00;&#x8282;&#x751F;&#x4EA7;&#x8005;&#xFF0D;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x57FA;&#x4E8E;&#x94FE;&#x8868;&#x7684;&#xFF0C;&#x5176;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x5206;&#x914D;&#xFF0C;&#x73B0;&#x5728;&#x57FA;&#x4E8E;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x73AF;&#x5F62;&#x961F;&#x5217;&#x91CD;&#x5199;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF1A;</p><pre class="programlisting">#include &lt;stdlib.h&gt;
#include &lt;pthread.h&gt;
#include &lt;stdio.h&gt;
#include &lt;semaphore.h&gt;

#define NUM 5
int queue[NUM];
sem_t blank_number, product_number;

void *producer(void *arg) 
{
	int p = 0;
	while (1) {
		sem_wait(&amp;blank_number);
		queue[p] = rand() % 1000 + 1;
		printf(&quot;Produce %d\n&quot;, queue[p]);
		sem_post(&amp;product_number);
		p = (p+1)%NUM;
		sleep(rand()%5);
	}
}

void *consumer(void *arg) 
{
	int c = 0;
	while (1) {
		sem_wait(&amp;product_number);
		printf(&quot;Consume %d\n&quot;, queue[c]);
		queue[c] = 0;
		sem_post(&amp;blank_number);
		c = (c+1)%NUM;
		sleep(rand()%5);
	}
}

int main(int argc, char *argv[]) 
{
	pthread_t pid, cid;  

	sem_init(&amp;blank_number, 0, NUM);
	sem_init(&amp;product_number, 0, 0);
	pthread_create(&amp;pid, NULL, producer, NULL);
	pthread_create(&amp;cid, NULL, consumer, NULL);
	pthread_join(pid, NULL);
	pthread_join(cid, NULL);
	sem_destroy(&amp;blank_number);
	sem_destroy(&amp;product_number);
	return 0;
}</pre><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a id="id2897407"></a>&#x4E60;&#x9898;</h4></div></div></div><p>1&#x3001;&#x672C;&#x8282;&#x548C;&#x4E0A;&#x4E00;&#x8282;&#x7684;&#x4F8B;&#x5B50;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x63D0;&#x793A;&#xFF1A;&#x7528;Condition Variable&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;Semaphore&#x3002;&#x8BF7;&#x7528;Condition Variable&#x5B9E;&#x73B0;Semaphore&#xFF0C;&#x7136;&#x540E;&#x7528;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x7684;Semaphore&#x91CD;&#x5199;&#x672C;&#x8282;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2897423"></a>3.4.&#xA0;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;&#x673A;&#x5236;</h3></div></div></div><p>&#x5982;&#x679C;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5404;&#x7EBF;&#x7A0B;&#x8BFB;&#x5230;&#x7684;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8BBF;&#x95EE;&#x51B2;&#x7A81;&#x3002;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x6539;&#x5199;&#x6570;&#x636E;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7531;&#x6B64;&#x5F15;&#x51FA;&#x4E86;&#x8BFB;&#x8005;&#x5199;&#x8005;&#x9501;&#xFF08;Reader-Writer Lock&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;Reader&#x4E4B;&#x95F4;&#x5E76;&#x4E0D;&#x4E92;&#x65A5;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8BFB;&#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF0C;&#x800C;Writer&#x662F;&#x72EC;&#x5360;&#x7684;&#xFF08;exclusive&#xFF09;&#xFF0C;&#x5728;Writer&#x4FEE;&#x6539;&#x6570;&#x636E;&#x65F6;&#x5176;&#x5B83;Reader&#x6216;Writer&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x89C1;Reader-Writer Lock&#x6BD4;Mutex&#x5177;&#x6709;&#x66F4;&#x597D;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x3002;</p><p>&#x7528;&#x6302;&#x8D77;&#x7B49;&#x5F85;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#x8BBF;&#x95EE;&#x51B2;&#x7A81;&#x4E0D;&#x89C1;&#x5F97;&#x662F;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x6BD5;&#x7ADF;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x89E3;&#x51B3;&#x8BBF;&#x95EE;&#x51B2;&#x7A81;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x6302;&#x8D77;&#x67D0;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;Linux&#x5185;&#x6838;&#x7684;Seqlock&#x3001;RCU&#xFF08;read-copy-update&#xFF09;&#x7B49;&#x673A;&#x5236;&#x3002;</p><p>&#x5173;&#x4E8E;&#x8FD9;&#x4E9B;&#x540C;&#x6B65;&#x673A;&#x5236;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a class="xref" href="bi01.html#bibli.apue" title="Advanced Programming in the UNIX Environment">[<abbr class="abbrev">APUE2e</abbr>]</a>&#x548C;<a class="xref" href="bi01.html#bibli.ulk" title="Understanding the Linux Kernel">[<abbr class="abbrev">ULK</abbr>]</a>&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch35s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch35.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch35s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;4.&#xA0;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;</td></tr></tbody></table></div>
</body></html>