<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>7.&#xA0;TCP&#x534F;&#x8BAE;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch36.html" title="&#x7B2C;&#xA0;36&#xA0;&#x7AE0;&#xA0;TCP/IP&#x534F;&#x8BAE;&#x57FA;&#x7840;"><link rel="prev" href="ch36s06.html" title="6.&#xA0;UDP&#x6BB5;&#x683C;&#x5F0F;"><link rel="next" href="ch37.html" title="&#x7B2C;&#xA0;37&#xA0;&#x7AE0;&#xA0;socket&#x7F16;&#x7A0B;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">7.&#xA0;TCP&#x534F;&#x8BAE;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch36s06.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;36&#xA0;&#x7AE0;&#xA0;TCP/IP&#x534F;&#x8BAE;&#x57FA;&#x7840;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch37.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2900861"></a>7.&#xA0;TCP&#x534F;&#x8BAE;</h2></div></div></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2900865"></a>7.1.&#xA0;&#x6BB5;&#x683C;&#x5F0F;</h3></div></div></div><p>TCP&#x7684;&#x6BB5;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF08;&#x8BE5;&#x56FE;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.tcpip" title="TCP/IP Illustrated, Volume 1: The Protocols">[<abbr class="abbrev">TCPIP</abbr>]</a>&#xFF09;&#x3002;</p><div class="figure"><a id="id2900880"></a><p class="title"><b>&#x56FE;&#xA0;36.12.&#xA0;TCP&#x6BB5;&#x683C;&#x5F0F;</b></p><div class="figure-contents"><div><img src="images/tcpip.tcpformat.png" alt="TCP&#x6BB5;&#x683C;&#x5F0F;"></div></div></div><br class="figure-break"><p>&#x548C;UDP&#x534F;&#x8BAE;&#x4E00;&#x6837;&#x4E5F;&#x6709;&#x6E90;&#x7AEF;&#x53E3;&#x53F7;&#x548C;&#x76EE;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x901A;&#x8BAF;&#x7684;&#x53CC;&#x65B9;&#x7531;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x6807;&#x8BC6;&#x3002;32&#x4F4D;&#x5E8F;&#x53F7;&#x3001;32&#x4F4D;&#x786E;&#x8BA4;&#x5E8F;&#x53F7;&#x3001;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x7A0D;&#x540E;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x3002;4&#x4F4D;&#x9996;&#x90E8;&#x957F;&#x5EA6;&#x548C;IP&#x534F;&#x8BAE;&#x5934;&#x7C7B;&#x4F3C;&#xFF0C;&#x8868;&#x793A;TCP&#x534F;&#x8BAE;&#x5934;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x4EE5;4&#x5B57;&#x8282;&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;&#x56E0;&#x6B64;TCP&#x534F;&#x8BAE;&#x5934;&#x6700;&#x957F;&#x53EF;&#x4EE5;&#x662F;4x15=60&#x5B57;&#x8282;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x9009;&#x9879;&#x5B57;&#x6BB5;&#xFF0C;TCP&#x534F;&#x8BAE;&#x5934;&#x6700;&#x77ED;20&#x5B57;&#x8282;&#x3002;URG&#x3001;ACK&#x3001;PSH&#x3001;RST&#x3001;SYN&#x3001;FIN&#x662F;&#x516D;&#x4E2A;&#x63A7;&#x5236;&#x4F4D;&#xFF0C;&#x672C;&#x8282;&#x7A0D;&#x540E;&#x5C06;&#x89E3;&#x91CA;SYN&#x3001;ACK&#x3001;FIN&#x3001;RST&#x56DB;&#x4E2A;&#x4F4D;&#xFF0C;&#x5176;&#x5B83;&#x4F4D;&#x7684;&#x89E3;&#x91CA;&#x4ECE;&#x7565;&#x3002;16&#x4F4D;&#x68C0;&#x9A8C;&#x548C;&#x5C06;TCP&#x534F;&#x8BAE;&#x5934;&#x548C;&#x6570;&#x636E;&#x90FD;&#x8BA1;&#x7B97;&#x5728;&#x5185;&#x3002;&#x7D27;&#x6025;&#x6307;&#x9488;&#x548C;&#x5404;&#x79CD;&#x9009;&#x9879;&#x7684;&#x89E3;&#x91CA;&#x4ECE;&#x7565;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2900917"></a>7.2.&#xA0;&#x901A;&#x8BAF;&#x65F6;&#x5E8F;</h3></div></div></div><p>&#x4E0B;&#x56FE;&#x662F;&#x4E00;&#x6B21;TCP&#x901A;&#x8BAF;&#x7684;&#x65F6;&#x5E8F;&#x56FE;&#x3002;</p><div class="figure"><a id="id2900926"></a><p class="title"><b>&#x56FE;&#xA0;36.13.&#xA0;TCP&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x65AD;&#x5F00;</b></p><div class="figure-contents"><div><img src="images/tcpip.tcpconnection.png" alt="TCP&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x65AD;&#x5F00;"></div></div></div><br class="figure-break"><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x5BA2;&#x6237;&#x7AEF;&#x4E3B;&#x52A8;&#x53D1;&#x8D77;&#x8FDE;&#x63A5;&#x3001;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x54CD;&#x5E94;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5BA2;&#x6237;&#x7AEF;&#x4E3B;&#x52A8;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x3002;&#x4E24;&#x6761;&#x7AD6;&#x7EBF;&#x8868;&#x793A;&#x901A;&#x8BAF;&#x7684;&#x4E24;&#x7AEF;&#xFF0C;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x8868;&#x793A;&#x65F6;&#x95F4;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x7AEF;&#x4F20;&#x5230;&#x7F51;&#x7EDC;&#x7684;&#x53E6;&#x4E00;&#x7AEF;&#x4E5F;&#x9700;&#x8981;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x56FE;&#x4E2D;&#x7684;&#x7BAD;&#x5934;&#x90FD;&#x662F;&#x659C;&#x7684;&#x3002;&#x53CC;&#x65B9;&#x53D1;&#x9001;&#x7684;&#x6BB5;&#x6309;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x7F16;&#x53F7;&#x4E3A;1-10&#xFF0C;&#x5404;&#x6BB5;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x4FE1;&#x606F;&#x5728;&#x7BAD;&#x5934;&#x4E0A;&#x6807;&#x51FA;&#xFF0C;&#x4F8B;&#x5982;&#x6BB5;2&#x7684;&#x7BAD;&#x5934;&#x4E0A;&#x6807;&#x7740;SYN, 8000(0), ACK 1001, &lt;mss 1024&gt;&#xFF0C;&#x8868;&#x793A;&#x8BE5;&#x6BB5;&#x4E2D;&#x7684;SYN&#x4F4D;&#x7F6E;1&#xFF0C;32&#x4F4D;&#x5E8F;&#x53F7;&#x662F;8000&#xFF0C;&#x8BE5;&#x6BB5;&#x4E0D;&#x643A;&#x5E26;&#x6709;&#x6548;&#x8F7D;&#x8377;&#xFF08;&#x6570;&#x636E;&#x5B57;&#x8282;&#x6570;&#x4E3A;0&#xFF09;&#xFF0C;ACK&#x4F4D;&#x7F6E;1&#xFF0C;32&#x4F4D;&#x786E;&#x8BA4;&#x5E8F;&#x53F7;&#x662F;1001&#xFF0C;&#x5E26;&#x6709;&#x4E00;&#x4E2A;mss&#x9009;&#x9879;&#x503C;&#x4E3A;1024&#x3002;</p><p>&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;1&#xFF0C;SYN&#x4F4D;&#x8868;&#x793A;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x3002;&#x5E8F;&#x53F7;&#x662F;1000&#xFF0C;&#x8FD9;&#x4E2A;&#x5E8F;&#x53F7;&#x5728;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x4E2D;&#x7528;&#x4F5C;&#x4E34;&#x65F6;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6BCF;&#x53D1;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5B57;&#x8282;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E8F;&#x53F7;&#x8981;&#x52A0;1&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5E8F;&#x53F7;&#x6392;&#x51FA;&#x6570;&#x636E;&#x5305;&#x7684;&#x6B63;&#x786E;&#x987A;&#x5E8F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x4E22;&#x5305;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x89C4;&#x5B9A;SYN&#x4F4D;&#x548C;FIN&#x4F4D;&#x4E5F;&#x8981;&#x5360;&#x4E00;&#x4E2A;&#x5E8F;&#x53F7;&#xFF0C;&#x8FD9;&#x6B21;&#x867D;&#x7136;&#x6CA1;&#x53D1;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x53D1;&#x4E86;SYN&#x4F4D;&#xFF0C;&#x56E0;&#x6B64;&#x4E0B;&#x6B21;&#x518D;&#x53D1;&#x9001;&#x5E94;&#x8BE5;&#x7528;&#x5E8F;&#x53F7;1001&#x3002;mss&#x8868;&#x793A;&#x6700;&#x5927;&#x6BB5;&#x5C3A;&#x5BF8;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6BB5;&#x592A;&#x5927;&#xFF0C;&#x5C01;&#x88C5;&#x6210;&#x5E27;&#x540E;&#x8D85;&#x8FC7;&#x4E86;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x6700;&#x5927;&#x5E27;&#x957F;&#x5EA6;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5728;IP&#x5C42;&#x5206;&#x7247;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x58F0;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x6700;&#x5927;&#x6BB5;&#x5C3A;&#x5BF8;&#xFF0C;&#x5EFA;&#x8BAE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x53D1;&#x6765;&#x7684;&#x6BB5;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x957F;&#x5EA6;&#x3002;</p></li><li><p>&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x6BB5;2&#xFF0C;&#x4E5F;&#x5E26;&#x6709;SYN&#x4F4D;&#xFF0C;&#x540C;&#x65F6;&#x7F6E;ACK&#x4F4D;&#x8868;&#x793A;&#x786E;&#x8BA4;&#xFF0C;&#x786E;&#x8BA4;&#x5E8F;&#x53F7;&#x662F;1001&#xFF0C;&#x8868;&#x793A;&#x201C;&#x6211;&#x63A5;&#x6536;&#x5230;&#x5E8F;&#x53F7;1000&#x53CA;&#x5176;&#x4EE5;&#x524D;&#x6240;&#x6709;&#x7684;&#x6BB5;&#xFF0C;&#x8BF7;&#x4F60;&#x4E0B;&#x6B21;&#x53D1;&#x9001;&#x5E8F;&#x53F7;&#x4E3A;1001&#x7684;&#x6BB5;&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5E94;&#x7B54;&#x4E86;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x540C;&#x65F6;&#x58F0;&#x660E;&#x6700;&#x5927;&#x5C3A;&#x5BF8;&#x4E3A;1024&#x3002;</p></li><li><p>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;3&#xFF0C;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5E94;&#x7B54;&#xFF0C;&#x786E;&#x8BA4;&#x5E8F;&#x53F7;&#x662F;8001&#x3002;</p></li></ol></div><p>&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x5206;&#x522B;&#x7ED9;&#x5BF9;&#x65B9;&#x53D1;&#x4E86;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x4E5F;&#x5E94;&#x7B54;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x5176;&#x4E2D;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BF7;&#x6C42;&#x548C;&#x5E94;&#x7B54;&#x5728;&#x4E00;&#x4E2A;&#x6BB5;&#x4E2D;&#x53D1;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x5171;&#x6709;&#x4E09;&#x4E2A;&#x6BB5;&#x7528;&#x4E8E;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x79F0;&#x4E3A;&apos;&apos;&apos;&#x4E09;&#x65B9;&#x63E1;&#x624B;&#xFF08;three-way-handshake&#xFF09;&apos;&apos;&apos;&#x3002;&#x5728;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x53CC;&#x65B9;&#x534F;&#x5546;&#x4E86;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x53CC;&#x65B9;&#x53D1;&#x9001;&#x5E8F;&#x53F7;&#x7684;&#x521D;&#x59CB;&#x503C;&#x3001;&#x6700;&#x5927;&#x6BB5;&#x5C3A;&#x5BF8;&#x7B49;&#x3002;</p><p>&#x5728;TCP&#x901A;&#x8BAF;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x65B9;&#x6536;&#x5230;&#x53E6;&#x4E00;&#x65B9;&#x53D1;&#x6765;&#x7684;&#x6BB5;&#xFF0C;&#x8BFB;&#x51FA;&#x5176;&#x4E2D;&#x7684;&#x76EE;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x53D1;&#x73B0;&#x672C;&#x673A;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x5C31;&#x4F1A;&#x5E94;&#x7B54;&#x4E00;&#x4E2A;&#x5305;&#x542B;RST&#x4F4D;&#x7684;&#x6BB5;&#x7ED9;&#x53E6;&#x4E00;&#x65B9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;8080&#x7AEF;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x5374;&#x7528;telnet&#x5BA2;&#x6237;&#x7AEF;&#x53BB;&#x8FDE;&#x63A5;&#x5B83;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x6765;&#x7684;SYN&#x6BB5;&#x5C31;&#x4F1A;&#x5E94;&#x7B54;&#x4E00;&#x4E2A;RST&#x6BB5;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;telnet&#x7A0B;&#x5E8F;&#x6536;&#x5230;RST&#x6BB5;&#x540E;&#x62A5;&#x544A;&#x9519;&#x8BEF;Connection refused&#xFF1A;</p><pre class="screen">$ telnet 192.168.0.200 8080
Trying 192.168.0.200...
telnet: Unable to connect to remote host: Connection refused</pre><p>&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;4&#xFF0C;&#x5305;&#x542B;&#x4ECE;&#x5E8F;&#x53F7;1001&#x5F00;&#x59CB;&#x7684;20&#x4E2A;&#x5B57;&#x8282;&#x6570;&#x636E;&#x3002;</p></li><li><p>&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x6BB5;5&#xFF0C;&#x786E;&#x8BA4;&#x5E8F;&#x53F7;&#x4E3A;1021&#xFF0C;&#x5BF9;&#x5E8F;&#x53F7;&#x4E3A;1001-1020&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;&#x786E;&#x8BA4;&#x6536;&#x5230;&#xFF0C;&#x540C;&#x65F6;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5E8F;&#x53F7;1021&#x5F00;&#x59CB;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5728;&#x5E94;&#x7B54;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x4ECE;&#x5E8F;&#x53F7;8001&#x5F00;&#x59CB;&#x7684;10&#x4E2A;&#x5B57;&#x8282;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;piggyback&#x3002;</p></li><li><p>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;6&#xFF0C;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x6765;&#x7684;&#x5E8F;&#x53F7;&#x4E3A;8001-8010&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;&#x786E;&#x8BA4;&#x6536;&#x5230;&#xFF0C;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5E8F;&#x53F7;8011&#x5F00;&#x59CB;&#x7684;&#x6570;&#x636E;&#x3002;</p></li></ol></div><p>&#x5728;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;ACK&#x548C;&#x786E;&#x8BA4;&#x5E8F;&#x53F7;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA4;&#x7ED9;TCP&#x534F;&#x8BAE;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x6682;&#x5B58;&#x5728;TCP&#x5C42;&#x7684;&#x53D1;&#x9001;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF0C;&#x53D1;&#x51FA;&#x6570;&#x636E;&#x5305;&#x7ED9;&#x5BF9;&#x65B9;&#x4E4B;&#x540E;&#xFF0C;&#x53EA;&#x6709;&#x6536;&#x5230;&#x5BF9;&#x65B9;&#x5E94;&#x7B54;&#x7684;ACK&#x6BB5;&#x624D;&#x77E5;&#x9053;&#x8BE5;&#x6570;&#x636E;&#x5305;&#x786E;&#x5B9E;&#x53D1;&#x5230;&#x4E86;&#x5BF9;&#x65B9;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x53D1;&#x9001;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x91CA;&#x653E;&#x6389;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x4E22;&#x5931;&#x4E86;&#x6570;&#x636E;&#x5305;&#x6216;&#x8005;&#x4E22;&#x5931;&#x4E86;&#x5BF9;&#x65B9;&#x53D1;&#x56DE;&#x7684;ACK&#x6BB5;&#xFF0C;&#x7ECF;&#x8FC7;&#x7B49;&#x5F85;&#x8D85;&#x65F6;&#x540E;TCP&#x534F;&#x8BAE;&#x81EA;&#x52A8;&#x5C06;&#x53D1;&#x9001;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5305;&#x91CD;&#x53D1;&#x3002;</p><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53EA;&#x63CF;&#x8FF0;&#x4E86;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x95EE;&#x4E00;&#x7B54;&#x7684;&#x60C5;&#x666F;&#xFF0C;&#x5B9E;&#x9645;&#x7684;TCP&#x6570;&#x636E;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x6536;&#x53D1;&#x5F88;&#x591A;&#x6570;&#x636E;&#x6BB5;&#xFF0C;&#x867D;&#x7136;&#x5178;&#x578B;&#x7684;&#x60C5;&#x666F;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x4E3B;&#x52A8;&#x8BF7;&#x6C42;&#x670D;&#x52A1;&#x5668;&#x88AB;&#x52A8;&#x5E94;&#x7B54;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x5982;&#x6B64;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;TCP&#x534F;&#x8BAE;&#x4E3A;&#x5E94;&#x7528;&#x5C42;&#x63D0;&#x4F9B;&#x4E86;&#x5168;&#x53CC;&#x5DE5;&#xFF08;full-duplex&#xFF09;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x53CC;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;<span class="emphasis"><em>&#x4E3B;&#x52A8;&#x751A;&#x81F3;&#x540C;&#x65F6;</em></span>&#x7ED9;&#x5BF9;&#x65B9;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;</p><p>&#x5982;&#x679C;&#x901A;&#x8BAF;&#x8FC7;&#x7A0B;&#x53EA;&#x80FD;&#x91C7;&#x7528;&#x4E00;&#x95EE;&#x4E00;&#x7B54;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6536;&#x548C;&#x53D1;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x4F20;&#x8F93;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;&#x5219;&#x79F0;&#x4E3A;&apos;&apos;&apos;&#x534A;&#x53CC;&#x5DE5;&#xFF08;half-duplex&#xFF09;&apos;&apos;&apos;&#xFF0C;&#x5047;&#x8BBE;&#x67D0;&#x79CD;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x534F;&#x8BAE;&#x662F;&#x534A;&#x53CC;&#x5DE5;&#x7684;&#xFF0C;&#x5219;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x5957;&#x5E8F;&#x53F7;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8BAF;&#x53CC;&#x65B9;&#x5404;&#x81EA;&#x7EF4;&#x62A4;&#x4E00;&#x5957;&#x5E8F;&#x53F7;&#xFF0C;&#x60F3;&#x4E00;&#x60F3;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;</p><p>&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p><div class="orderedlist"><ol type="1"><li><p>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;7&#xFF0C;FIN&#x4F4D;&#x8868;&#x793A;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p></li><li><p>&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x6BB5;8&#xFF0C;&#x5E94;&#x7B54;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x3002;</p></li><li><p>&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x6BB5;9&#xFF0C;&#x5176;&#x4E2D;&#x4E5F;&#x5305;&#x542B;FIN&#x4F4D;&#xFF0C;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x3002;</p></li><li><p>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;10&#xFF0C;&#x5E94;&#x7B54;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x3002;</p></li></ol></div><p>&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x4E09;&#x65B9;&#x63E1;&#x624B;&#xFF0C;&#x800C;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x901A;&#x5E38;&#x9700;&#x8981;4&#x4E2A;&#x6BB5;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5E94;&#x7B54;&#x548C;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x901A;&#x5E38;&#x4E0D;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x4E2A;&#x6BB5;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x8FDE;&#x63A5;&#x534A;&#x5173;&#x95ED;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5BA2;&#x6237;&#x7AEF;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x4E4B;&#x540E;&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x53D1;&#x9001;&#x6570;&#x636E;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x670D;&#x52A1;&#x5668;&#x8FD8;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x6570;&#x636E;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x76F4;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E5F;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x4E3A;&#x6B62;&#xFF0C;&#x7A0D;&#x540E;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p></div><div class="sect2" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2901189"></a>7.3.&#xA0;&#x6D41;&#x91CF;&#x63A7;&#x5236;</h3></div></div></div><p>&#x4ECB;&#x7ECD;UDP&#x65F6;&#x6211;&#x4EEC;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x53D1;&#x9001;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x901F;&#x5EA6;&#x8F83;&#x5FEB;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x63A5;&#x6536;&#x5230;&#x6570;&#x636E;&#x540E;&#x5904;&#x7406;&#x7684;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#xFF0C;&#x800C;&#x63A5;&#x6536;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5C31;&#x4F1A;&#x4E22;&#x5931;&#x6570;&#x636E;&#x3002;TCP&#x534F;&#x8BAE;&#x901A;&#x8FC7;&apos;&apos;&apos;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#xFF08;Sliding Window&#xFF09;&apos;&apos;&apos;&#x673A;&#x5236;&#x89E3;&#x51B3;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x3002;&#x770B;&#x4E0B;&#x56FE;&#x7684;&#x901A;&#x8BAF;&#x8FC7;&#x7A0B;&#x3002;</p><div class="figure"><a id="id2901207"></a><p class="title"><b>&#x56FE;&#xA0;36.14.&#xA0;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;</b></p><div class="figure-contents"><div><img src="images/tcpip.slidingwindow.png" alt="&#x6ED1;&#x52A8;&#x7A97;&#x53E3;"></div></div></div><br class="figure-break"><div class="orderedlist"><ol type="1"><li><p>&#x53D1;&#x9001;&#x7AEF;&#x53D1;&#x8D77;&#x8FDE;&#x63A5;&#xFF0C;&#x58F0;&#x660E;&#x6700;&#x5927;&#x6BB5;&#x5C3A;&#x5BF8;&#x662F;1460&#xFF0C;&#x521D;&#x59CB;&#x5E8F;&#x53F7;&#x662F;0&#xFF0C;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x662F;4K&#xFF0C;&#x8868;&#x793A;&#x201C;&#x6211;&#x7684;&#x63A5;&#x6536;&#x7F13;&#x51B2;&#x533A;&#x8FD8;&#x6709;4K&#x5B57;&#x8282;&#x7A7A;&#x95F2;&#xFF0C;&#x4F60;&#x53D1;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;4K&#x201D;&#x3002;&#x63A5;&#x6536;&#x7AEF;&#x5E94;&#x7B54;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x58F0;&#x660E;&#x6700;&#x5927;&#x6BB5;&#x5C3A;&#x5BF8;&#x662F;1024&#xFF0C;&#x521D;&#x59CB;&#x5E8F;&#x53F7;&#x662F;8000&#xFF0C;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x662F;6K&#x3002;&#x53D1;&#x9001;&#x7AEF;&#x5E94;&#x7B54;&#xFF0C;&#x4E09;&#x65B9;&#x63E1;&#x624B;&#x7ED3;&#x675F;&#x3002;</p></li><li><p>&#x53D1;&#x9001;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;4-9&#xFF0C;&#x6BCF;&#x4E2A;&#x6BB5;&#x5E26;1K&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x6839;&#x636E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x77E5;&#x9053;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x6EE1;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x505C;&#x6B62;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;</p></li><li><p>&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x8D70;2K&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x6536;&#x7F13;&#x51B2;&#x533A;&#x53C8;&#x6709;&#x4E86;2K&#x7A7A;&#x95F2;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;10&#xFF0C;&#x5728;&#x5E94;&#x7B54;&#x5DF2;&#x6536;&#x5230;6K&#x6570;&#x636E;&#x7684;&#x540C;&#x65F6;&#x58F0;&#x660E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x4E3A;2K&#x3002;</p></li><li><p>&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53C8;&#x63D0;&#x8D70;2K&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x6536;&#x7F13;&#x51B2;&#x533A;&#x6709;4K&#x7A7A;&#x95F2;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;11&#xFF0C;&#x91CD;&#x65B0;&#x58F0;&#x660E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x4E3A;4K&#x3002;</p></li><li><p>&#x53D1;&#x9001;&#x7AEF;&#x53D1;&#x51FA;&#x6BB5;12-13&#xFF0C;&#x6BCF;&#x4E2A;&#x6BB5;&#x5E26;2K&#x6570;&#x636E;&#xFF0C;&#x6BB5;13&#x540C;&#x65F6;&#x8FD8;&#x5305;&#x542B;FIN&#x4F4D;&#x3002;</p></li><li><p>&#x63A5;&#x6536;&#x7AEF;&#x5E94;&#x7B54;&#x63A5;&#x6536;&#x5230;&#x7684;2K&#x6570;&#x636E;&#xFF08;6145-8192&#xFF09;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;FIN&#x4F4D;&#x5360;&#x4E00;&#x4E2A;&#x5E8F;&#x53F7;8193&#xFF0C;&#x56E0;&#x6B64;&#x5E94;&#x7B54;&#x5E8F;&#x53F7;&#x662F;8194&#xFF0C;&#x8FDE;&#x63A5;&#x5904;&#x4E8E;&#x534A;&#x5173;&#x95ED;&#x72B6;&#x6001;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x540C;&#x65F6;&#x58F0;&#x660E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x4E3A;2K&#x3002;</p></li><li><p>&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x8D70;2K&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x91CD;&#x65B0;&#x58F0;&#x660E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x4E3A;4K&#x3002;</p></li><li><p>&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x8D70;&#x5269;&#x4E0B;&#x7684;2K&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x6536;&#x7F13;&#x51B2;&#x533A;&#x5168;&#x7A7A;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x91CD;&#x65B0;&#x58F0;&#x660E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x4E3A;6K&#x3002;</p></li><li><p>&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x63D0;&#x8D70;&#x5168;&#x90E8;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x51B3;&#x5B9A;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#xFF0C;&#x53D1;&#x51FA;&#x6BB5;17&#x5305;&#x542B;FIN&#x4F4D;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x5E94;&#x7B54;&#xFF0C;&#x8FDE;&#x63A5;&#x5B8C;&#x5168;&#x5173;&#x95ED;&#x3002;</p></li></ol></div><p>&#x4E0A;&#x56FE;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#x7528;&#x5C0F;&#x65B9;&#x5757;&#x8868;&#x793A;1K&#x6570;&#x636E;&#xFF0C;&#x5B9E;&#x5FC3;&#x7684;&#x5C0F;&#x65B9;&#x5757;&#x8868;&#x793A;&#x5DF2;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x865A;&#x7EBF;&#x6846;&#x8868;&#x793A;&#x63A5;&#x6536;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x56E0;&#x6B64;&#x5957;&#x5728;&#x865A;&#x7EBF;&#x6846;&#x4E2D;&#x7684;&#x7A7A;&#x5FC3;&#x5C0F;&#x65B9;&#x5757;&#x8868;&#x793A;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#xFF0C;&#x4ECE;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x968F;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x8D70;&#x6570;&#x636E;&#xFF0C;&#x865A;&#x7EBF;&#x6846;&#x662F;&#x5411;&#x53F3;&#x6ED1;&#x52A8;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x79F0;&#x4E3A;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x3002;</p><p>&#x4ECE;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x662F;&#x4E00;K&#x4E00;K&#x5730;&#x53D1;&#x9001;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4E24;K&#x4E24;K&#x5730;&#x63D0;&#x8D70;&#x6570;&#x636E;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x4E00;&#x6B21;&#x63D0;&#x8D70;3K&#x6216;6K&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x6B21;&#x53EA;&#x63D0;&#x8D70;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x770B;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x6216;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x6D41;&#xFF08;stream&#xFF09;&#xFF0C;&#x5728;&#x5E95;&#x5C42;&#x901A;&#x8BAF;&#x4E2D;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x88AB;&#x62C6;&#x6210;&#x5F88;&#x591A;&#x6570;&#x636E;&#x5305;&#x6765;&#x53D1;&#x9001;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x6709;&#x591A;&#x5C11;&#x5B57;&#x8282;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x56E0;&#x6B64;TCP&#x534F;&#x8BAE;&#x662F;&#x9762;&#x5411;&#x6D41;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x800C;UDP&#x662F;&#x9762;&#x5411;&#x6D88;&#x606F;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x6BCF;&#x4E2A;UDP&#x6BB5;&#x90FD;&#x662F;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x4EE5;&#x6D88;&#x606F;&#x4E3A;&#x5355;&#x4F4D;&#x63D0;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x80FD;&#x4E00;&#x6B21;&#x63D0;&#x53D6;&#x4EFB;&#x610F;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x548C;TCP&#x662F;&#x5F88;&#x4E0D;&#x540C;&#x7684;&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch36s06.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch36.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch37.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">6.&#xA0;UDP&#x6BB5;&#x683C;&#x5F0F;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;37&#xA0;&#x7AE0;&#xA0;socket&#x7F16;&#x7A0B;</td></tr></tbody></table></div>
</body></html>