<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;TCP/IP&#x534F;&#x8BAE;&#x6808;&#x4E0E;&#x6570;&#x636E;&#x5305;&#x5C01;&#x88C5;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch36.html" title="&#x7B2C;&#xA0;36&#xA0;&#x7AE0;&#xA0;TCP/IP&#x534F;&#x8BAE;&#x57FA;&#x7840;"><link rel="prev" href="ch36.html" title="&#x7B2C;&#xA0;36&#xA0;&#x7AE0;&#xA0;TCP/IP&#x534F;&#x8BAE;&#x57FA;&#x7840;"><link rel="next" href="ch36s02.html" title="2.&#xA0;&#x4EE5;&#x592A;&#x7F51;(RFC 894)&#x5E27;&#x683C;&#x5F0F;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;TCP/IP&#x534F;&#x8BAE;&#x6808;&#x4E0E;&#x6570;&#x636E;&#x5305;&#x5C01;&#x88C5;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch36.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;36&#xA0;&#x7AE0;&#xA0;TCP/IP&#x534F;&#x8BAE;&#x57FA;&#x7840;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch36s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2899420"></a>1.&#xA0;TCP/IP&#x534F;&#x8BAE;&#x6808;&#x4E0E;&#x6570;&#x636E;&#x5305;&#x5C01;&#x88C5;</h2></div></div></div><p>TCP/IP&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x6808;&#x5206;&#x4E3A;&#x5E94;&#x7528;&#x5C42;&#xFF08;Application&#xFF09;&#x3001;&#x4F20;&#x8F93;&#x5C42;&#xFF08;Transport&#xFF09;&#x3001;&#x7F51;&#x7EDC;&#x5C42;&#xFF08;Network&#xFF09;&#x548C;&#x94FE;&#x8DEF;&#x5C42;&#xFF08;Link&#xFF09;&#x56DB;&#x5C42;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF08;&#x8BE5;&#x56FE;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.tcpip" title="TCP/IP Illustrated, Volume 1: The Protocols">[<abbr class="abbrev">TCPIP</abbr>]</a>&#xFF09;&#x3002;</p><div class="figure"><a id="id2898811"></a><p class="title"><b>&#x56FE;&#xA0;36.1.&#xA0;TCP/IP&#x534F;&#x8BAE;&#x6808;</b></p><div class="figure-contents"><div><img src="images/tcpip.stack.png" alt="TCP/IP&#x534F;&#x8BAE;&#x6808;"></div></div></div><br class="figure-break"><p></p><p>&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x8FC7;TCP/IP&#x534F;&#x8BAE;&#x901A;&#x8BAF;&#x7684;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF08;&#x8BE5;&#x56FE;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.tcpip" title="TCP/IP Illustrated, Volume 1: The Protocols">[<abbr class="abbrev">TCPIP</abbr>]</a>&#xFF09;&#x3002;</p><div class="figure"><a id="id2899440"></a><p class="title"><b>&#x56FE;&#xA0;36.2.&#xA0;TCP/IP&#x901A;&#x8BAF;&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/tcpip.transferlan.png" alt="TCP/IP&#x901A;&#x8BAF;&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><p>&#x4F20;&#x8F93;&#x5C42;&#x53CA;&#x5176;&#x4EE5;&#x4E0B;&#x7684;&#x673A;&#x5236;&#x7531;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#xFF0C;&#x5E94;&#x7528;&#x5C42;&#x7531;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x63D0;&#x4F9B;&#xFF08;&#x540E;&#x9762;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x4F7F;&#x7528;socket API&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF09;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x901A;&#x8BAF;&#x6570;&#x636E;&#x7684;&#x542B;&#x4E49;&#x8FDB;&#x884C;&#x89E3;&#x91CA;&#xFF0C;&#x800C;&#x4F20;&#x8F93;&#x5C42;&#x53CA;&#x5176;&#x4EE5;&#x4E0B;&#x5904;&#x7406;&#x901A;&#x8BAF;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x8DEF;&#x5F84;&#x53D1;&#x9001;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x5E94;&#x7528;&#x5C42;&#x6570;&#x636E;&#x901A;&#x8FC7;&#x534F;&#x8BAE;&#x6808;&#x53D1;&#x5230;&#x7F51;&#x7EDC;&#x4E0A;&#x65F6;&#xFF0C;&#x6BCF;&#x5C42;&#x534F;&#x8BAE;&#x90FD;&#x8981;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x9996;&#x90E8;&#xFF08;header&#xFF09;&#xFF0C;&#x79F0;&#x4E3A;&#x5C01;&#x88C5;&#xFF08;Encapsulation&#xFF09;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF08;&#x8BE5;&#x56FE;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.tcpip" title="TCP/IP Illustrated, Volume 1: The Protocols">[<abbr class="abbrev">TCPIP</abbr>]</a>&#xFF09;&#x3002;</p><div class="figure"><a id="id2899478"></a><p class="title"><b>&#x56FE;&#xA0;36.3.&#xA0;TCP/IP&#x6570;&#x636E;&#x5305;&#x7684;&#x5C01;&#x88C5;</b></p><div class="figure-contents"><div><img src="images/tcpip.datagram.png" alt="TCP/IP&#x6570;&#x636E;&#x5305;&#x7684;&#x5C01;&#x88C5;"></div></div></div><br class="figure-break"><p>&#x4E0D;&#x540C;&#x7684;&#x534F;&#x8BAE;&#x5C42;&#x5BF9;&#x6570;&#x636E;&#x5305;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x79F0;&#x8C13;&#xFF0C;&#x5728;&#x4F20;&#x8F93;&#x5C42;&#x53EB;&#x505A;&#x6BB5;&#xFF08;segment&#xFF09;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x5C42;&#x53EB;&#x505A;&#x6570;&#x636E;&#x62A5;&#xFF08;datagram&#xFF09;&#xFF0C;&#x5728;&#x94FE;&#x8DEF;&#x5C42;&#x53EB;&#x505A;&#x5E27;&#xFF08;frame&#xFF09;&#x3002;&#x6570;&#x636E;&#x5C01;&#x88C5;&#x6210;&#x5E27;&#x540E;&#x53D1;&#x5230;&#x4F20;&#x8F93;&#x4ECB;&#x8D28;&#x4E0A;&#xFF0C;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x4E3B;&#x673A;&#x540E;&#x6BCF;&#x5C42;&#x534F;&#x8BAE;&#x518D;&#x5265;&#x6389;&#x76F8;&#x5E94;&#x7684;&#x9996;&#x90E8;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x5E94;&#x7528;&#x5C42;&#x6570;&#x636E;&#x4EA4;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5904;&#x7406;&#x3002;</p><p>&#x4E0A;&#x56FE;&#x5BF9;&#x5E94;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x540C;&#x4E00;&#x7F51;&#x6BB5;&#x4E2D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x6BB5;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF08;&#x8BE5;&#x56FE;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.tcpip" title="TCP/IP Illustrated, Volume 1: The Protocols">[<abbr class="abbrev">TCPIP</abbr>]</a>&#xFF09;&#x3002;</p><div class="figure"><a id="id2899518"></a><p class="title"><b>&#x56FE;&#xA0;36.4.&#xA0;&#x8DE8;&#x8DEF;&#x7531;&#x5668;&#x901A;&#x8BAF;&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/tcpip.transferovernet.png" alt="&#x8DE8;&#x8DEF;&#x7531;&#x5668;&#x901A;&#x8BAF;&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><p>&#x5176;&#x5B9E;&#x5728;&#x94FE;&#x8DEF;&#x5C42;&#x4E4B;&#x4E0B;&#x8FD8;&#x6709;&#x7269;&#x7406;&#x5C42;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x7535;&#x4FE1;&#x53F7;&#x7684;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x4EE5;&#x592A;&#x7F51;&#x901A;&#x7528;&#x7684;&#x7F51;&#x7EBF;&#xFF08;&#x53CC;&#x7EDE;&#x7EBF;&#xFF09;&#x3001;&#x65E9;&#x671F;&#x4EE5;&#x592A;&#x7F51;&#x91C7;&#x7528;&#x7684;&#x7684;&#x540C;&#x8F74;&#x7535;&#x7F06;&#xFF08;&#x73B0;&#x5728;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x6709;&#x7EBF;&#x7535;&#x89C6;&#xFF09;&#x3001;&#x5149;&#x7EA4;&#x7B49;&#x90FD;&#x5C5E;&#x4E8E;&#x7269;&#x7406;&#x5C42;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x7269;&#x7406;&#x5C42;&#x7684;&#x80FD;&#x529B;&#x51B3;&#x5B9A;&#x4E86;&#x6700;&#x5927;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x3001;&#x4F20;&#x8F93;&#x8DDD;&#x79BB;&#x3001;&#x6297;&#x5E72;&#x6270;&#x6027;&#x7B49;&#x3002;&#x96C6;&#x7EBF;&#x5668;&#xFF08;Hub&#xFF09;&#x662F;&#x5DE5;&#x4F5C;&#x5728;&#x7269;&#x7406;&#x5C42;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#xFF0C;&#x7528;&#x4E8E;&#x53CC;&#x7EDE;&#x7EBF;&#x7684;&#x8FDE;&#x63A5;&#x548C;&#x4FE1;&#x53F7;&#x4E2D;&#x7EE7;&#xFF08;&#x5C06;&#x5DF2;&#x8870;&#x51CF;&#x7684;&#x4FE1;&#x53F7;&#x518D;&#x6B21;&#x653E;&#x5927;&#x4F7F;&#x4E4B;&#x4F20;&#x5F97;&#x66F4;&#x8FDC;&#xFF09;&#x3002;</p><p>&#x94FE;&#x8DEF;&#x5C42;&#x6709;&#x4EE5;&#x592A;&#x7F51;&#x3001;&#x4EE4;&#x724C;&#x73AF;&#x7F51;&#x7B49;&#x6807;&#x51C6;&#xFF0C;&#x94FE;&#x8DEF;&#x5C42;&#x8D1F;&#x8D23;&#x7F51;&#x5361;&#x8BBE;&#x5907;&#x7684;&#x9A71;&#x52A8;&#x3001;&#x5E27;&#x540C;&#x6B65;&#xFF08;&#x5C31;&#x662F;&#x8BF4;&#x4ECE;&#x7F51;&#x7EBF;&#x4E0A;&#x68C0;&#x6D4B;&#x5230;&#x4EC0;&#x4E48;&#x4FE1;&#x53F7;&#x7B97;&#x4F5C;&#x65B0;&#x5E27;&#x7684;&#x5F00;&#x59CB;&#xFF09;&#x3001;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#xFF08;&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5230;&#x51B2;&#x7A81;&#x5C31;&#x81EA;&#x52A8;&#x91CD;&#x53D1;&#xFF09;&#x3001;&#x6570;&#x636E;&#x5DEE;&#x9519;&#x6821;&#x9A8C;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;&#x4EA4;&#x6362;&#x673A;&#x662F;&#x5DE5;&#x4F5C;&#x5728;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x94FE;&#x8DEF;&#x5C42;&#x7F51;&#x7EDC;&#x4E4B;&#x95F4;&#x8F6C;&#x53D1;&#x6570;&#x636E;&#x5E27;&#xFF08;&#x6BD4;&#x5982;&#x5341;&#x5146;&#x4EE5;&#x592A;&#x7F51;&#x548C;&#x767E;&#x5146;&#x4EE5;&#x592A;&#x7F51;&#x4E4B;&#x95F4;&#x3001;&#x4EE5;&#x592A;&#x7F51;&#x548C;&#x4EE4;&#x724C;&#x73AF;&#x7F51;&#x4E4B;&#x95F4;&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x540C;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x5E27;&#x683C;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#x8981;&#x5C06;&#x8FDB;&#x6765;&#x7684;&#x6570;&#x636E;&#x5305;&#x62C6;&#x6389;&#x94FE;&#x8DEF;&#x5C42;&#x9996;&#x90E8;&#x91CD;&#x65B0;&#x5C01;&#x88C5;&#x4E4B;&#x540E;&#x518D;&#x8F6C;&#x53D1;&#x3002;</p><p>&#x7F51;&#x7EDC;&#x5C42;&#x7684;IP&#x534F;&#x8BAE;&#x662F;&#x6784;&#x6210;Internet&#x7684;&#x57FA;&#x7840;&#x3002;Internet&#x4E0A;&#x7684;&#x4E3B;&#x673A;&#x901A;&#x8FC7;IP&#x5730;&#x5740;&#x6765;&#x6807;&#x8BC6;&#xFF0C;Internet&#x4E0A;&#x6709;&#x5927;&#x91CF;&#x8DEF;&#x7531;&#x5668;&#x8D1F;&#x8D23;&#x6839;&#x636E;IP&#x5730;&#x5740;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x8DEF;&#x5F84;&#x8F6C;&#x53D1;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x4ECE;Internet&#x4E0A;&#x7684;&#x6E90;&#x4E3B;&#x673A;&#x5230;&#x76EE;&#x7684;&#x4E3B;&#x673A;&#x5F80;&#x5F80;&#x8981;&#x7ECF;&#x8FC7;&#x5341;&#x591A;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x3002;&#x8DEF;&#x7531;&#x5668;&#x662F;&#x5DE5;&#x4F5C;&#x5728;&#x7B2C;&#x4E09;&#x5C42;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#xFF0C;&#x540C;&#x65F6;&#x517C;&#x6709;&#x4EA4;&#x6362;&#x673A;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x94FE;&#x8DEF;&#x5C42;&#x63A5;&#x53E3;&#x4E4B;&#x95F4;&#x8F6C;&#x53D1;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x56E0;&#x6B64;&#x8DEF;&#x7531;&#x5668;&#x9700;&#x8981;&#x5C06;&#x8FDB;&#x6765;&#x7684;&#x6570;&#x636E;&#x5305;&#x62C6;&#x6389;&#x7F51;&#x7EDC;&#x5C42;&#x548C;&#x94FE;&#x8DEF;&#x5C42;&#x4E24;&#x5C42;&#x9996;&#x90E8;&#x5E76;&#x91CD;&#x65B0;&#x5C01;&#x88C5;&#x3002;IP&#x534F;&#x8BAE;&#x4E0D;&#x4FDD;&#x8BC1;&#x4F20;&#x8F93;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#xFF0C;&#x53EF;&#x9760;&#x6027;&#x53EF;&#x4EE5;&#x5728;&#x4E0A;&#x5C42;&#x534F;&#x8BAE;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#x3002;</p><p>&#x7F51;&#x7EDC;&#x5C42;&#x8D1F;&#x8D23;&#x70B9;&#x5230;&#x70B9;&#xFF08;point-to-point&#xFF09;&#x7684;&#x4F20;&#x8F93;&#xFF08;&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x70B9;&#x201D;&#x6307;&#x4E3B;&#x673A;&#x6216;&#x8DEF;&#x7531;&#x5668;&#xFF09;&#xFF0C;&#x800C;&#x4F20;&#x8F93;&#x5C42;&#x8D1F;&#x8D23;&#x7AEF;&#x5230;&#x7AEF;&#xFF08;end-to-end&#xFF09;&#x7684;&#x4F20;&#x8F93;&#xFF08;&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x7AEF;&#x201D;&#x6307;&#x6E90;&#x4E3B;&#x673A;&#x548C;&#x76EE;&#x7684;&#x4E3B;&#x673A;&#xFF09;&#x3002;&#x4F20;&#x8F93;&#x5C42;&#x53EF;&#x9009;&#x62E9;TCP&#x6216;UDP&#x534F;&#x8BAE;&#x3002;TCP&#x662F;&#x4E00;&#x79CD;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x3001;&#x53EF;&#x9760;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x53CC;&#x65B9;&#x62FF;&#x8D77;&#x7535;&#x8BDD;&#x4E92;&#x901A;&#x8EAB;&#x4EFD;&#x4E4B;&#x540E;&#x5C31;&#x5EFA;&#x7ACB;&#x4E86;&#x8FDE;&#x63A5;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x8BDD;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x8FD9;&#x8FB9;&#x8BF4;&#x7684;&#x8BDD;&#x90A3;&#x8FB9;&#x4FDD;&#x8BC1;&#x542C;&#x5F97;&#x5230;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x6309;&#x8BF4;&#x8BDD;&#x7684;&#x987A;&#x5E8F;&#x542C;&#x5230;&#x7684;&#xFF0C;&#x8BF4;&#x5B8C;&#x8BDD;&#x6302;&#x673A;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;TCP&#x4F20;&#x8F93;&#x7684;&#x53CC;&#x65B9;&#x9700;&#x8981;&#x9996;&#x5148;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x4E4B;&#x540E;&#x7531;TCP&#x534F;&#x8BAE;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x6536;&#x53D1;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x5305;&#x81EA;&#x52A8;&#x91CD;&#x53D1;&#xFF0C;&#x4E0A;&#x5C42;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6536;&#x5230;&#x7684;&#x603B;&#x662F;&#x53EF;&#x9760;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF0C;&#x901A;&#x8BAF;&#x4E4B;&#x540E;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x3002;UDP&#x534F;&#x8BAE;&#x4E0D;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#xFF0C;&#x4E5F;&#x4E0D;&#x4FDD;&#x8BC1;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x5BC4;&#x4FE1;&#xFF0C;&#x5199;&#x597D;&#x4FE1;&#x653E;&#x5230;&#x90AE;&#x7B52;&#x91CC;&#xFF0C;&#x65E2;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4FE1;&#x4EF6;&#x5728;&#x90AE;&#x9012;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4FE1;&#x4EF6;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x5BC4;&#x5230;&#x76EE;&#x7684;&#x5730;&#x7684;&#x3002;&#x4F7F;&#x7528;UDP&#x534F;&#x8BAE;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5B8C;&#x6210;&#x4E22;&#x5305;&#x91CD;&#x53D1;&#x3001;&#x6D88;&#x606F;&#x6392;&#x5E8F;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;</p><p>&#x76EE;&#x7684;&#x4E3B;&#x673A;&#x6536;&#x5230;&#x6570;&#x636E;&#x5305;&#x540E;&#xFF0C;&#x5982;&#x4F55;&#x7ECF;&#x8FC7;&#x5404;&#x5C42;&#x534F;&#x8BAE;&#x6808;&#x6700;&#x540E;&#x5230;&#x8FBE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5462;&#xFF1F;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF08;&#x8BE5;&#x56FE;&#x51FA;&#x81EA;<a class="xref" href="bi01.html#bibli.tcpip" title="TCP/IP Illustrated, Volume 1: The Protocols">[<abbr class="abbrev">TCPIP</abbr>]</a>&#xFF09;&#x3002;</p><div class="figure"><a id="id2899631"></a><p class="title"><b>&#x56FE;&#xA0;36.5.&#xA0;Multiplexing&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/tcpip.multiplex.png" alt="Multiplexing&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><p>&#x4EE5;&#x592A;&#x7F51;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x9996;&#x5148;&#x6839;&#x636E;&#x4EE5;&#x592A;&#x7F51;&#x9996;&#x90E8;&#x4E2D;&#x7684;&#x201C;&#x4E0A;&#x5C42;&#x534F;&#x8BAE;&#x201D;&#x5B57;&#x6BB5;&#x786E;&#x5B9A;&#x8BE5;&#x6570;&#x636E;&#x5E27;&#x7684;&#x6709;&#x6548;&#x8F7D;&#x8377;&#xFF08;payload&#xFF0C;&#x6307;&#x9664;&#x53BB;&#x534F;&#x8BAE;&#x9996;&#x90E8;&#x4E4B;&#x5916;&#x5B9E;&#x9645;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#xFF09;&#x662F;IP&#x3001;ARP&#x8FD8;&#x662F;RARP&#x534F;&#x8BAE;&#x7684;&#x6570;&#x636E;&#x62A5;&#xFF0C;&#x7136;&#x540E;&#x4EA4;&#x7ED9;&#x76F8;&#x5E94;&#x7684;&#x534F;&#x8BAE;&#x5904;&#x7406;&#x3002;&#x5047;&#x5982;&#x662F;IP&#x6570;&#x636E;&#x62A5;&#xFF0C;IP&#x534F;&#x8BAE;&#x518D;&#x6839;&#x636E;IP&#x9996;&#x90E8;&#x4E2D;&#x7684;&#x201C;&#x4E0A;&#x5C42;&#x534F;&#x8BAE;&#x201D;&#x5B57;&#x6BB5;&#x786E;&#x5B9A;&#x8BE5;&#x6570;&#x636E;&#x62A5;&#x7684;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x662F;TCP&#x3001;UDP&#x3001;ICMP&#x8FD8;&#x662F;IGMP&#xFF0C;&#x7136;&#x540E;&#x4EA4;&#x7ED9;&#x76F8;&#x5E94;&#x7684;&#x534F;&#x8BAE;&#x5904;&#x7406;&#x3002;&#x5047;&#x5982;&#x662F;TCP&#x6BB5;&#x6216;UDP&#x6BB5;&#xFF0C;TCP&#x6216;UDP&#x534F;&#x8BAE;&#x518D;&#x6839;&#x636E;TCP&#x9996;&#x90E8;&#x6216;UDP&#x9996;&#x90E8;&#x7684;&#x201C;&#x7AEF;&#x53E3;&#x53F7;&#x201D;&#x5B57;&#x6BB5;&#x786E;&#x5B9A;&#x5E94;&#x8BE5;&#x5C06;&#x5E94;&#x7528;&#x5C42;&#x6570;&#x636E;&#x4EA4;&#x7ED9;&#x54EA;&#x4E2A;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x3002;IP&#x5730;&#x5740;&#x662F;&#x6807;&#x8BC6;&#x7F51;&#x7EDC;&#x4E2D;&#x4E0D;&#x540C;&#x4E3B;&#x673A;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x7AEF;&#x53E3;&#x53F7;&#x5C31;&#x662F;&#x540C;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x4E0A;&#x6807;&#x8BC6;&#x4E0D;&#x540C;&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#xFF0C;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x5408;&#x8D77;&#x6765;&#x6807;&#x8BC6;&#x7F51;&#x7EDC;&#x4E2D;&#x552F;&#x4E00;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</p><p>&#x6CE8;&#x610F;&#xFF0C;&#x867D;&#x7136;IP&#x3001;ARP&#x548C;RARP&#x6570;&#x636E;&#x62A5;&#x90FD;&#x9700;&#x8981;&#x4EE5;&#x592A;&#x7F51;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x6765;&#x5C01;&#x88C5;&#x6210;&#x5E27;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x529F;&#x80FD;&#x4E0A;&#x5212;&#x5206;&#xFF0C;ARP&#x548C;RARP&#x5C5E;&#x4E8E;&#x94FE;&#x8DEF;&#x5C42;&#xFF0C;IP&#x5C5E;&#x4E8E;&#x7F51;&#x7EDC;&#x5C42;&#x3002;&#x867D;&#x7136;ICMP&#x3001;IGMP&#x3001;TCP&#x3001;UDP&#x7684;&#x6570;&#x636E;&#x90FD;&#x9700;&#x8981;IP&#x534F;&#x8BAE;&#x6765;&#x5C01;&#x88C5;&#x6210;&#x6570;&#x636E;&#x62A5;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x529F;&#x80FD;&#x4E0A;&#x5212;&#x5206;&#xFF0C;ICMP&#x3001;IGMP&#x4E0E;IP&#x540C;&#x5C5E;&#x4E8E;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;TCP&#x548C;UDP&#x5C5E;&#x4E8E;&#x4F20;&#x8F93;&#x5C42;&#x3002;&#x672C;&#x6587;&#x5BF9;RARP&#x3001;ICMP&#x3001;IGMP&#x534F;&#x8BAE;&#x4E0D;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x4ECB;&#x7ECD;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x770B;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x3002;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch36.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch36.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch36s02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;36&#xA0;&#x7AE0;&#xA0;TCP/IP&#x534F;&#x8BAE;&#x57FA;&#x7840;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x4EE5;&#x592A;&#x7F51;(RFC 894)&#x5E27;&#x683C;&#x5F0F;</td></tr></tbody></table></div>
</body></html>