<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>3.&#xA0;&#x53D8;&#x91CF;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch02.html" title="&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;"><link rel="prev" href="ch02s02.html" title="2.&#xA0;&#x5E38;&#x91CF;"><link rel="next" href="ch02s04.html" title="4.&#xA0;&#x8D4B;&#x503C;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">3.&#xA0;&#x53D8;&#x91CF;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch02s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch02s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="expr.variable"></a>3.&#xA0;&#x53D8;&#x91CF;</h2></div></div></div><p>&#x53D8;&#x91CF;&#xFF08;Variable&#xFF09;<a id="id2708148" class="indexterm"></a>&#x662F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#x4E4B;&#x4E00;&#xFF0C;&#x53D8;&#x91CF;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7684;&#x4E00;&#x5757;&#x547D;&#x540D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x91CC;&#x9762;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x503C;&#xFF08;Value&#xFF09;<a id="id2708157" class="indexterm"></a>&#xFF0C;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x662F;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x53D8;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x6B21;&#x5B58;&#x4E2A;&#x5B57;&#x7B26;<code class="literal">&apos;a&apos;</code>&#x4E0B;&#x6B21;&#x5B58;&#x4E2A;&#x5B57;&#x7B26;<code class="literal">&apos;b&apos;</code>&#xFF0C;&#x6B63;&#x56E0;&#x4E3A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x53D8;&#x6240;&#x4EE5;&#x624D;&#x53EB;&#x53D8;&#x91CF;&#x3002;</p><p>&#x5E38;&#x91CF;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x53D8;&#x91CF;&#x4E5F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x6240;&#x5360;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x4F8B;&#x5982;&#x4EE5;&#x4E0B;&#x56DB;&#x4E2A;&#x8BED;&#x53E5;&#x5B9A;&#x4E49;&#x4E86;&#x56DB;&#x4E2A;&#x53D8;&#x91CF;<code class="literal">fred</code>&#x3001;<code class="literal">bob</code>&#x3001;<code class="literal">jimmy</code>&#x548C;<code class="literal">tom</code>&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x5206;&#x522B;&#x662F;&#x5B57;&#x7B26;&#x578B;&#x3001;&#x6574;&#x578B;&#x3001;&#x6D6E;&#x70B9;&#x578B;&#xFF1A;</p><pre class="programlisting">char fred;
int bob;
float jimmy;
double tom;</pre><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#x58F0;&#x660E;&#x548C;&#x5B9A;&#x4E49;</h3><p>C&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x58F0;&#x660E;&#xFF08;Declaration&#xFF09;<a id="id2708221" class="indexterm"></a>&#x6709;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x3001;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x548C;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x4E09;&#x79CD;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6216;&#x51FD;&#x6570;&#x7684;&#x58F0;&#x660E;&#x8981;&#x6C42;&#x7F16;&#x8BD1;&#x5668;&#x4E3A;&#x5B83;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x5B9A;&#x4E49;&#xFF08;Definition&#xFF09;<a id="id2708230" class="indexterm"></a>&#xFF0C;&#x56E0;&#x6B64;&#x5B9A;&#x4E49;&#x662F;&#x58F0;&#x660E;&#x7684;&#x4E00;&#x79CD;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x51E0;&#x7AE0;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x90FD;&#x662F;&#x8981;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#xFF0C;&#x56E0;&#x800C;&#x90FD;&#x662F;&#x5B9A;&#x4E49;&#xFF0C;&#x7B49;&#x5B66;&#x5230;<a class="xref" href="ch20s02.html#link.defdecl">&#x7B2C;&#xA0;2&#xA0;&#x8282; &#x201C;&#x5B9A;&#x4E49;&#x548C;&#x58F0;&#x660E;&#x201D;</a>&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x54EA;&#x4E9B;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E0D;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x56E0;&#x800C;&#x4E0D;&#x662F;&#x5B9A;&#x4E49;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x58F0;&#x660E;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x533A;&#x5206;&#x7684;&#xFF0C;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x3002;&#x4ECE;<a class="xref" href="ch07.html#struct">&#x7B2C;&#xA0;7&#xA0;&#x7AE0; <i>&#x7ED3;&#x6784;&#x4F53;</i></a>&#x5F00;&#x59CB;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#xFF0C;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x662F;&#x4E0D;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#xFF0C;&#x4F46;&#x4F3C;&#x4E4E;&#x53EB;&#x201C;<span class="quote">&#x7C7B;&#x578B;&#x5B9A;&#x4E49;</span>&#x201D;&#x542C;&#x8D77;&#x6765;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x201C;<span class="quote">&#x7C7B;&#x578B;&#x5B9A;&#x4E49;</span>&#x201D;&#x548C;&#x201C;<span class="quote">&#x7C7B;&#x578B;&#x58F0;&#x660E;</span>&#x201D;&#x8868;&#x793A;&#x76F8;&#x540C;&#x7684;&#x542B;&#x4E49;&#x3002;&#x58F0;&#x660E;&#x548C;&#x8BED;&#x53E5;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E5F;&#x662F;&#x4EE5;;&#x53F7;&#x7ED3;&#x5C3E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8BED;&#x6CD5;&#x4E0A;&#x58F0;&#x660E;&#x548C;&#x8BED;&#x53E5;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x8BED;&#x53E5;&#x53EA;&#x80FD;&#x51FA;&#x73B0;&#x5728;{}&#x62EC;&#x53F7;&#x4E2D;&#xFF0C;&#x800C;&#x58F0;&#x660E;&#x65E2;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x5728;{}&#x4E2D;&#x4E5F;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x5728;&#x6240;&#x6709;{}&#x4E4B;&#x5916;&#x3002;</p></div><p>&#x6D6E;&#x70B9;&#x578B;&#x6709;&#x4E09;&#x79CD;&#xFF0C;<code class="literal">float</code>&#x662F;&#x5355;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x578B;&#xFF0C;<code class="literal">double</code>&#x662F;&#x53CC;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x578B;&#xFF0C;<code class="literal">long double</code>&#x662F;&#x7CBE;&#x5EA6;&#x66F4;&#x9AD8;&#x7684;&#x6D6E;&#x70B9;&#x578B;&#x3002;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x548C;&#x8F6C;&#x6362;&#x89C4;&#x5219;&#x5C06;&#x5728;<a class="xref" href="ch15.html#type">&#x7B2C;&#xA0;15&#xA0;&#x7AE0; <i>&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BE6;&#x89E3;</i></a>&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF0C;&#x5728;&#x968F;&#x540E;&#x7684;&#x51E0;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;<code class="literal">double</code>&#x7C7B;&#x578B;&#xFF0C;&#x4E0A;&#x4E00;&#x8282;&#x4ECB;&#x7ECD;&#x7684;&#x5E38;&#x91CF;3.14&#x5E94;&#x8BE5;&#x770B;&#x4F5C;<code class="literal">double</code>&#x7C7B;&#x578B;&#x7684;&#x5E38;&#x91CF;&#xFF0C;<code class="literal">printf</code>&#x7684;<code class="literal">%f</code>&#x4E5F;&#x5E94;&#x8BE5;&#x770B;&#x4F5C;<code class="literal">double</code>&#x578B;&#x7684;&#x8F6C;&#x6362;&#x8BF4;&#x660E;&#x3002;&#x7ED9;&#x53D8;&#x91CF;&#x8D77;&#x540D;&#x4E0D;&#x80FD;&#x592A;&#x968F;&#x610F;&#xFF0C;&#x4E0A;&#x9762;&#x56DB;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x731C;&#x4E0D;&#x51FA;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x662F;&#x7528;&#x6765;&#x5B58;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x800C;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x8D77;&#x540D;&#x5C31;&#x5F88;&#x597D;&#xFF1A;</p><pre class="programlisting">char firstletter;
char lastletter;
int hour, minute;</pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x731C;&#x5F97;&#x5230;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x662F;&#x7528;&#x6765;&#x5B58;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5E94;&#x8BE5;&#x662F;<code class="literal">&apos;A&apos;</code>~<code class="literal">&apos;Z&apos;</code>&#x6216;<code class="literal">&apos;a&apos;</code>~<code class="literal">&apos;z&apos;</code>&#xFF0C;&#x53D8;&#x91CF;<code class="literal">hour</code>&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5E94;&#x8BE5;&#x662F;0~23&#xFF0C;&#x53D8;&#x91CF;<code class="literal">minute</code>&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5E94;&#x8BE5;&#x662F;0~59&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x7ED9;&#x53D8;&#x91CF;&#x8D77;&#x6709;&#x610F;&#x4E49;&#x7684;&#x540D;&#x5B57;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4E5F;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF08;<code class="literal">hour</code>&#x548C;<code class="literal">minute</code>&#xFF09;&#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x58F0;&#x660E;&#x3002;</p><p>&#x7ED9;&#x53D8;&#x91CF;&#x8D77;&#x540D;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x9650;&#x5236;&#xFF0C;C&#x8BED;&#x8A00;&#x89C4;&#x5B9A;&#x5FC5;&#x987B;&#x4EE5;&#x5B57;&#x6BCD;&#x6216;&#x4E0B;&#x5212;&#x7EBF;_&#xFF08;Underscore&#xFF09;<a id="id2708385" class="indexterm"></a>&#x5F00;&#x5934;&#xFF0C;&#x540E;&#x9762;&#x53EF;&#x4EE5;&#x8DDF;&#x82E5;&#x5E72;&#x4E2A;&#x5B57;&#x6BCD;&#x3001;&#x6570;&#x5B57;&#x3001;&#x4E0B;&#x5212;&#x7EBF;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x6709;&#x5176;&#x5B83;&#x5B57;&#x7B26;&#x3002;&#x4F8B;&#x5982;&#x8FD9;&#x4E9B;&#x662F;&#x5408;&#x6CD5;&#x7684;&#x53D8;&#x91CF;&#x540D;&#xFF1A;<code class="literal">Abc</code>&#x3001;<code class="literal">__abc__</code>&#x3001;<code class="literal">_123</code>&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x662F;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#x53D8;&#x91CF;&#x540D;&#xFF1A;<code class="literal">3abc</code>&#x3001;<code class="literal">ab$</code>&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x4E0D;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x8D77;&#x540D;&#x7684;&#x8BED;&#x6CD5;&#x5143;&#x7D20;&#xFF0C;&#x4F8B;&#x5982;&#x4EE5;&#x540E;&#x8981;&#x8BB2;&#x7684;&#x51FD;&#x6570;&#x540D;&#x3001;&#x5B8F;&#x5B9A;&#x4E49;&#x3001;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x540D;&#x7B49;&#xFF0C;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x8FD9;&#x4E9B;&#x7EDF;&#x79F0;&#x4E3A;&#x6807;&#x8BC6;&#x7B26;&#xFF08;Identifier&#xFF09;<a id="id2708425" class="indexterm"></a>&#x3002;</p><p>&#x53E6;&#x5916;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x8868;&#x793A;&#x7C7B;&#x578B;&#x7684;<code class="literal">char</code>&#x3001;<code class="literal">int</code>&#x3001;<code class="literal">float</code>&#x3001;<code class="literal">double</code>&#x7B49;&#x867D;&#x7136;&#x7B26;&#x5408;&#x4E0A;&#x8FF0;&#x89C4;&#x5219;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x4F5C;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x4E9B;&#x5355;&#x8BCD;&#x6709;&#x7279;&#x6B8A;&#x610F;&#x4E49;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x7528;&#x4F5C;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x8FD9;&#x4E9B;&#x5355;&#x8BCD;&#x79F0;&#x4E3A;&#x5173;&#x952E;&#x5B57;&#xFF08;Keyword&#xFF09;<a id="id2708459" class="indexterm"></a>&#x6216;&#x4FDD;&#x7559;&#x5B57;&#xFF08;Reserved Word&#xFF09;<a id="id2708469" class="indexterm"></a>&#x3002;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x7F16;&#x7A0B;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x90FD;&#x4F1A;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#xFF08;Highlight&#xFF09;<a id="id2708480" class="indexterm"></a>&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x8981;&#x5C0F;&#x5FC3;&#x4E00;&#x70B9;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x8BEF;&#x7528;&#x4F5C;&#x6807;&#x8BC6;&#x7B26;&#x3002;C99&#x89C4;&#x5B9A;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6709;&#xFF1A;</p><div class="literallayout"><p>auto&#xA0;&#xA0;break&#xA0;&#xA0;case&#xA0;&#xA0;char&#xA0;&#xA0;const&#xA0;&#xA0;continue&#xA0;&#xA0;default&#xA0;&#xA0;do&#xA0;&#xA0;double<br>
else&#xA0;&#xA0;enum&#xA0;&#xA0;extern&#xA0;&#xA0;float&#xA0;&#xA0;for&#xA0;&#xA0;goto&#xA0;&#xA0;if&#xA0;&#xA0;inline&#xA0;&#xA0;int&#xA0;&#xA0;long<br>
register&#xA0;&#xA0;restrict&#xA0;&#xA0;return&#xA0;&#xA0;short&#xA0;&#xA0;signed&#xA0;&#xA0;sizeof&#xA0;&#xA0;static&#xA0;&#xA0;struct&#xA0;&#xA0;switch&#xA0;&#xA0;typedef<br>
union&#xA0;&#xA0;unsigned&#xA0;&#xA0;void&#xA0;&#xA0;volatile&#xA0;&#xA0;while&#xA0;&#xA0;_Bool&#xA0;&#xA0;_Complex&#xA0;&#xA0;_Imaginary</p></div><p>&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#xFF0C;<span class="emphasis"><em>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x5E94;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x5212;&#x7EBF;&#x5F00;&#x5934;&#x7684;&#x6807;&#x8BC6;&#x7B26;</em></span>&#xFF0C;&#x4EE5;&#x4E0B;&#x5212;&#x7EBF;&#x5F00;&#x5934;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x53EA;&#x8981;&#x4E0D;&#x548C;C&#x8BED;&#x8A00;&#x5173;&#x952E;&#x5B57;&#x51B2;&#x7A81;&#x7684;&#x90FD;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5F80;&#x5F80;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x7528;&#x4F5C;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x6269;&#x5C55;&#xFF0C;C&#x6807;&#x51C6;&#x5E93;&#x4E5F;&#x5B9A;&#x4E49;&#x4E86;&#x5F88;&#x591A;&#x4EE5;&#x4E0B;&#x5212;&#x7EBF;&#x5F00;&#x5934;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x6240;&#x4EE5;&#x9664;&#x975E;&#x4F60;&#x5BF9;&#x7F16;&#x8BD1;&#x5668;&#x548C;C&#x6807;&#x51C6;&#x5E93;&#x7279;&#x522B;&#x6E05;&#x695A;&#xFF0C;&#x4E00;&#x822C;&#x5E94;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x4EE5;&#x514D;&#x9020;&#x6210;&#x547D;&#x540D;&#x51B2;&#x7A81;&#x3002;</p><p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF1A;<span class="emphasis"><em>&#x7406;&#x89E3;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x4E0D;&#x662F;&#x628A;&#x5B9A;&#x4E49;&#x80CC;&#x4E0B;&#x6765;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x5916;&#x5EF6;&#x548C;&#x5185;&#x6DB5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0D;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x867D;&#x7136;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x4F46;&#x4E00;&#x822C;&#x63A8;&#x8350;&#x7684;&#x505A;&#x6CD5;&#xFF08;Best Practice&#xFF09;<a id="id2708527" class="indexterm"></a>&#x662F;&#x8981;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x624D;&#x7B97;&#x662F;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x4E86;&#x3002;</em></span></p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch02s02.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch02.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch02s04.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">2.&#xA0;&#x5E38;&#x91CF;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;4.&#xA0;&#x8D4B;&#x503C;</td></tr></tbody></table></div>
</body></html>