<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>5.&#xA0;&#x8868;&#x8FBE;&#x5F0F;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch02.html" title="&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;"><link rel="prev" href="ch02s04.html" title="4.&#xA0;&#x8D4B;&#x503C;"><link rel="next" href="ch02s06.html" title="6.&#xA0;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x4E0E;&#x5B57;&#x7B26;&#x7F16;&#x7801;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">5.&#xA0;&#x8868;&#x8FBE;&#x5F0F;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch02s04.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch02s06.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="expr.expression"></a>5.&#xA0;&#x8868;&#x8FBE;&#x5F0F;</h2></div></div></div><p>&#x5E38;&#x91CF;&#x548C;&#x53D8;&#x91CF;&#x90FD;&#x53EF;&#x4EE5;&#x53C2;&#x4E0E;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x8FD0;&#x7B97;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">1+1</code>&#x3001;<code class="literal">hour-1</code>&#x3001;<code class="literal">hour * 60 + minute</code>&#x3001;<code class="literal">minute/60</code>&#x7B49;&#x3002;&#x8FD9;&#x91CC;&#x7684;+ - * /&#x79F0;&#x4E3A;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;Operator&#xFF09;<a id="id2708948" class="indexterm"></a>&#xFF0C;&#x800C;&#x53C2;&#x4E0E;&#x8FD0;&#x7B97;&#x7684;&#x5E38;&#x91CF;&#x548C;&#x53D8;&#x91CF;&#x79F0;&#x4E3A;&#x64CD;&#x4F5C;&#x6570;&#xFF08;Operand&#xFF09;<a id="id2708956" class="indexterm"></a>&#xFF0C;&#x4E0A;&#x9762;&#x56DB;&#x4E2A;&#x7531;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x7B97;&#x5F0F;&#x79F0;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;Expression&#xFF09;<a id="id2708965" class="indexterm"></a>&#x3002;</p><p>&#x548C;&#x6570;&#x5B66;&#x4E0A;&#x89C4;&#x5B9A;&#x7684;&#x4E00;&#x6837;&#xFF0C;<code class="literal">hour * 60 + minute</code>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x5E94;&#x8BE5;&#x5148;&#x7B97;&#x4E58;&#x518D;&#x7B97;&#x52A0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8FD0;&#x7B97;&#x7B26;&#x662F;&#x6709;&#x4F18;&#x5148;&#x7EA7;&#xFF08;Precedence&#xFF09;<a id="id2708982" class="indexterm"></a>&#x7684;&#xFF0C;*&#x548C;/&#x662F;&#x540C;&#x4E00;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;+&#x548C;-&#x662F;&#x540C;&#x4E00;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;*&#x548C;/&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x4E8E;+&#x548C;-&#x3002;&#x5BF9;&#x4E8E;&#x540C;&#x4E00;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8FD0;&#x7B97;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x8BA1;&#x7B97;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5E0C;&#x671B;&#x6309;&#x9ED8;&#x8BA4;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x8BA1;&#x7B97;&#x5219;&#x8981;&#x52A0;()&#x62EC;&#x53F7;&#xFF08;Parenthesis&#xFF09;<a id="id2708993" class="indexterm"></a>&#x3002;&#x4F8B;&#x5982;<code class="literal">(3+4)*5/6</code>&#x5E94;&#x5148;&#x7B97;3+4&#xFF0C;&#x518D;&#x7B97;*5&#xFF0C;&#x518D;&#x7B97;/6&#x3002;</p><p>&#x524D;&#x9762;&#x8BB2;&#x8FC7;&#x6253;&#x5370;&#x8BED;&#x53E5;&#x548C;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#xFF1A;&#x5728;&#x4EFB;&#x610F;&#x8868;&#x8FBE;&#x5F0F;&#x540E;&#x9762;&#x52A0;&#x4E2A;;&#x53F7;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x8BED;&#x53E5;&#xFF0C;&#x79F0;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x53E5;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">hour * 60 + minute;</pre><p>&#x8FD9;&#x662F;&#x4E2A;&#x5408;&#x6CD5;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x8D77;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x4F5C;&#x7528;&#xFF0C;&#x628A;hour&#x7684;&#x503C;&#x548C;minute&#x7684;&#x503C;&#x53D6;&#x51FA;&#x6765;&#x52A0;&#x4E58;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5374;&#x6CA1;&#x6709;&#x4FDD;&#x5B58;&#xFF0C;&#x767D;&#x7B97;&#x4E86;&#x4E00;&#x901A;&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF1A;</p><pre class="programlisting">int total_minute;
total_minute = hour * 60 + minute;</pre><p>&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x5C31;&#x5F88;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x628A;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4FDD;&#x5B58;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;<code class="literal">total_minute</code>&#x91CC;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x7B49;&#x53F7;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x79F0;&#x4E3A;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x53E5;&#xFF0C;&#x7B49;&#x53F7;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x6BD4;+&#x548C;*&#x90FD;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#x5148;&#x7B97;&#x51FA;&#x7B49;&#x53F7;&#x53F3;&#x8FB9;&#x7684;&#x7ED3;&#x679C;&#x7136;&#x540E;&#x624D;&#x505A;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#xFF0C;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">total_minute = hour * 60 + minute</code>&#x52A0;&#x4E2A;;&#x53F7;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x3002;</p><p><span class="emphasis"><em>&#x4EFB;&#x4F55;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x6709;&#x503C;&#x548C;&#x7C7B;&#x578B;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x5C5E;&#x6027;</em></span>&#x3002;<code class="literal">hour * 60 + minute</code>&#x7684;&#x503C;&#x662F;&#x7531;&#x4E09;&#x4E2A;<code class="literal">int</code>&#x578B;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x662F;<code class="literal">int</code>&#x578B;&#x3002;&#x540C;&#x7406;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">total_minute = hour * 60 + minute</code>&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x662F;<code class="literal">int</code>&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x662F;&#x591A;&#x5C11;&#x5462;&#xFF1F;C&#x8BED;&#x8A00;&#x89C4;&#x5B9A;&#x7B49;&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x7B49;&#x53F7;&#x5DE6;&#x8FB9;&#x88AB;&#x8D4B;&#x4E88;&#x7684;&#x90A3;&#x4E2A;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x548C;<code class="literal">hour * 60 + minute</code>&#x7684;&#x503C;&#x76F8;&#x540C;&#xFF0C;&#x4E5F;&#x548C;<code class="literal">total_minute</code>&#x7684;&#x503C;&#x76F8;&#x540C;&#x3002;</p><p>&#x7B49;&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x548C;+ - * /&#x4E0D;&#x540C;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x51FA;&#x73B0;&#x591A;&#x4E2A;&#x7B49;&#x53F7;&#xFF0C;&#x4E0D;&#x662F;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x8BA1;&#x7B97;&#x800C;&#x662F;&#x4ECE;&#x53F3;&#x5230;&#x5DE6;&#x8BA1;&#x7B97;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">int total_minute, total;
total = total_minute = hour * 60 + minute;</pre><p>&#x8BA1;&#x7B97;&#x987A;&#x5E8F;&#x662F;&#x5148;&#x7B97;<code class="literal">hour * 60 + minute</code>&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x7B97;&#x53F3;&#x8FB9;&#x7684;&#x7B49;&#x53F7;&#xFF0C;&#x5C31;&#x662F;&#x628A;<code class="literal">hour * 60 + minute</code>&#x7684;&#x7ED3;&#x679C;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;<code class="literal">total_minute</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">total_minute = hour * 60 + minute</code>&#x7684;&#x503C;&#xFF0C;&#x518D;&#x7B97;&#x5DE6;&#x8FB9;&#x7684;&#x7B49;&#x53F7;&#xFF0C;&#x5373;&#x628A;&#x8FD9;&#x4E2A;&#x503C;&#x518D;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;<code class="literal">total</code>&#x3002;&#x540C;&#x6837;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x662F;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x8BA1;&#x7B97;&#x8FD8;&#x662F;&#x4ECE;&#x53F3;&#x5230;&#x5DE6;&#x8BA1;&#x7B97;&#x79F0;&#x4E3A;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x7ED3;&#x5408;&#x6027;&#xFF08;Associativity&#xFF09;<a id="id2709138" class="indexterm"></a>&#x3002;+ - * /&#x662F;&#x5DE6;&#x7ED3;&#x5408;&#x7684;&#xFF0C;&#x7B49;&#x53F7;&#x662F;&#x53F3;&#x7ED3;&#x5408;&#x7684;&#x3002;</p><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x5B66;&#x8FC7;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#xFF1A;</p><div class="literallayout"><p>&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x6807;&#x8BC6;&#x7B26;<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x5E38;&#x91CF;<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x5B57;&#x9762;&#x503C;<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;(&#x8868;&#x8FBE;&#x5F0F;)<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x8868;&#x8FBE;&#x5F0F;&#xA0;+&#xA0;&#x8868;&#x8FBE;&#x5F0F;<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x8868;&#x8FBE;&#x5F0F;&#xA0;-&#xA0;&#x8868;&#x8FBE;&#x5F0F;<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x8868;&#x8FBE;&#x5F0F;&#xA0;*&#xA0;&#x8868;&#x8FBE;&#x5F0F;<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x8868;&#x8FBE;&#x5F0F;&#xA0;/&#xA0;&#x8868;&#x8FBE;&#x5F0F;<br>
&#x8868;&#x8FBE;&#x5F0F;&#xA0;&#x2192;&#xA0;&#x8868;&#x8FBE;&#x5F0F;&#xA0;=&#xA0;&#x8868;&#x8FBE;&#x5F0F;<br>
&#x8BED;&#x53E5;&#xA0;&#x2192;&#xA0;&#x8868;&#x8FBE;&#x5F0F;;<br>
&#x8BED;&#x53E5;&#xA0;&#x2192;&#xA0;printf(&#x8868;&#x8FBE;&#x5F0F;,&#xA0;&#x8868;&#x8FBE;&#x5F0F;,&#xA0;&#x8868;&#x8FBE;&#x5F0F;,&#xA0;...);<br>
&#x53D8;&#x91CF;&#x58F0;&#x660E;&#xA0;&#x2192;&#xA0;&#x7C7B;&#x578B;&#xA0;&#x6807;&#x8BC6;&#x7B26;&#xA0;=&#xA0;Initializer,&#xA0;&#x6807;&#x8BC6;&#x7B26;&#xA0;=&#xA0;Initializer,&#xA0;...;<br>
&#xFF08;=&#xA0;Initializer&#x7684;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x4E0D;&#x5199;&#xFF09;</p></div><p>&#x6CE8;&#x610F;&#xFF0C;<span class="emphasis"><em>&#x672C;&#x4E66;&#x6240;&#x5217;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x90FD;&#x662F;&#x7B80;&#x5316;&#x8FC7;&#x7684;&#xFF0C;&#x662F;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x7406;&#x89E3;</em></span>&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x6240;&#x5217;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x5E76;&#x6CA1;&#x6709;&#x63CF;&#x8FF0;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x548C;&#x7ED3;&#x5408;&#x6027;&#x3002;&#x5B8C;&#x6574;&#x7684;C&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x8BF7;&#x53C2;&#x8003;<a class="xref" href="bi01.html#bibli.c99" title="ISO/IEC 9899: Programming Languages &#xFF0D; C">[<abbr class="abbrev">C99</abbr>]</a>&#x7684;Annex A&#x3002;</p><p>&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x662F;&#x5355;&#x4E2A;&#x7684;&#x5E38;&#x91CF;&#x6216;&#x53D8;&#x91CF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x6839;&#x636E;&#x4EE5;&#x4E0A;&#x89C4;&#x5219;&#x7EC4;&#x5408;&#x800C;&#x6210;&#x7684;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x7528;<code class="literal">printf</code>&#x6253;&#x5370;&#x5E38;&#x91CF;&#x6216;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x7528;<code class="literal">printf</code>&#x6253;&#x5370;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">printf(&quot;%d:%d is %d minutes after 00:00\n&quot;, hour, minute, hour * 60 + minute);</pre><p>&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x7FFB;&#x8BD1;&#x8FD9;&#x6761;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x6839;&#x636E;&#x4E0A;&#x8FF0;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x628A;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x89E3;&#x6790;&#x6210;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x7684;&#x8BED;&#x6CD5;&#x6811;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6839;&#x636E;&#x8BED;&#x6CD5;&#x6811;&#x751F;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x8BED;&#x6CD5;&#x6811;&#x7684;&#x672B;&#x7AEF;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;Token&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x5C55;&#x5F00;&#x5229;&#x7528;&#x4E00;&#x6761;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x3002;</p><div class="figure"><a id="id2709228"></a><p class="title"><b>&#x56FE;&#xA0;2.2.&#xA0;&#x8BED;&#x6CD5;&#x6811;</b></p><div class="figure-contents"><div><img src="images/expr.parse.png" alt="&#x8BED;&#x6CD5;&#x6811;"></div></div></div><br class="figure-break"><p>&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x8FDB;&#x4E00;&#x6B65;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x5199;&#x51FA;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x4E2D;&#x5B8C;&#x6210;&#x8BA1;&#x7B97;&#x3001;&#x8D4B;&#x503C;&#x548C;&#x6253;&#x5370;&#x529F;&#x80FD;&#xFF1A;</p><pre class="programlisting">printf(&quot;%d:%d is %d minutes after 00:00\n&quot;, hour, minute, total_minute = hour * 60 + minute);</pre><p>&#x7406;&#x89E3;&#x7EC4;&#x5408;&#xFF08;Composition&#xFF09;<a id="id2709254" class="indexterm"></a>&#x89C4;&#x5219;&#x662F;&#x7406;&#x89E3;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x7684;&#x5173;&#x952E;&#x6240;&#x5728;&#xFF0C;&#x6B63;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x4EFB;&#x610F;&#x7EC4;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x53EF;&#x4EE5;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x3001;&#x8868;&#x8FBE;&#x5F0F;&#x3001;&#x8BED;&#x53E5;&#x642D;&#x5EFA;&#x51FA;&#x4EFB;&#x610F;&#x590D;&#x6742;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x65F6;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x4F53;&#x4F1A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x5B9C;&#x8FC7;&#x5EA6;&#x7EC4;&#x5408;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x7ED9;&#x9605;&#x8BFB;&#x548C;&#x8C03;&#x8BD5;&#x5E26;&#x6765;&#x56F0;&#x96BE;&#x3002;</p><p>&#x6839;&#x636E;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x7EC4;&#x5408;&#x51FA;&#x6765;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5728;&#x8BED;&#x4E49;&#x4E0A;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><pre class="programlisting">minute + 1 = hour;</pre><p>&#x7B49;&#x53F7;&#x5DE6;&#x8FB9;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x8981;&#x6C42;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x7B49;&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#x548C;+ - * /&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x53C8;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x4E0D;&#x540C;&#x3002;&#x6709;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x65E2;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x4E5F;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x800C;&#x6709;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x53EA;&#x80FD;&#x8868;&#x793A;&#x503C;&#xFF0C;&#x4E0D;&#x80FD;&#x8868;&#x793A;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">minute + 1</code>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x5C31;&#x4E0D;&#x80FD;&#x8868;&#x793A;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#xFF0C;&#x653E;&#x5728;&#x7B49;&#x53F7;&#x5DE6;&#x8FB9;&#x662F;&#x8BED;&#x4E49;&#x9519;&#x8BEF;&#x3002;&#x8868;&#x8FBE;&#x5F0F;&#x6240;&#x8868;&#x793A;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x79F0;&#x4E3A;&#x5DE6;&#x503C;&#xFF08;lvalue&#xFF09;<a id="id2709298" class="indexterm"></a>&#xFF08;&#x5141;&#x8BB8;&#x653E;&#x5728;&#x7B49;&#x53F7;&#x5DE6;&#x8FB9;&#xFF09;&#xFF0C;&#x800C;&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x4E5F;&#x79F0;&#x4E3A;&#x53F3;&#x503C;&#xFF08;rvalue&#xFF09;<a id="id2709307" class="indexterm"></a>&#xFF08;&#x53EA;&#x80FD;&#x653E;&#x5728;&#x7B49;&#x53F7;&#x53F3;&#x8FB9;&#xFF09;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x8BDD;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#x5C31;&#x662F;&#xFF1A;<span class="emphasis"><em>&#x6709;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x65E2;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x53F3;&#x503C;&#xFF0C;&#x800C;&#x6709;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x53EA;&#x80FD;&#x505A;&#x53F3;&#x503C;</em></span>&#x3002;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x5B66;&#x8FC7;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x53EA;&#x6709;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x8FD8;&#x6709;&#x51E0;&#x79CD;&#xFF0C;&#x4EE5;&#x540E;&#x4F1A;&#x8BB2;&#x5230;&#x3002;</p><p>&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x4E09;&#x4E2A;&#x53D8;&#x91CF;<code class="literal">int a, b, c;</code>&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">a = b = c</code>&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x5148;&#x6C42;<code class="literal">b = c</code>&#x7684;&#x503C;&#xFF0C;&#x518D;&#x628A;&#x8FD9;&#x4E2A;&#x503C;&#x8D4B;&#x7ED9;<code class="literal">a</code>&#xFF0C;&#x800C;&#x8868;&#x8FBE;&#x5F0F;<code class="literal">(a = b) = c</code>&#x662F;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x5148;&#x6C42;<code class="literal">(a = b)</code>&#x7684;&#x503C;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x4F46;<code class="literal">(a = b)</code>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x80FD;&#x518D;&#x505A;&#x5DE6;&#x503C;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x653E;&#x5728;<code class="literal">= c</code>&#x7684;&#x7B49;&#x53F7;&#x5DE6;&#x8FB9;&#x662F;&#x9519;&#x7684;&#x3002;</p><p>&#x5173;&#x4E8E;&#x6574;&#x6570;&#x9664;&#x6CD5;&#x8FD0;&#x7B97;&#x6709;&#x4E00;&#x70B9;&#x7279;&#x6B8A;&#x4E4B;&#x5904;&#xFF1A;</p><pre class="programlisting">hour = 11;
minute = 59;
printf(&quot;%d and %d hours\n&quot;, hour, minute / 60);</pre><p>&#x6267;&#x884C;&#x7ED3;&#x679C;&#x662F;<code class="literal">11 and 0 hours</code>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;59/60&#x5F97;0&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4E24;&#x4E2A;<code class="literal">int</code>&#x578B;&#x64CD;&#x4F5C;&#x6570;&#x76F8;&#x9664;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4ECD;&#x4E3A;<code class="literal">int</code>&#x578B;&#xFF0C;&#x53EA;&#x80FD;&#x4FDD;&#x5B58;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x7684;&#x6574;&#x6570;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x4F7F;&#x5C0F;&#x6570;&#x90E8;&#x5206;&#x662F;0.98&#x4E5F;&#x8981;&#x820D;&#x53BB;&#x3002;</p><p>&#x5411;&#x4E0B;&#x53D6;&#x6574;&#x7684;&#x8FD0;&#x7B97;&#x79F0;&#x4E3A;Floor<a id="id2709407" class="indexterm"></a>&#xFF0C;&#x7528;&#x6570;&#x5B66;&#x7B26;&#x53F7;&#x230A;&#x230B;&#x8868;&#x793A;&#xFF1B;&#x5411;&#x4E0A;&#x53D6;&#x6574;&#x7684;&#x8FD0;&#x7B97;&#x79F0;&#x4E3A;Ceiling<a id="id2709422" class="indexterm"></a>&#xFF0C;&#x7528;&#x6570;&#x5B66;&#x7B26;&#x53F7;&#x2308;&#x2309;&#x8868;&#x793A;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p><div class="literallayout"><p>&#x230A;59/60&#x230B;=0<br>
&#x2308;59/60&#x2309;=1<br>
&#x230A;-59/60&#x230B;=-1<br>
&#x2308;-59/60&#x2309;=0</p></div><p>&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x6574;&#x6570;&#x9664;&#x6CD5;&#x53D6;&#x7684;&#x65E2;&#x4E0D;&#x662F;Floor&#x4E5F;&#x4E0D;&#x662F;Ceiling&#xFF0C;&#x65E0;&#x8BBA;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x6B63;&#x662F;&#x8D1F;&#x603B;&#x662F;&#x628A;&#x5C0F;&#x6570;&#x90E8;&#x5206;&#x622A;&#x6389;&#xFF0C;&#x5728;&#x6570;&#x8F74;&#x4E0A;&#x5411;&#x96F6;&#x7684;&#x65B9;&#x5411;&#x53D6;&#x6574;&#xFF08;Truncate toward Zero&#xFF09;<a id="id2709441" class="indexterm"></a>&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5F53;&#x64CD;&#x4F5C;&#x6570;&#x4E3A;&#x6B63;&#x7684;&#x65F6;&#x5019;&#x76F8;&#x5F53;&#x4E8E;Floor&#xFF0C;&#x5F53;&#x64CD;&#x4F5C;&#x7B26;&#x4E3A;&#x8D1F;&#x7684;&#x65F6;&#x5019;&#x76F8;&#x5F53;&#x4E8E;Ceiling&#x3002;&#x56DE;&#x5230;&#x5148;&#x524D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8981;&#x5F97;&#x5230;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#xFF1A;</p><pre class="programlisting">printf(&quot;%d hours and %d percent of an hour\n&quot;, hour, minute * 100 / 60);
printf(&quot;%d and %f hours\n&quot;, hour, minute / 60.0);</pre><p>&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;<code class="literal">printf</code>&#x4E2D;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x662F;<code class="literal">minute / 60.0</code>&#xFF0C;60.0&#x662F;<code class="literal">double</code>&#x578B;&#x7684;&#xFF0C;/&#x8FD0;&#x7B97;&#x7B26;&#x8981;&#x6C42;&#x5DE6;&#x53F3;&#x4E24;&#x8FB9;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x7C7B;&#x578B;&#x4E00;&#x81F4;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x5E76;&#x4E0D;&#x4E00;&#x81F4;&#x3002;C&#x8BED;&#x8A00;&#x89C4;&#x5B9A;&#x4E86;&#x4E00;&#x5957;&#x9690;&#x5F0F;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x89C4;&#x5219;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x628A;&#x5DE6;&#x8FB9;&#x7684;<code class="literal">minute</code>&#x4E5F;&#x8F6C;&#x6210;<code class="literal">double</code>&#x578B;&#x6765;&#x8BA1;&#x7B97;&#xFF0C;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x4E5F;&#x662F;<code class="literal">double</code>&#x578B;&#x7684;&#xFF0C;&#x5728;&#x683C;&#x5F0F;&#x5316;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x5E94;&#x8BE5;&#x7528;<code class="literal">%f</code>&#x8F6C;&#x6362;&#x8BF4;&#x660E;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x3002;&#x672C;&#x6765;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x8981;&#x6C42;&#x6709;&#x7B80;&#x5355;&#x800C;&#x4E25;&#x683C;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x81EA;&#x52A8;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x89C4;&#x5219;&#x4E0D;&#x4EC5;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;C&#x8BED;&#x8A00;&#x7684;&#x5F62;&#x5F0F;&#x770B;&#x8D77;&#x6765;&#x4E5F;&#x4E0D;&#x90A3;&#x4E48;&#x4E25;&#x683C;&#x4E86;&#xFF0C;C&#x8BED;&#x8A00;&#x8FD9;&#x4E48;&#x8BBE;&#x8BA1;&#x662F;&#x4E3A;&#x4E86;&#x4E66;&#x5199;&#x7A0B;&#x5E8F;&#x7B80;&#x4FBF;&#x800C;&#x505A;&#x7684;&#x6298;&#x8877;&#xFF0C;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x505A;&#x597D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5C31;&#x4E0D;&#x5FC5;&#x6BCF;&#x6B21;&#x90FD;&#x5199;&#x4E00;&#x5806;&#x7E41;&#x7410;&#x7684;&#x8F6C;&#x6362;&#x4EE3;&#x7801;&#x3002;&#x7136;&#x800C;C&#x8BED;&#x8A00;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x89C4;&#x5219;&#x975E;&#x5E38;&#x96BE;&#x638C;&#x63E1;&#xFF0C;&#x672C;&#x4E66;&#x7684;&#x524D;&#x51E0;&#x7AE0;&#x4F1A;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#xFF0C;&#x5230;<a class="xref" href="ch15s03.html#type.conversion">&#x7B2C;&#xA0;3&#xA0;&#x8282; &#x201C;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x201D;</a>&#x518D;&#x96C6;&#x4E2D;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2709526"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x5047;&#x8BBE;&#x53D8;&#x91CF;<code class="literal">x</code>&#x548C;<code class="literal">n</code>&#x662F;&#x4E24;&#x4E2A;&#x6B63;&#x6574;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;<code class="literal">x/n</code>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7ED3;&#x679C;&#x8981;&#x53D6;Floor&#xFF0C;&#x4F8B;&#x5982;<code class="literal">x</code>&#x662F;17&#xFF0C;<code class="literal">n</code>&#x662F;4&#xFF0C;&#x5219;&#x7ED3;&#x679C;&#x662F;4&#x3002;&#x5982;&#x679C;&#x5E0C;&#x671B;&#x7ED3;&#x679C;&#x53D6;Ceiling&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5199;&#x8868;&#x8FBE;&#x5F0F;&#x5462;&#xFF1F;&#x4F8B;&#x5982;<code class="literal">x</code>&#x662F;17&#xFF0C;<code class="literal">n</code>&#x662F;4&#xFF0C;&#x5219;&#x7ED3;&#x679C;&#x662F;5&#xFF1B;<code class="literal">x</code>&#x662F;16&#xFF0C;<code class="literal">n</code>&#x662F;4&#xFF0C;&#x5219;&#x7ED3;&#x679C;&#x662F;4&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch02s04.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch02.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch02s06.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">4.&#xA0;&#x8D4B;&#x503C;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;6.&#xA0;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x4E0E;&#x5B57;&#x7B26;&#x7F16;&#x7801;</td></tr></tbody></table></div>
</body></html>