<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>2.&#xA0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x548C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch01.html" title="&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;"><link rel="prev" href="intro.program.html" title="1.&#xA0;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;"><link rel="next" href="ch01s03.html" title="3.&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">2.&#xA0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x548C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="intro.program.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch01s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="intro.naturalformal"></a>2.&#xA0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x548C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;</h2></div></div></div><p>&#x81EA;&#x7136;&#x8BED;&#x8A00;&#xFF08;Natural Language&#xFF09;<a id="id2704618" class="indexterm"></a>&#x5C31;&#x662F;&#x4EBA;&#x7C7B;&#x8BB2;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x6BD4;&#x5982;&#x6C49;&#x8BED;&#x3001;&#x82F1;&#x8BED;&#x548C;&#x6CD5;&#x8BED;&#x3002;&#x8FD9;&#x7C7B;&#x8BED;&#x8A00;&#x4E0D;&#x662F;&#x4EBA;&#x4E3A;&#x8BBE;&#x8BA1;&#xFF08;&#x867D;&#x7136;&#x6709;&#x4EBA;&#x8BD5;&#x56FE;&#x5F3A;&#x52A0;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#xFF09;&#x800C;&#x662F;&#x81EA;&#x7136;&#x8FDB;&#x5316;&#x7684;&#x3002;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#xFF08;Formal Language&#xFF09;<a id="id2704629" class="indexterm"></a>&#x662F;&#x4E3A;&#x4E86;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x800C;&#x4EBA;&#x4E3A;&#x8BBE;&#x8BA1;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x4F8B;&#x5982;&#x6570;&#x5B66;&#x5BB6;&#x7528;&#x7684;&#x6570;&#x5B57;&#x548C;&#x8FD0;&#x7B97;&#x7B26;&#x53F7;&#x3001;&#x5316;&#x5B66;&#x5BB6;&#x7528;&#x7684;&#x5206;&#x5B50;&#x5F0F;&#x7B49;&#x3002;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#xFF0C;&#x662F;&#x4E13;&#x95E8;&#x8BBE;&#x8BA1;&#x7528;&#x6765;&#x8868;&#x8FBE;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x7684;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x3002;</p><p>&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x6709;&#x4E25;&#x683C;&#x7684;&#x8BED;&#x6CD5;&#xFF08;Syntax&#xFF09;<a id="id2704644" class="indexterm"></a>&#x89C4;&#x5219;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;3+3=6&#x662F;&#x4E00;&#x4E2A;&#x8BED;&#x6CD5;&#x6B63;&#x786E;&#x7684;&#x6570;&#x5B66;&#x7B49;&#x5F0F;&#xFF0C;&#x800C;3=+6$&#x5219;&#x4E0D;&#x662F;&#xFF0C;H<sub>2</sub>O&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x5206;&#x5B50;&#x5F0F;&#xFF0C;&#x800C;<sub>2</sub>Zz&#x5219;&#x4E0D;&#x662F;&#x3002;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x662F;&#x7531;&#x7B26;&#x53F7;&#xFF08;Token&#xFF09;<a id="id2704662" class="indexterm"></a>&#x548C;&#x7ED3;&#x6784;&#xFF08;Structure&#xFF09;<a id="id2704668" class="indexterm"></a>&#x7684;&#x89C4;&#x5219;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x3002;Token&#x7684;&#x6982;&#x5FF5;&#x76F8;&#x5F53;&#x4E8E;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5355;&#x8BCD;&#x548C;&#x6807;&#x70B9;&#x3001;&#x6570;&#x5B66;&#x5F0F;&#x4E2D;&#x7684;&#x6570;&#x548C;&#x8FD0;&#x7B97;&#x7B26;&#x3001;&#x5316;&#x5B66;&#x5206;&#x5B50;&#x5F0F;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x540D;&#x548C;&#x6570;&#x5B57;&#xFF0C;&#x4F8B;&#x5982;3=+6$&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x5728;&#x4E8E;$&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x6CD5;&#x7684;&#x6570;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x800C;<sub>2</sub>Zz&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x5728;&#x4E8E;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x5143;&#x7D20;&#x7684;&#x7F29;&#x5199;&#x662F;Zz&#x3002;&#x7ED3;&#x6784;&#x662F;&#x6307;Token&#x7684;&#x6392;&#x5217;&#x65B9;&#x5F0F;&#xFF0C;3=+6$&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x867D;&#x7136;&#x52A0;&#x53F7;&#x548C;&#x7B49;&#x53F7;&#x90FD;&#x662F;&#x5408;&#x6CD5;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x5728;&#x7B49;&#x53F7;&#x4E4B;&#x540E;&#x7D27;&#x8DDF;&#x52A0;&#x53F7;&#xFF0C;&#x800C;<sub>2</sub>Zz&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x5206;&#x5B50;&#x5F0F;&#x4E2D;&#x5FC5;&#x987B;&#x628A;&#x4E0B;&#x6807;&#x5199;&#x5728;&#x5316;&#x5B66;&#x5143;&#x7D20;&#x540D;&#x79F0;&#x4E4B;&#x540E;&#x800C;&#x4E0D;&#x662F;&#x524D;&#x9762;&#x3002;&#x5173;&#x4E8E;Token&#x7684;&#x89C4;&#x5219;&#x79F0;&#x4E3A;&#x8BCD;&#x6CD5;&#xFF08;Lexical&#xFF09;<a id="id2704698" class="indexterm"></a>&#x89C4;&#x5219;&#xFF0C;&#x800C;&#x5173;&#x4E8E;&#x7ED3;&#x6784;&#x7684;&#x89C4;&#x5219;&#x79F0;&#x4E3A;&#x8BED;&#x6CD5;&#xFF08;Grammar&#xFF09;<a id="id2704706" class="indexterm"></a>&#x89C4;&#x5219;<sup>[<a id="id2704713" href="#ftn.id2704713" class="footnote">1</a>]</sup>&#x3002;</p><p>&#x5F53;&#x9605;&#x8BFB;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7684;&#x53E5;&#x5B50;&#x6216;&#x8005;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x8981;&#x641E;&#x6E05;&#x695A;&#x6BCF;&#x4E2A;&#x8BCD;&#xFF08;Token&#xFF09;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x800C;&#x4E14;&#x5FC5;&#x987B;&#x641E;&#x6E05;&#x695A;&#x6574;&#x4E2A;&#x53E5;&#x5B50;&#x7684;&#x7ED3;&#x6784;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF08;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x4E2D;&#x4F60;&#x53EA;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x8BFB;&#x5916;&#x8BED;&#x65F6;&#x4F60;&#x80AF;&#x5B9A;&#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x5206;&#x6790;&#x53E5;&#x5B50;&#x7ED3;&#x6784;&#x7684;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x89E3;&#x6790;&#xFF08;Parse&#xFF09;<a id="id2704753" class="indexterm"></a>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x4F60;&#x542C;&#x5230;&#x201C;<span class="quote">The other shoe fell.</span>&#x201D;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x65F6;&#xFF0C;&#x4F60;&#x7406;&#x89E3;the other shoe&#x662F;&#x4E3B;&#x8BED;&#x800C;fell&#x662F;&#x8C13;&#x8BED;&#x52A8;&#x8BCD;&#xFF0C;&#x4E00;&#x65E6;&#x89E3;&#x6790;&#x5B8C;&#x6210;&#xFF0C;&#x4F60;&#x5C31;&#x641E;&#x61C2;&#x4E86;&#x53E5;&#x5B50;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5982;&#x679C;&#x77E5;&#x9053;shoe&#x662F;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;fall&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD9;&#x53E5;&#x8BDD;&#x662F;&#x5728;&#x4EC0;&#x4E48;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;Context&#xFF09;<a id="id2704767" class="indexterm"></a>&#x4E2D;&#x8BF4;&#x7684;&#xFF0C;&#x4F60;&#x8FD8;&#x80FD;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x4E3B;&#x8981;&#x6697;&#x793A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x5C5E;&#x4E8E;&#x8BED;&#x4E49;&#xFF08;Semantic&#xFF09;<a id="id2704776" class="indexterm"></a>&#x7684;&#x8303;&#x7574;&#x3002;</p><p>&#x867D;&#x7136;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x6709;&#x5F88;&#x591A;&#x5171;&#x540C;&#x4E4B;&#x5904;&#xFF0C;&#x5305;&#x62EC;Token&#x3001;&#x7ED3;&#x6784;&#x548C;&#x8BED;&#x4E49;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x5730;&#x65B9;&#x3002;</p><div class="variablelist"><dl><dt><span class="term">&#x6B67;&#x4E49;&#x6027;&#xFF08;Ambiguity&#xFF09;<a id="id2704796" class="indexterm"></a></span></dt><dd><p>&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5145;&#x6EE1;&#x6B67;&#x4E49;&#xFF0C;&#x4EBA;&#x4EEC;&#x901A;&#x8FC7;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x7EBF;&#x7D22;&#x548C;&#x81EA;&#x5DF1;&#x7684;&#x5E38;&#x8BC6;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#x662F;&#x6E05;&#x6670;&#x7684;&#x3001;&#x6BEB;&#x65E0;&#x6B67;&#x4E49;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x4E2A;&#x8BED;&#x53E5;&#x90FD;&#x5FC5;&#x987B;&#x6709;&#x786E;&#x5207;&#x7684;&#x542B;&#x4E49;&#x800C;&#x4E0D;&#x7BA1;&#x4E0A;&#x4E0B;&#x6587;&#x5982;&#x4F55;&#x3002;</p></dd><dt><span class="term">&#x5197;&#x4F59;&#x6027;&#xFF08;Redundancy&#xFF09;<a id="id2704816" class="indexterm"></a></span></dt><dd><p>&#x4E3A;&#x4E86;&#x6D88;&#x9664;&#x6B67;&#x4E49;&#x51CF;&#x5C11;&#x8BEF;&#x89E3;&#xFF0C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5F15;&#x5165;&#x4E86;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x5197;&#x4F59;&#x3002;&#x7ED3;&#x679C;&#x662F;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7ECF;&#x5E38;&#x8BF4;&#x5F97;&#x5570;&#x91CC;&#x5570;&#x55E6;&#xFF0C;&#x800C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x5219;&#x66F4;&#x52A0;&#x7D27;&#x51D1;&#xFF0C;&#x6781;&#x5C11;&#x6709;&#x5197;&#x4F59;&#x3002;</p></dd><dt><span class="term">&#x4E0E;&#x5B57;&#x9762;&#x610F;&#x601D;&#x7684;&#x4E00;&#x81F4;&#x6027;</span></dt><dd><p>&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5145;&#x65A5;&#x7740;&#x6210;&#x8BED;&#x548C;&#x9690;&#x55BB;&#xFF08;Metaphor&#xFF09;<a id="id2704841" class="indexterm"></a>&#xFF0C;&#x6211;&#x5728;&#x67D0;&#x79CD;&#x573A;&#x5408;&#x4E0B;&#x8BF4;&#x201C;<span class="quote">The other shoe fell</span>&#x201D;&#xFF0C;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x8C01;&#x7684;&#x978B;&#x6389;&#x4E86;&#x3002;&#x800C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x4E2D;&#x5B57;&#x9762;&#xFF08;Literal&#xFF09;<a id="id2704853" class="indexterm"></a>&#x610F;&#x601D;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x771F;&#x5B9E;&#x610F;&#x601D;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x4F8B;&#x5916;&#xFF0C;&#x4F8B;&#x5982;&#x4E0B;&#x4E00;&#x7AE0;&#x8981;&#x8BB2;&#x7684;C&#x8BED;&#x8A00;&#x8F6C;&#x4E49;&#x5E8F;&#x5217;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x6709;&#x4F8B;&#x5916;&#x4E5F;&#x4F1A;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x54EA;&#x4E9B;&#x5B57;&#x9762;&#x610F;&#x601D;&#x4E0D;&#x662F;&#x771F;&#x5B9E;&#x610F;&#x601D;&#xFF0C;&#x5B83;&#x4EEC;&#x6240;&#x8868;&#x793A;&#x7684;&#x771F;&#x5B9E;&#x610F;&#x601D;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p></dd></dl></div><p>&#x8BF4;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x957F;&#x5927;&#x7684;&#x4EBA;&#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#x6CA1;&#x6709;&#x4EBA;&#x4F8B;&#x5916;&#xFF09;&#xFF0C;&#x5F80;&#x5F80;&#x6709;&#x4E00;&#x4E2A;&#x9002;&#x5E94;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x7684;&#x56F0;&#x96BE;&#x8FC7;&#x7A0B;&#x3002;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x540C;&#x6B63;&#x50CF;&#x8BD7;&#x6B4C;&#x548C;&#x8BF4;&#x660E;&#x6587;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x524D;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x6BD4;&#x540E;&#x8005;&#x66F4;&#x660E;&#x663E;&#xFF1A;</p><div class="variablelist"><dl><dt><span class="term">&#x8BD7;&#x6B4C;</span></dt><dd><p>&#x8BCD;&#x8BED;&#x7684;&#x53D1;&#x97F3;&#x548C;&#x610F;&#x601D;&#x4E00;&#x6837;&#x91CD;&#x8981;&#xFF0C;&#x5168;&#x8BD7;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x521B;&#x9020;&#x51FA;&#x4E00;&#x79CD;&#x6548;&#x679C;&#x6216;&#x8005;&#x8868;&#x8FBE;&#x4E00;&#x79CD;&#x611F;&#x60C5;&#x3002;&#x6B67;&#x4E49;&#x548C;&#x975E;&#x5B57;&#x9762;&#x610F;&#x601D;&#x4E0D;&#x4EC5;&#x662F;&#x5E38;&#x89C1;&#x7684;&#x800C;&#x4E14;&#x662F;&#x523B;&#x610F;&#x4F7F;&#x7528;&#x7684;&#x3002;</p></dd><dt><span class="term">&#x8BF4;&#x660E;&#x6587;</span></dt><dd><p>&#x8BCD;&#x8BED;&#x7684;&#x5B57;&#x9762;&#x610F;&#x601D;&#x663E;&#x5F97;&#x66F4;&#x91CD;&#x8981;&#xFF0C;&#x5E76;&#x4E14;&#x7ED3;&#x6784;&#x80FD;&#x4F20;&#x8FBE;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8BD7;&#x6B4C;&#x53EA;&#x80FD;&#x770B;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x800C;&#x8BF4;&#x660E;&#x6587;&#x66F4;&#x9002;&#x5408;&#x9010;&#x5B57;&#x53E5;&#x5206;&#x6790;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x5145;&#x6EE1;&#x6B67;&#x4E49;&#x3002;</p></dd><dt><span class="term">&#x7A0B;&#x5E8F;</span></dt><dd><p>&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x662F;&#x6BEB;&#x65E0;&#x6B67;&#x4E49;&#x7684;&#xFF0C;&#x5B57;&#x9762;&#x548C;&#x672C;&#x610F;&#x9AD8;&#x5EA6;&#x4E00;&#x81F4;&#xFF0C;&#x80FD;&#x591F;&#x5B8C;&#x5168;&#x901A;&#x8FC7;&#x5BF9;Token&#x548C;&#x7ED3;&#x6784;&#x7684;&#x5206;&#x6790;&#x52A0;&#x4EE5;&#x7406;&#x89E3;&#x3002;</p></dd></dl></div><p>&#x73B0;&#x5728;&#x7ED9;&#x51FA;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x9605;&#x8BFB;&#x7A0B;&#x5E8F;&#xFF08;&#x5305;&#x62EC;&#x5176;&#x5B83;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#xFF09;&#x7684;&#x5EFA;&#x8BAE;&#x3002;&#x9996;&#x5148;&#x8BF7;&#x8BB0;&#x4F4F;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x8FDC;&#x6BD4;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7D27;&#x51D1;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x591A;&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x6765;&#x8BFB;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x7ED3;&#x6784;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x8BFB;&#x5F80;&#x5F80;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x529E;&#x6CD5;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x5B66;&#x4F1A;&#x5728;&#x5927;&#x8111;&#x91CC;&#x89E3;&#x6790;&#xFF1A;&#x8BC6;&#x522B;Token&#xFF0C;&#x5206;&#x89E3;&#x7ED3;&#x6784;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x7EC6;&#x8282;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8BF8;&#x5982;&#x62FC;&#x5199;&#x9519;&#x8BEF;&#x548C;&#x6807;&#x70B9;&#x9519;&#x8BEF;&#x8FD9;&#x4E9B;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x4E2D;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x7684;&#x5C0F;&#x6BDB;&#x75C5;&#x4F1A;&#x628A;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;&#x641E;&#x5F97;&#x9762;&#x76EE;&#x5168;&#x975E;&#x3002;</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.id2704713" href="#id2704713" class="para">1</a>] </sup>&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;Syntax&#x548C;Grammar&#x901A;&#x5E38;&#x90FD;&#x7FFB;&#x8BD1;&#x6210;&#x201C;<span class="quote">&#x8BED;&#x6CD5;</span>&#x201D;&#xFF0C;&#x8FD9;&#x8BA9;&#x521D;&#x5B66;&#x8005;&#x975E;&#x5E38;&#x6DF7;&#x4E71;&#xFF0C;Syntax&#x7684;&#x542B;&#x4E49;&#x5176;&#x5B9E;&#x5305;&#x542B;&#x4E86;Lexical&#x548C;Grammar&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x8FD8;&#x5305;&#x542B;&#x4E00;&#x90E8;&#x5206;&#x8BED;&#x4E49;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4F8B;&#x5982;&#x5728;C&#x7A0B;&#x5E8F;&#x4E2D;&#x53D8;&#x91CF;&#x5E94;&#x5148;&#x58F0;&#x660E;&#x540E;&#x4F7F;&#x7528;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x82F1;&#x6587;&#x7684;&#x6587;&#x732E;&#x4E2D;Syntax&#x548C;Grammar&#x4E5F;&#x5E38;&#x6DF7;&#x7528;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x6587;&#x732E;&#x4E2D;Syntax&#x7684;&#x542B;&#x4E49;&#x4E0D;&#x5305;&#x62EC;Lexical&#x89C4;&#x5219;&#xFF0C;&#x53EA;&#x8981;&#x6CE8;&#x610F;&#x4E0A;&#x4E0B;&#x6587;&#x5C31;&#x4E0D;&#x4F1A;&#x8BEF;&#x89E3;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x672C;&#x4E66;&#x5728;&#x7FFB;&#x8BD1;&#x5BB9;&#x6613;&#x5F15;&#x8D77;&#x6DF7;&#x6DC6;&#x7684;&#x65F6;&#x5019;&#x901A;&#x5E38;&#x76F4;&#x63A5;&#x7528;&#x82F1;&#x6587;&#x540D;&#x79F0;&#xFF0C;&#x4F8B;&#x5982;Token&#x6CA1;&#x6709;&#x5341;&#x5206;&#x597D;&#x7684;&#x7FFB;&#x8BD1;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x82F1;&#x6587;&#x540D;&#x79F0;&#x3002;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="intro.program.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch01s03.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">1.&#xA0;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;3.&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;</td></tr></tbody></table></div>
</body></html>