<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>1.&#xA0;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch01.html" title="&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;"><link rel="prev" href="ch01.html" title="&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;"><link rel="next" href="intro.naturalformal.html" title="2.&#xA0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x548C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.&#xA0;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="intro.naturalformal.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="intro.program"></a>1.&#xA0;&#x7A0B;&#x5E8F;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</h2></div></div></div><p>&#x7A0B;&#x5E8F;&#xFF08;Program&#xFF09;<a id="id2655709" class="indexterm"></a>&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#x5E94;&#x5982;&#x4F55;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x662F;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#xFF0C;&#x6BD4;&#x5982;&#x89E3;&#x65B9;&#x7A0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x7B26;&#x53F7;&#x8FD0;&#x7B97;&#xFF0C;&#x6BD4;&#x5982;&#x67E5;&#x627E;&#x548C;&#x66FF;&#x6362;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5355;&#x8BCD;&#x3002;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x8BF4;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x7531;&#x6570;&#x5B57;&#x7535;&#x8DEF;&#x7EC4;&#x6210;&#x7684;&#x8FD0;&#x7B97;&#x673A;&#x5668;&#xFF0C;&#x53EA;&#x80FD;&#x5BF9;&#x6570;&#x5B57;&#x505A;&#x8FD0;&#x7B97;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x505A;&#x7B26;&#x53F7;&#x8FD0;&#x7B97;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x7B26;&#x53F7;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#x4E5F;&#x662F;&#x7528;&#x6570;&#x5B57;&#x8868;&#x793A;&#x7684;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7A0B;&#x5E8F;&#x8FD8;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x58F0;&#x97F3;&#x548C;&#x56FE;&#x50CF;&#xFF0C;&#x58F0;&#x97F3;&#x548C;&#x56FE;&#x50CF;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#x5FC5;&#x7136;&#x4E5F;&#x662F;&#x7528;&#x6570;&#x5B57;&#x8868;&#x793A;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x7ECF;&#x8FC7;&#x4E13;&#x95E8;&#x7684;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x8F6C;&#x6362;&#x6210;&#x4EBA;&#x53EF;&#x4EE5;&#x542C;&#x5230;&#x3001;&#x770B;&#x5230;&#x7684;&#x58F0;&#x97F3;&#x548C;&#x56FE;&#x50CF;&#x3002;</p><p>&#x7A0B;&#x5E8F;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x6307;&#x4EE4;&#xFF08;Instruction&#xFF09;<a id="id2655719" class="indexterm"></a>&#x7EC4;&#x6210;&#xFF0C;&#x6307;&#x4EE4;&#x662F;&#x6307;&#x793A;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x67D0;&#x79CD;&#x8FD0;&#x7B97;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x51E0;&#x7C7B;&#xFF1A;</p><div class="variablelist"><dl><dt><span class="term">&#x8F93;&#x5165;&#xFF08;Input&#xFF09;<a id="id2655663" class="indexterm"></a></span></dt><dd><p>&#x4ECE;&#x952E;&#x76D8;&#x3001;&#x6587;&#x4EF6;&#x6216;&#x8005;&#x5176;&#x5B83;&#x8BBE;&#x5907;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x3002;</p></dd><dt><span class="term">&#x8F93;&#x51FA;&#xFF08;Output&#xFF09;<a id="id2703792" class="indexterm"></a></span></dt><dd><p>&#x628A;&#x6570;&#x636E;&#x663E;&#x793A;&#x5230;&#x5C4F;&#x5E55;&#xFF0C;&#x6216;&#x8005;&#x5B58;&#x5165;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x53D1;&#x9001;&#x5230;&#x5176;&#x5B83;&#x8BBE;&#x5907;&#x3002;</p></dd><dt><span class="term">&#x57FA;&#x672C;&#x8FD0;&#x7B97;</span></dt><dd><p>&#x6267;&#x884C;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#xFF08;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#xFF09;&#x548C;&#x6570;&#x636E;&#x5B58;&#x53D6;&#x3002;</p></dd><dt><span class="term">&#x6D4B;&#x8BD5;&#x548C;&#x5206;&#x652F;</span></dt><dd><p>&#x6D4B;&#x8BD5;&#x67D0;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x540E;&#x7EED;&#x6307;&#x4EE4;&#x3002;</p></dd><dt><span class="term">&#x5FAA;&#x73AF;</span></dt><dd><p>&#x91CD;&#x590D;&#x6267;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x3002;</p></dd></dl></div><p>&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x4E0A;&#x9762;&#x8FD9;&#x51E0;&#x7C7B;&#x6307;&#x4EE4;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x4F60;&#x66FE;&#x7528;&#x8FC7;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x6709;&#x591A;&#x4E48;&#x590D;&#x6742;&#xFF0C;&#x90FD;&#x662F;&#x7531;&#x8FD9;&#x51E0;&#x7C7B;&#x6307;&#x4EE4;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x7A0B;&#x5E8F;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x6307;&#x4EE4;&#x5374;&#x53EA;&#x6709;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x51E0;&#x79CD;&#xFF0C;&#x8FD9;&#x4E2D;&#x95F4;&#x5DE8;&#x5927;&#x7684;&#x843D;&#x5DEE;&#x5C31;&#x8981;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x53BB;&#x586B;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x7406;&#x5E94;&#x662F;&#x4E00;&#x4EF6;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x5DE5;&#x4F5C;&#x3002;<span class="emphasis"><em>&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8BF4;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF1A;&#x628A;&#x590D;&#x6742;&#x7684;&#x4EFB;&#x52A1;&#x5206;&#x89E3;&#x6210;&#x5B50;&#x4EFB;&#x52A1;&#xFF0C;&#x628A;&#x5B50;&#x4EFB;&#x52A1;&#x518D;&#x5206;&#x89E3;&#x6210;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5C42;&#x5C42;&#x5206;&#x89E3;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x7B80;&#x5355;&#x5F97;&#x53EF;&#x4EE5;&#x7528;&#x4EE5;&#x4E0A;&#x6307;&#x4EE4;&#x6765;&#x5B8C;&#x6210;&#x3002;</em></span></p><p>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;Programming Language&#xFF09;<a id="id2703866" class="indexterm"></a>&#x5206;&#x4E3A;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#xFF08;Low-level Language&#xFF09;<a id="id2703874" class="indexterm"></a>&#x548C;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#xFF08;High-level Language&#xFF09;<a id="id2703882" class="indexterm"></a>&#x3002;&#x673A;&#x5668;&#x8BED;&#x8A00;&#xFF08;Machine Language&#xFF09;<a id="id2703891" class="indexterm"></a>&#x548C;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#xFF08;Assembly Language&#xFF09;<a id="id2703899" class="indexterm"></a>&#x5C5E;&#x4E8E;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x6307;&#x4EE4;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x3002;&#x800C;C&#x3001;C++&#x3001;Java&#x3001;Python&#x7B49;&#x5C5E;&#x4E8E;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#xFF0C;&#x7528;&#x8BED;&#x53E5;&#xFF08;Statement&#xFF09;<a id="id2703909" class="indexterm"></a>&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BED;&#x53E5;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x6307;&#x4EE4;&#x7684;&#x62BD;&#x8C61;&#x8868;&#x793A;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x540C;&#x6837;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x7528;C&#x8BED;&#x8A00;&#x3001;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x548C;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x5206;&#x522B;&#x8868;&#x793A;&#x5982;&#x4E0B;&#xFF1A;</p><div class="table"><a id="id2703919"></a><p class="title"><b>&#x8868;&#xA0;1.1.&#xA0;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x4E09;&#x79CD;&#x8868;&#x793A;</b></p><div class="table-contents"><table summary="&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x4E09;&#x79CD;&#x8868;&#x793A;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</th><th>&#x8868;&#x793A;&#x5F62;&#x5F0F;</th></tr></thead><tbody><tr><td>C&#x8BED;&#x8A00;</td><td>a=b+1;</td></tr><tr><td>&#x6C47;&#x7F16;&#x8BED;&#x8A00;</td><td><div class="literallayout"><p>mov&#xA0;&#xA0;&#xA0;&#xA0;0x804a01c,%eax<br>
add&#xA0;&#xA0;&#xA0;&#xA0;$0x1,%eax<br>
mov&#xA0;&#xA0;&#xA0;&#xA0;%eax,0x804a018</p></div></td></tr><tr><td>&#x673A;&#x5668;&#x8BED;&#x8A00;</td><td><div class="literallayout"><p>a1&#xA0;1c&#xA0;a0&#xA0;04&#xA0;08<br>
83&#xA0;c0&#xA0;01<br>
a3&#xA0;18&#xA0;a0&#xA0;04&#xA0;08</p></div></td></tr></tbody></table></div></div><br class="table-break"><p>&#x8BA1;&#x7B97;&#x673A;&#x53EA;&#x80FD;&#x5BF9;&#x6570;&#x5B57;&#x505A;&#x8FD0;&#x7B97;&#xFF0C;&#x7B26;&#x53F7;&#x3001;&#x58F0;&#x97F3;&#x3001;&#x56FE;&#x50CF;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#x90FD;&#x8981;&#x7528;&#x6570;&#x5B57;&#x8868;&#x793A;&#xFF0C;&#x6307;&#x4EE4;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#xFF0C;&#x4E0A;&#x8868;&#x4E2D;&#x7684;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x5B8C;&#x5168;&#x7531;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#x3002;&#x6700;&#x65E9;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x76F4;&#x63A5;&#x7528;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x9700;&#x8981;&#x67E5;&#x5927;&#x91CF;&#x7684;&#x8868;&#x683C;&#x6765;&#x786E;&#x5B9A;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x7F16;&#x5199;&#x51FA;&#x6765;&#x7684;&#x7A0B;&#x5E8F;&#x5F88;&#x4E0D;&#x76F4;&#x89C2;&#xFF0C;&#x800C;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x4E8E;&#x662F;&#x6709;&#x4E86;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#xFF0C;&#x628A;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x4E2D;&#x4E00;&#x7EC4;&#x4E00;&#x7EC4;&#x7684;&#x6570;&#x5B57;&#x7528;&#x52A9;&#x8BB0;&#x7B26;&#xFF08;Mnemonic&#xFF09;<a id="id2703988" class="indexterm"></a>&#x8868;&#x793A;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x8FD9;&#x4E9B;&#x52A9;&#x8BB0;&#x7B26;&#x5199;&#x51FA;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x6C47;&#x7F16;&#x5668;&#xFF08;Assembler&#xFF09;<a id="id2703997" class="indexterm"></a>&#x53BB;&#x67E5;&#x8868;&#x628A;&#x52A9;&#x8BB0;&#x7B26;&#x66FF;&#x6362;&#x6210;&#x6570;&#x5B57;&#xFF0C;&#x4E5F;&#x5C31;&#x628A;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7FFB;&#x8BD1;&#x6210;&#x4E86;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x3002;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x548C;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7684;&#x6307;&#x4EE4;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x6709;&#x4E09;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x4E5F;&#x6709;&#x4E09;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x6C47;&#x7F16;&#x5668;&#x5C31;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x66FF;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x7B2C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x4E2D;&#xFF0C;&#x628A;<code class="literal">movl ?,%eax</code>&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#x7684;&#x6307;&#x4EE4;&#x66FF;&#x6362;&#x6210;&#x673A;&#x5668;&#x7801;<code class="literal">a1 ?</code>&#xFF0C;?&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x5728;&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#x4E2D;&#x662F;<code class="literal">0x804a01c</code>&#xFF0C;&#x8F6C;&#x6362;&#x6210;&#x673A;&#x5668;&#x7801;&#x4E4B;&#x540E;&#x662F;<code class="literal">1c a0 04 08</code>&#xFF08;&#x8FD9;&#x662F;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x7684;&#x5C0F;&#x7AEF;&#x8868;&#x793A;&#xFF0C;&#x5C0F;&#x7AEF;&#x8868;&#x793A;&#x5C06;&#x5728;<a class="xref" href="ch18s05.html#asm.relocatable">&#x7B2C;&#xA0;5.1&#xA0;&#x8282; &#x201C;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x201D;</a>&#x4ECB;&#x7ECD;&#xFF09;&#x3002;</p><p>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;C&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x53E5;&#x548C;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF0C;&#x4E00;&#x6761;<code class="literal">a=b+1;</code>&#x8BED;&#x53E5;&#x8981;&#x7FFB;&#x8BD1;&#x6210;&#x4E09;&#x6761;&#x6C47;&#x7F16;&#x6216;&#x673A;&#x5668;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x7F16;&#x8BD1;&#xFF08;Compile&#xFF09;<a id="id2704056" class="indexterm"></a>&#xFF0C;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#xFF08;Compiler&#xFF09;<a id="id2704064" class="indexterm"></a>&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x663E;&#x7136;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x529F;&#x80FD;&#x6BD4;&#x6C47;&#x7F16;&#x5668;&#x8981;&#x590D;&#x6742;&#x5F97;&#x591A;&#x3002;&#x7528;C&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x7F16;&#x8BD1;&#x8F6C;&#x6210;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x624D;&#x80FD;&#x88AB;&#x8BA1;&#x7B97;&#x673A;&#x6267;&#x884C;&#xFF0C;&#x7F16;&#x8BD1;&#x9700;&#x8981;&#x82B1;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x662F;&#x7528;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x7136;&#x800C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4F18;&#x70B9;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x7528;C&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x7D27;&#x51D1;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x51FA;&#x4E86;&#x9519;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x6539;&#x6B63;&#x3002;&#x5176;&#x6B21;&#xFF0C;C&#x8BED;&#x8A00;&#x662F;&#x53EF;&#x79FB;&#x690D;&#x7684;&#xFF08;Portable&#xFF09;<a id="id2704085" class="indexterm"></a>&#x6216;&#x8005;&#x79F0;&#x4E3A;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x7684;&#xFF08;Platform Independent&#xFF09;<a id="id2704093" class="indexterm"></a>&#x3002;</p><p>&#x5E73;&#x53F0;&#x8FD9;&#x4E2A;&#x8BCD;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x89E3;&#x91CA;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF08;Architecture&#xFF09;<a id="id2704105" class="indexterm"></a>&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;Operating System&#xFF09;<a id="id2704114" class="indexterm"></a>&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#xFF08;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x94FE;&#x63A5;&#x5668;&#x7B49;&#xFF09;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6307;&#x4EE4;&#x96C6;&#xFF08;Instruction Set&#xFF09;<a id="id2704122" class="indexterm"></a>&#xFF0C;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x7684;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x683C;&#x5F0F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x67D0;&#x79CD;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6C47;&#x7F16;&#x6216;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x5199;&#x51FA;&#x6765;&#x7684;&#x7A0B;&#x5E8F;&#x53EA;&#x80FD;&#x5728;&#x8FD9;&#x79CD;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x7136;&#x800C;&#x5404;&#x79CD;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;C&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;C&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x6210;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x673A;&#x5668;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7528;C&#x8BED;&#x8A00;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x53EA;&#x9700;&#x7A0D;&#x52A0;&#x4FEE;&#x6539;&#x751A;&#x81F3;&#x4E0D;&#x7528;&#x4FEE;&#x6539;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#x3002;&#x5404;&#x79CD;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x90FD;&#x5177;&#x6709;C&#x8BED;&#x8A00;&#x7684;&#x8FD9;&#x4E9B;&#x4F18;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x662F;&#x7528;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x548C;&#x786C;&#x4EF6;&#x5173;&#x7CFB;&#x5BC6;&#x5207;&#x7684;&#x5C11;&#x6570;&#x7A0B;&#x5E8F;&#xFF08;&#x4F8B;&#x5982;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF09;&#x624D;&#x4F1A;&#x7528;&#x5230;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#x3002;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x76F8;&#x540C;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x7528;&#x4E0D;&#x540C;&#x7684;C&#x7F16;&#x8BD1;&#x5668;&#xFF08;&#x6216;&#x8005;&#x540C;&#x4E00;&#x4E2A;C&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#xFF09;&#x7F16;&#x8BD1;&#x540C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;C&#x8BED;&#x8A00;&#x6709;&#x4E9B;&#x8BED;&#x6CD5;&#x7279;&#x6027;&#x5728;C&#x6807;&#x51C6;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#xFF0C;&#x5404;&#x7F16;&#x8BD1;&#x5668;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x7F16;&#x8BD1;&#x51FA;&#x6765;&#x7684;&#x6307;&#x4EE4;&#x7684;&#x884C;&#x4E3A;&#x7279;&#x6027;&#x4E5F;&#x4F1A;&#x4E0D;&#x540C;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x8BED;&#x6CD5;&#x7279;&#x6027;&#x3002;</p><p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x9996;&#x5148;&#x4F60;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5199;&#x4E00;&#x4E2A;C&#x7A0B;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x4FDD;&#x5B58;&#x6210;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">program.c</code>&#xFF08;&#x901A;&#x5E38;C&#x7A0B;&#x5E8F;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x540E;&#x7F00;&#x662F;<code class="literal">.c</code>&#xFF09;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x6E90;&#x4EE3;&#x7801;&#xFF08;Source Code&#xFF09;<a id="id2703560" class="indexterm"></a>&#x6216;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x884C;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#xFF0C;&#x7F16;&#x8BD1;&#x7684;&#x8FC7;&#x7A0B;&#x5E76;&#x4E0D;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x6E90;&#x4EE3;&#x7801;&#x5168;&#x90E8;&#x7FFB;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x6307;&#x4EE4;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;<code class="literal">a.out</code>&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x52A0;&#x8F7D;&#x8FD0;&#x884C;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x6267;&#x884C;&#x8BE5;&#x6587;&#x4EF6;&#x4E2D;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x751F;&#x6210;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><div class="figure"><a id="id2703581"></a><p class="title"><b>&#x56FE;&#xA0;1.1.&#xA0;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/intro.compile.png" alt="&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><p>&#x6709;&#x4E9B;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x4EE5;&#x89E3;&#x91CA;&#xFF08;Interpret&#xFF09;<a id="id2703595" class="indexterm"></a>&#x7684;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#xFF0C;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x548C;C&#x8BED;&#x8A00;&#x7684;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5F88;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x4F8B;&#x5982;&#x7F16;&#x5199;&#x4E00;&#x4E2A;Shell&#x811A;&#x672C;<code class="literal">script.sh</code>&#xFF0C;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="programlisting">#! /bin/sh
VAR=1
VAR=$(($VAR+1))
echo $VAR</pre><p>&#x5B9A;&#x4E49;Shell&#x53D8;&#x91CF;<code class="literal">VAR</code>&#x7684;&#x521D;&#x59CB;&#x503C;&#x662F;1&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x589E;1&#xFF0C;&#x7136;&#x540E;&#x6253;&#x5370;<code class="literal">VAR</code>&#x7684;&#x503C;&#x3002;&#x7528;Shell&#x7A0B;&#x5E8F;<code class="literal">/bin/sh</code>&#x89E3;&#x91CA;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p><pre class="screen">$ /bin/sh script.sh
2</pre><p>&#x8FD9;&#x91CC;&#x7684;<code class="literal">/bin/sh</code>&#x79F0;&#x4E3A;&#x89E3;&#x91CA;&#x5668;&#xFF08;Interpreter&#xFF09;<a id="id2703650" class="indexterm"></a>&#xFF0C;&#x5B83;&#x628A;&#x811A;&#x672C;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x5F53;&#x4F5C;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5148;&#x751F;&#x6210;&#x5305;&#x542B;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x518D;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x628A;&#x811A;&#x672C;&#x4E2D;&#x7684;&#x8FD9;&#x4E09;&#x884C;&#x5F53;&#x4F5C;&#x4E09;&#x6761;&#x547D;&#x4EE4;&#x76F4;&#x63A5;&#x6572;&#x5230;Shell&#x63D0;&#x793A;&#x7B26;&#x4E0B;&#xFF0C;&#x4E5F;&#x80FD;&#x5F97;&#x5230;&#x540C;&#x6837;&#x7684;&#x7ED3;&#x679C;&#xFF1A;</p><pre class="screen">$ VAR=1
$ VAR=$(($VAR+1))
$ echo $VAR
2</pre><div class="figure"><a id="id2703667"></a><p class="title"><b>&#x56FE;&#xA0;1.2.&#xA0;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;</b></p><div class="figure-contents"><div><img src="images/intro.interpret.png" alt="&#x89E3;&#x91CA;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;"></div></div></div><br class="figure-break"><p>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4ECD;&#x5728;&#x53D1;&#x5C55;&#x6F14;&#x5316;&#x3002;&#x4EE5;&#x4E0A;&#x4ECB;&#x7ECD;&#x7684;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x79F0;&#x4E3A;&#x7B2C;&#x4E00;&#x4EE3;&#x8BED;&#x8A00;&#xFF08;1GL&#xFF0C;1st Generation Programming Language&#xFF09;<a id="id2704432" class="indexterm"></a>&#xFF0C;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x79F0;&#x4E3A;&#x7B2C;&#x4E8C;&#x4EE3;&#x8BED;&#x8A00;&#xFF08;2GL&#xFF0C;2nd Generation Programming Language&#xFF09;<a id="id2704441" class="indexterm"></a>&#xFF0C;C&#x3001;C++&#x3001;Java&#x3001;Python&#x7B49;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x7B2C;&#x4E09;&#x4EE3;&#x8BED;&#x8A00;&#xFF08;3GL&#xFF0C;3rd Generation Programming Language&#xFF09;<a id="id2704450" class="indexterm"></a>&#x3002;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;4GL&#xFF08;4th Generation Programming Language&#xFF09;<a id="id2704459" class="indexterm"></a>&#x548C;5GL&#xFF08;5th Generation Programming Language&#xFF09;<a id="id2704468" class="indexterm"></a>&#x7684;&#x6982;&#x5FF5;&#x3002;3GL&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x867D;&#x7136;&#x662F;&#x7528;&#x8BED;&#x53E5;&#x7F16;&#x7A0B;&#x800C;&#x4E0D;&#x76F4;&#x63A5;&#x7528;&#x6307;&#x4EE4;&#x7F16;&#x7A0B;&#xFF0C;&#x4F46;&#x8BED;&#x53E5;&#x4E5F;&#x5206;&#x4E3A;&#x8F93;&#x5165;&#x3001;&#x8F93;&#x51FA;&#x3001;&#x57FA;&#x672C;&#x8FD0;&#x7B97;&#x3001;&#x6D4B;&#x8BD5;&#x5206;&#x652F;&#x548C;&#x5FAA;&#x73AF;&#x7B49;&#x51E0;&#x79CD;&#xFF0C;&#x548C;&#x6307;&#x4EE4;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x3002;&#x800C;4GL&#x4EE5;&#x540E;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x66F4;&#x591A;&#x662F;&#x63CF;&#x8FF0;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF08;Declarative&#xFF09;<a id="id2704480" class="indexterm"></a>&#x800C;&#x4E0D;&#x63CF;&#x8FF0;&#x5177;&#x4F53;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x600E;&#x4E48;&#x505A;&#xFF08;Imperative&#xFF09;<a id="id2704488" class="indexterm"></a>&#xFF0C;&#x5177;&#x4F53;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x600E;&#x4E48;&#x505A;&#x5B8C;&#x5168;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x6216;&#x89E3;&#x91CA;&#x5668;&#x51B3;&#x5B9A;&#xFF0C;&#x4F8B;&#x5982;SQL&#x8BED;&#x8A00;&#xFF08;SQL&#xFF0C;Structured Query Language&#xFF0C;&#x7ED3;&#x6784;&#x5316;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF09;<a id="id2704496" class="indexterm"></a>&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2704506"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x7684;&#x8BED;&#x8A00;&#x76F8;&#x6BD4;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x7684;&#x8BED;&#x8A00;&#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x7F3A;&#x70B9;&#xFF1F;</p><p>&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x601D;&#x8003;&#x9898;&#x3002;&#x672C;&#x4E66;&#x7684;&#x601D;&#x8003;&#x9898;&#x901A;&#x5E38;&#x8981;&#x6C42;&#x8BFB;&#x8005;&#x7CFB;&#x7EDF;&#x5730;&#x603B;&#x7ED3;&#x5F53;&#x524D;&#x5C0F;&#x8282;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x7ED3;&#x5408;&#x4EE5;&#x524D;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x7ECF;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x63A8;&#x7406;&#xFF0C;&#x7136;&#x540E;&#x4F5C;&#x7B54;&#x3002;&#x672C;&#x4E66;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x8BFB;&#x8005;&#x5E94;&#x8BE5;&#x6293;&#x4F4F;&#x6982;&#x5FF5;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x6982;&#x5FF5;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x603B;&#x7ED3;&#xFF0C;&#x6BD4;&#x5982;&#x672C;&#x8282;&#x4ECB;&#x7ECD;&#x4E86;&#x5F88;&#x591A;&#x6982;&#x5FF5;&#xFF1A;<span class="emphasis"><em>&#x7A0B;&#x5E8F;</em></span>&#x7531;<span class="emphasis"><em>&#x8BED;&#x53E5;</em></span>&#x6216;<span class="emphasis"><em>&#x6307;&#x4EE4;</em></span>&#x7EC4;&#x6210;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53EA;&#x80FD;&#x6267;&#x884C;<span class="emphasis"><em>&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;</em></span>&#x4E2D;&#x7684;<span class="emphasis"><em>&#x6307;&#x4EE4;</em></span>&#xFF08;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7684;&#x6307;&#x4EE4;&#x8981;&#x5148;&#x8F6C;&#x6210;&#x673A;&#x5668;&#x7801;&#x624D;&#x80FD;&#x6267;&#x884C;&#xFF09;&#xFF0C;<span class="emphasis"><em>&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;</em></span>&#x8981;&#x6267;&#x884C;&#x5C31;&#x5FC5;&#x987B;&#x5148;&#x7FFB;&#x8BD1;&#x6210;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#xFF0C;&#x7FFB;&#x8BD1;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x79CD;&#xFF0D;&#xFF0D;<span class="emphasis"><em>&#x7F16;&#x8BD1;</em></span>&#x548C;<span class="emphasis"><em>&#x89E3;&#x91CA;</em></span>&#xFF0C;&#x867D;&#x7136;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4E0D;&#x4FBF;&#xFF0C;&#x4F46;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;<span class="emphasis"><em>&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x6027;</em></span>&#x3002;&#x4EC0;&#x4E48;&#x662F;<span class="emphasis"><em>&#x5E73;&#x53F0;</em></span>&#xFF1F;&#x4E00;&#x79CD;&#x5E73;&#x53F0;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x79CD;<span class="emphasis"><em>&#x4F53;&#x7CFB;&#x7ED3;&#x6784;</em></span>&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x79CD;<span class="emphasis"><em>&#x6307;&#x4EE4;&#x96C6;</em></span>&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x79CD;<span class="emphasis"><em>&#x673A;&#x5668;&#x8BED;&#x8A00;</em></span>&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x53EF;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x4E0A;&#x6587;&#x5E76;&#x6CA1;&#x6709;&#x7528;&#x201C;<span class="quote">&#x4E00;&#x4E00;&#x5BF9;&#x5E94;</span>&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x4F46;&#x8BFB;&#x8005;&#x5E94;&#x8BE5;&#x80FD;&#x63A8;&#x7406;&#x51FA;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF0C;&#x800C;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x548C;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x662F;<span class="emphasis"><em>&#x5E73;&#x53F0;&#x65E0;&#x5173;</em></span>&#x7684;&#xFF0C;&#x6982;&#x5FF5;&#x4E4B;&#x95F4;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x91CF;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x5C24;&#x5176;&#x91CD;&#x8981;&#x3002;&#x90A3;&#x4E48;&#x7F16;&#x8BD1;&#x548C;&#x89E3;&#x91CA;&#x7684;&#x8FC7;&#x7A0B;&#x6709;&#x54EA;&#x4E9B;&#x4E0D;&#x540C;&#xFF1F;&#x4E3B;&#x8981;&#x7684;&#x4E0D;&#x540C;&#x5728;&#x4E8E;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7FFB;&#x8BD1;&#x548C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6267;&#x884C;&#x3002;</p><p>&#x73B0;&#x5728;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x601D;&#x8003;&#x9898;&#xFF0C;&#x6839;&#x636E;&#x7F16;&#x8BD1;&#x548C;&#x89E3;&#x91CA;&#x7684;&#x4E0D;&#x540C;&#x539F;&#x7406;&#xFF0C;&#x4F60;&#x80FD;&#x5426;&#x5728;&#x6267;&#x884C;&#x6548;&#x7387;&#x548C;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x6027;&#x7B49;&#x65B9;&#x9762;&#x505A;&#x4E00;&#x4E0B;&#x6BD4;&#x8F83;&#xFF1F;</p><p>&#x5E0C;&#x671B;&#x8BFB;&#x8005;&#x638C;&#x63E1;<span class="emphasis"><em>&#x4EE5;&#x6982;&#x5FF5;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x9605;&#x8BFB;&#x601D;&#x8003;&#x4E60;&#x60EF;</em></span>&#xFF0C;&#x6BCF;&#x8BFB;&#x4E00;&#x8282;&#x5C31;&#x603B;&#x7ED3;&#x4E00;&#x5957;&#x6982;&#x5FF5;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x56FE;&#x753B;&#x5728;&#x4E66;&#x4E0A;&#x7A7A;&#x767D;&#x5904;&#x3002;&#x5982;&#x679C;&#x8BFB;&#x5230;&#x540E;&#x9762;&#x67D0;&#x4E00;&#x8282;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x8BB2;&#x8FC7;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x662F;&#x8BB0;&#x4E0D;&#x6E05;&#x5728;&#x54EA;&#x4E00;&#x8282;&#x8BB2;&#x8FC7;&#x4E86;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x4E66;&#x540E;&#x7684;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x627E;&#x5230;&#x5B83;&#x662F;&#x5728;&#x54EA;&#x4E00;&#x8282;&#x5B9A;&#x4E49;&#x7684;&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="intro.naturalformal.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;2.&#xA0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x548C;&#x5F62;&#x5F0F;&#x8BED;&#x8A00;</td></tr></tbody></table></div>
</body></html>