<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>4.&#xA0;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="ch01.html" title="&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;"><link rel="prev" href="ch01s03.html" title="3.&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;"><link rel="next" href="ch02.html" title="&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">4.&#xA0;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch01s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#x7B2C;&#xA0;1&#xA0;&#x7AE0;&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="ch02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="sect1" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="intro.helloworld"></a>4.&#xA0;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;</h2></div></div></div><p>&#x901A;&#x5E38;&#x4E00;&#x672C;&#x6559;&#x7F16;&#x7A0B;&#x7684;&#x4E66;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x90FD;&#x662F;&#x6253;&#x5370;&#x201C;<span class="quote">Hello, World.</span>&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F20;&#x7EDF;&#x6E90;&#x81EA;<a class="xref" href="bi01.html#bibli.kr" title="The C Programming Language">[<abbr class="abbrev">K&amp;R</abbr>]</a>&#xFF0C;&#x7528;C&#x8BED;&#x8A00;&#x5199;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p><div class="example"><a id="id2705156"></a><p class="title"><b>&#x4F8B;&#xA0;1.1.&#xA0;Hello World</b></p><div class="example-contents"><pre class="programlisting">#include &lt;stdio.h&gt;

/* main: generate some simple output */

int main(void)
{
	printf(&quot;Hello, world.\n&quot;);
	return 0;
}</pre></div></div><br class="example-break"><p>&#x5C06;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4FDD;&#x5B58;&#x6210;<code class="literal">main.c</code>&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#xFF1A;</p><pre class="screen">$ gcc main.c
$ ./a.out
Hello, world.</pre><p><code class="literal">gcc</code>&#x662F;Linux&#x5E73;&#x53F0;&#x7684;C&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x7F16;&#x8BD1;&#x540E;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;<code class="literal">a.out</code>&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x8F93;&#x5165;&#x8FD9;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x8DEF;&#x5F84;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5B83;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x628A;&#x6587;&#x4EF6;&#x540D;&#x53EB;<code class="literal">a.out</code>&#xFF0C;&#x53EF;&#x4EE5;&#x7528;<code class="literal">gcc</code>&#x7684;<code class="literal">-o</code>&#x53C2;&#x6570;&#x81EA;&#x5DF1;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x540D;&#xFF1A;</p><pre class="screen">$ gcc main.c -o main
$ ./main
Hello, world.</pre><p>&#x867D;&#x7136;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6682;&#x65F6;&#x8FD8;&#x4E0D;&#x5177;&#x5907;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x6765;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x6BD4;&#x5982;&#x7A0B;&#x5E8F;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#xFF0C;&#x8FD8;&#x6709;&#x7A0B;&#x5E8F;&#x4E3B;&#x4F53;&#x7684;<code class="literal">int main(void){...return 0;}</code>&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x4E0D;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#xFF0C;&#x8BFB;&#x8005;&#x73B0;&#x5728;&#x53EA;&#x9700;&#x8981;&#x628A;&#x5B83;&#x4EEC;&#x770B;&#x6210;&#x662F;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x6309;&#x60EF;&#x4F8B;&#x5FC5;&#x987B;&#x8981;&#x5199;&#x7684;&#x90E8;&#x5206;&#xFF08;Boilerplate&#xFF09;<a id="id2705235" class="indexterm"></a>&#x3002;&#x4F46;&#x8981;&#x6CE8;&#x610F;<code class="literal">main</code>&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x540D;&#x5B57;&#xFF0C;C&#x7A0B;&#x5E8F;&#x603B;&#x662F;&#x4ECE;<code class="literal">main</code>&#x91CC;&#x9762;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x662F;&#x6307;<code class="literal">printf</code>&#x8FD9;&#x6761;&#x8BED;&#x53E5;&#x3002;</p><p>&#x7B2C;3&#x884C;&#x7684;<code class="literal">/* ... */</code>&#x7ED3;&#x6784;&#x662F;&#x4E00;&#x4E2A;&#x6CE8;&#x91CA;&#xFF08;Comment&#xFF09;<a id="id2705268" class="indexterm"></a>&#xFF0C;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E9B;&#x63CF;&#x8FF0;&#x6027;&#x7684;&#x8BDD;&#xFF0C;&#x89E3;&#x91CA;&#x8FD9;&#x6BB5;&#x7A0B;&#x5E8F;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x6CE8;&#x91CA;&#x53EA;&#x662F;&#x5199;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x770B;&#x7684;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x5FFD;&#x7565;&#x4ECE;<code class="literal">/*</code>&#x5230;<code class="literal">*/</code>&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#xFF0C;&#x6240;&#x4EE5;&#x5199;&#x6CE8;&#x91CA;&#x6CA1;&#x6709;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#xFF0C;&#x7231;&#x600E;&#x4E48;&#x5199;&#x5C31;&#x600E;&#x4E48;&#x5199;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x7BA1;&#x5199;&#x591A;&#x5C11;&#x90FD;&#x4E0D;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x8FDB;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p><p><code class="literal">printf</code>&#x8BED;&#x53E5;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x628A;&#x6D88;&#x606F;&#x6253;&#x5370;&#x5230;&#x5C4F;&#x5E55;&#x3002;&#x6CE8;&#x610F;&#x8BED;&#x53E5;&#x7684;&#x672B;&#x5C3E;&#x4EE5;;&#x53F7;&#xFF08;Semicolon&#xFF09;<a id="id2705299" class="indexterm"></a>&#x7ED3;&#x675F;&#xFF0C;&#x4E0B;&#x4E00;&#x6761;&#x8BED;&#x53E5;<code class="literal">return 0;</code>&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</p><p>C&#x8BED;&#x8A00;&#x7528;{}&#x62EC;&#x53F7;&#xFF08;Brace&#x6216;Curly Brace&#xFF09;<a id="id2705316" class="indexterm"></a>&#x628A;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#x5206;&#x6210;&#x7EC4;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;<code class="literal">printf</code>&#x548C;<code class="literal">return</code>&#x8BED;&#x53E5;&#x5957;&#x5728;<code class="literal">main</code>&#x7684;{}&#x62EC;&#x53F7;&#x4E2D;&#xFF0C;&#x8868;&#x793A;&#x5B83;&#x4EEC;&#x5C5E;&#x4E8E;<code class="literal">main</code>&#x7684;&#x5B9A;&#x4E49;&#x4E4B;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x8FD9;&#x4E24;&#x53E5;&#x76F8;&#x6BD4;<code class="literal">main</code>&#x90A3;&#x4E00;&#x884C;&#x90FD;&#x7F29;&#x8FDB;&#xFF08;Indent&#xFF09;<a id="id2705353" class="indexterm"></a>&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x53EF;&#x4EE5;&#x7528;&#x82E5;&#x5E72;&#x4E2A;&#x7A7A;&#x683C;&#xFF08;Blank&#xFF09;<a id="id2705360" class="indexterm"></a>&#x548C;Tab&#x5B57;&#x7B26;&#x6765;&#x7F29;&#x8FDB;&#xFF0C;&#x7F29;&#x8FDB;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x4F7F;&#x6211;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x770B;&#x51FA;&#x8FD9;&#x4E24;&#x884C;&#x662F;&#x5C5E;&#x4E8E;<code class="literal">main</code>&#x7684;&#x5B9A;&#x4E49;&#x4E4B;&#x4E2D;&#x7684;&#xFF0C;&#x8981;&#x5199;&#x51FA;&#x6F02;&#x4EAE;&#x7684;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x6709;&#x6574;&#x9F50;&#x7684;&#x7F29;&#x8FDB;&#xFF0C;<a class="xref" href="ch09s01.html#codingstyle.indent">&#x7B2C;&#xA0;1&#xA0;&#x8282; &#x201C;&#x7F29;&#x8FDB;&#x548C;&#x7A7A;&#x767D;&#x201D;</a>&#x5C06;&#x4ECB;&#x7ECD;&#x63A8;&#x8350;&#x7684;&#x7F29;&#x8FDB;&#x5199;&#x6CD5;&#x3002;</p><p>&#x6B63;&#x5982;&#x524D;&#x9762;&#x6240;&#x8BF4;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x4E8E;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x662F;&#x6BEB;&#x4E0D;&#x7559;&#x60C5;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x6709;&#x4E00;&#x70B9;&#x62FC;&#x5199;&#x9519;&#x8BEF;&#xFF0C;&#x4F8B;&#x5982;&#x7B2C;&#x4E00;&#x884C;&#x5199;&#x6210;&#x4E86;<code class="literal">stdoi.h</code>&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x4F1A;&#x5F97;&#x5230;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#xFF1A;</p><pre class="screen">$ gcc main.c
main.c:1:19: error: stdoi.h: No such file or directory
...</pre><p>&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x975E;&#x5E38;&#x7D27;&#x51D1;&#xFF0C;&#x521D;&#x5B66;&#x8005;&#x5F80;&#x5F80;&#x4E0D;&#x5BB9;&#x6613;&#x770B;&#x660E;&#x767D;&#x51FA;&#x4E86;&#x4EC0;&#x4E48;&#x9519;&#x8BEF;&#xFF0C;&#x5373;&#x4F7F;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x8BF4;&#x7684;&#x662F;&#x7B2C;1&#x884C;&#x6709;&#x9519;&#x8BEF;&#xFF0C;&#x5F88;&#x591A;&#x521D;&#x5B66;&#x8005;&#x5BF9;&#x7167;&#x7740;&#x4E66;&#x770B;&#x597D;&#x51E0;&#x904D;&#x4E5F;&#x770B;&#x4E0D;&#x51FA;&#x81EA;&#x5DF1;&#x8FD9;&#x4E00;&#x884C;&#x54EA;&#x91CC;&#x6709;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5BF9;&#x7B26;&#x53F7;&#x548C;&#x62FC;&#x5199;&#x4E0D;&#x654F;&#x611F;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x82F1;&#x6587;&#x8F83;&#x5DEE;&#x7684;&#x521D;&#x5B66;&#x8005;&#xFF09;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x7B26;&#x53F7;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x53C8;&#x5982;&#x4F55;&#x80FD;&#x8BB0;&#x4F4F;&#x6B63;&#x786E;&#x7684;&#x62FC;&#x5199;&#xFF1F;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x60F3;&#x770B;&#x5230;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x5176;&#x5B9E;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x201C;<span class="quote">&#x5728;<code class="literal">main.c</code>&#x7A0B;&#x5E8F;&#x7B2C;1&#x884C;&#x7684;&#x7B2C;19&#x5217;&#xFF0C;&#x60A8;&#x8BD5;&#x56FE;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<code class="literal">stdoi.h</code>&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x60DC;&#x6211;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x6211;&#x5374;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<code class="literal">stdio.h</code>&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x731C;&#x8FD9;&#x4E2A;&#x624D;&#x662F;&#x60A8;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x5BF9;&#x5417;&#xFF1F;</span>&#x201D;&#x53EF;&#x60DC;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x53CB;&#x5584;&#x5230;&#x8FD9;&#x4E2A;&#x7A0B;&#x5EA6;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x4F60;&#x6240;&#x5F97;&#x5230;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x5E76;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x6307;&#x51FA;&#x8C01;&#x662F;&#x72AF;&#x4EBA;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x7D22;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x7EBF;&#x7D22;&#x505A;&#x4E00;&#x4E9B;&#x4FA6;&#x63A2;&#x548C;&#x63A8;&#x7406;&#x3002;</p><p>&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x4E0D;&#x662F;<code class="literal">error</code>&#x800C;&#x662F;<code class="literal">warning</code>&#xFF0C;&#x4F8B;&#x5982;&#x628A;&#x4E0A;&#x4F8B;&#x4E2D;&#x7684;<code class="literal">printf(&quot;Hello, world.\n&quot;);</code>&#x6539;&#x6210;<code class="literal">printf(1);</code>&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#xFF1A;</p><pre class="screen">$ gcc main.c
main.c: In function &#x2018;main&#x2019;:
main.c:7: warning: passing argument 1 of &#x2018;printf&#x2019; makes pointer from integer without a cast
$ ./a.out 
Segmentation fault</pre><p>&#x8FD9;&#x4E2A;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x662F;&#x8BF4;&#x7C7B;&#x578B;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x4F46;&#x52C9;&#x5F3A;&#x8FD8;&#x80FD;&#x914D;&#x5F97;&#x4E0A;&#x3002;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x4E0D;&#x662F;&#x81F4;&#x547D;&#x9519;&#x8BEF;&#xFF0C;&#x7F16;&#x8BD1;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#xFF0C;&#x5982;&#x679C;&#x6574;&#x4E2A;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x53EA;&#x6709;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x800C;&#x6CA1;&#x6709;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x4E5F;&#x662F;&#x4E0D;&#x5BB9;&#x5FFD;&#x89C6;&#x7684;&#x3002;&#x51FA;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x8BF4;&#x660E;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5199;&#x5F97;&#x4E0D;&#x591F;&#x89C4;&#x8303;&#xFF0C;&#x53EF;&#x80FD;&#x6709;Bug&#xFF0C;&#x867D;&#x7136;&#x80FD;&#x7F16;&#x8BD1;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5F80;&#x5F80;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x6BB5;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x5C5E;&#x4E8E;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x3002;&#x5404;&#x79CD;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x7684;&#x4E25;&#x91CD;&#x7A0B;&#x5EA6;&#x4E0D;&#x540C;&#xFF0C;&#x50CF;&#x4E0A;&#x9762;&#x8FD9;&#x79CD;&#x8B66;&#x544A;&#x51E0;&#x4E4E;&#x4E00;&#x5B9A;&#x8868;&#x660E;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;Bug&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x8B66;&#x544A;&#x53EA;&#x8868;&#x660E;&#x7A0B;&#x5E8F;&#x5199;&#x5F97;&#x4E0D;&#x591F;&#x89C4;&#x8303;&#xFF0C;&#x4E00;&#x822C;&#x8FD8;&#x662F;&#x80FD;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x8B66;&#x544A;&#x4FE1;&#x606F;<code class="literal">gcc</code>&#x9ED8;&#x8BA4;&#x662F;&#x4E0D;&#x63D0;&#x793A;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x8868;&#x660E;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;Bug&#x3002;<span class="emphasis"><em>&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x662F;&#x6253;&#x5F00;<code class="literal">gcc</code>&#x7684;<code class="literal">-Wall</code>&#x9009;&#x9879;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BA9;<code class="literal">gcc</code>&#x63D0;&#x793A;&#x6240;&#x6709;&#x7684;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4E25;&#x91CD;&#x7684;&#x8FD8;&#x662F;&#x4E0D;&#x4E25;&#x91CD;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4ECE;&#x4EE3;&#x7801;&#x4E2D;&#x5168;&#x90E8;&#x6D88;&#x706D;</em></span>&#x3002;&#x6BD4;&#x5982;&#x628A;&#x4E0A;&#x4F8B;&#x4E2D;&#x7684;<code class="literal">printf(&quot;Hello, world.\n&quot;);</code>&#x6539;&#x6210;<code class="literal">printf(0);</code>&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#xFF1A;</p><pre class="screen">$ gcc main.c
$ ./a.out</pre><p>&#x7F16;&#x8BD1;&#x65E2;&#x4E0D;&#x62A5;&#x9519;&#x4E5F;&#x4E0D;&#x62A5;&#x8B66;&#x544A;&#xFF0C;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x6253;&#x5370;&#x3002;&#x5982;&#x679C;&#x6253;&#x5F00;<code class="literal">-Wall</code>&#x9009;&#x9879;&#x7F16;&#x8BD1;&#x5C31;&#x4F1A;&#x62A5;&#x8B66;&#x544A;&#x4E86;&#xFF1A;</p><pre class="screen">$ gcc -Wall main.c
main.c: In function &#x2018;main&#x2019;:
main.c:7: warning: null argument where non-null required (argument 1)</pre><p>&#x5982;&#x679C;<code class="literal">printf</code>&#x4E2D;&#x7684;0&#x662F;&#x4F60;&#x4E0D;&#x5C0F;&#x5FC3;&#x5199;&#x4E0A;&#x53BB;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#x9519;&#x8BEF;&#x5730;&#x4F7F;&#x7528;&#x4E86;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x67E5;&#x627E;&#x66FF;&#x6362;&#x529F;&#x80FD;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x8B66;&#x544A;&#x5C31;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x53D1;&#x73B0;&#x9519;&#x8BEF;&#x3002;&#x867D;&#x7136;&#x672C;&#x4E66;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x4E3A;&#x4E86;&#x7A81;&#x51FA;&#x91CD;&#x70B9;&#x901A;&#x5E38;&#x7701;&#x7565;<code class="literal">-Wall</code>&#x9009;&#x9879;&#xFF0C;&#x4F46;&#x662F;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F60;&#x5199;&#x6BCF;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x547D;&#x4EE4;&#x65F6;&#x90FD;&#x52A0;&#x4E0A;<code class="literal">-Wall</code>&#x9009;&#x9879;&#x3002;</p><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a id="id2705581"></a>&#x4E60;&#x9898;</h3></div></div></div><p>1&#x3001;&#x5C3D;&#x7BA1;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x4E0D;&#x591F;&#x53CB;&#x597D;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x662F;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x4E0A;&#x9762;&#x90A3;&#x6837;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x6BCF;&#x6B21;&#x6539;&#x52A8;&#x4E00;&#x5C0F;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x770B;&#x662F;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x9519;&#x4E86;&#xFF0C;&#x5C31;&#x5C3D;&#x91CF;&#x8BB0;&#x4F4F;&#x7F16;&#x8BD1;&#x5668;&#x7ED9;&#x51FA;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x5E76;&#x628A;&#x6539;&#x52A8;&#x8FD8;&#x539F;&#x3002;&#x56E0;&#x4E3A;&#x9519;&#x8BEF;&#x662F;&#x4F60;&#x6539;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x80FD;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x628A;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x548C;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x5BF9;&#x5E94;&#x8D77;&#x6765;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x6837;&#x4E0B;&#x6B21;&#x4F60;&#x5728;&#x6BEB;&#x65E0;&#x9632;&#x5907;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x649E;&#x5230;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x65F6;&#x5C31;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x53CD;&#x590D;&#x7EC3;&#x4E60;&#xFF0C;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x7ECF;&#x9A8C;&#x79EF;&#x7D2F;&#x4E4B;&#x540E;&#x9762;&#x5BF9;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x5C31;&#x4F1A;&#x4ECE;&#x5BB9;&#x5F97;&#x591A;&#x4E86;&#x3002;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="ch01s03.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">&#x4E0A;&#x4E00;&#x7EA7;</a></td><td width="40%" align="right">&#xA0;<a accesskey="n" href="ch02.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">3.&#xA0;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x7B2C;&#xA0;2&#xA0;&#x7AE0;&#xA0;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;</td></tr></tbody></table></div>
</body></html>