<!--?xml version="1.0" encoding="UTF-8" standalone="no"?--><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>&#x524D;&#x8A00;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="up" href="index.html" title="Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;"><link rel="prev" href="pr01.html" title="&#x5386;&#x53F2;"><link rel="next" href="pt01.html" title="&#x90E8;&#x5206;&#xA0;I.&#xA0;C&#x8BED;&#x8A00;&#x5165;&#x95E8;"><meta name="viewport" content="width=device-width, initial-scale=1"></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">&#x524D;&#x8A00;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="pr01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><th width="60%" align="center">&#xA0;</th><td width="20%" align="right">&#xA0;<a accesskey="n" href="pt01.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr></tbody></table><hr></div><div class="preface" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title"><a id="id2655732"></a>&#x524D;&#x8A00;</h2></div></div></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2655738"></a>&#x8FD9;&#x672C;&#x4E66;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x70B9;&#xFF1F;&#x9762;&#x5411;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8BFB;&#x8005;&#xFF1F;</h2></div></div></div><p>&#x8FD9;&#x672C;&#x4E66;&#x6700;&#x521D;&#x662F;&#x4E3A;&#x5317;&#x4EAC;&#x4E9A;&#x5D4C;&#x6559;&#x80B2;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x7684;&#x5D4C;&#x5165;&#x5F0F;Linux&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x5E08;&#x5C31;&#x4E1A;&#x73ED;&#x8BFE;&#x7A0B;&#x91CF;&#x8EAB;&#x5B9A;&#x505A;&#x7684;&#x6559;&#x6750;&#x4E4B;&#x4E00;&#x3002;&#x8BE5;&#x8BFE;&#x7A0B;&#x662F;&#x4E3A;&#x671F;&#x56DB;&#x4E2A;&#x6708;&#x7684;&#x5168;&#x65E5;&#x5236;&#x804C;&#x4E1A;&#x57F9;&#x8BAD;&#xFF0C;&#x8981;&#x6C42;&#x5B66;&#x5458;&#x6BD5;&#x4E1A;&#x65F6;&#x5177;&#x5907;&#x975E;&#x5E38;Solid&#x7684;C&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#xFF0C;&#x80FD;&#x719F;&#x7EC3;&#x5730;&#x4F7F;&#x7528;Linux&#x7CFB;&#x7EDF;&#xFF0C;&#x540C;&#x65F6;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E0E;&#x6307;&#x4EE4;&#x96C6;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x539F;&#x7406;&#x548C;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x90FD;&#x6709;&#x8F83;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x7136;&#x800C;&#x5B66;&#x5458;&#x5165;&#x5B66;&#x65F6;&#x7684;&#x6C34;&#x5E73;&#x662F;&#x975E;&#x5E38;&#x521D;&#x7EA7;&#x800C;&#x4E14;&#x53C2;&#x5DEE;&#x4E0D;&#x9F50;&#x7684;&#xFF1A;&#x5B66;&#x5386;&#x6709;&#x4E13;&#x79D1;&#x3001;&#x672C;&#x79D1;&#x4E5F;&#x6709;&#x7814;&#x7A76;&#x751F;&#xFF0C;&#x4E13;&#x4E1A;&#x6709;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x76F8;&#x5173;&#x7684;&#x4E5F;&#x6709;&#x5F88;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#x4F1A;&#x8BA1;&#x4E13;&#x4E1A;&#xFF09;&#xFF0C;&#x4EE5;&#x524D;&#x4ECE;&#x4E8B;&#x7684;&#x804C;&#x4E1A;&#x6709;&#x548C;&#x6280;&#x672F;&#x76F8;&#x5173;&#x7684;&#x4E5F;&#x6709;&#x5B8C;&#x5168;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#xFF08;&#x4F8B;&#x5982;HR&#xFF09;&#xFF0C;&#x5E74;&#x9F84;&#x4ECE;&#x4E8C;&#x5341;&#x51FA;&#x5934;&#x5230;&#x4E09;&#x5341;&#x4E94;&#x516D;&#x5C81;&#x7684;&#x90FD;&#x6709;&#x3002;&#x8FD9;&#x4E48;&#x591A;&#x80CC;&#x666F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3001;&#x57FA;&#x7840;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3001;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#x548C;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x6765;&#x542C;&#x540C;&#x4E00;&#x5802;&#x8BFE;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x8FEB;&#x5207;&#x5E0C;&#x671B;&#x5B66;&#x4F1A;&#x5D4C;&#x5165;&#x5F0F;&#x5F00;&#x53D1;&#x6280;&#x672F;&#xFF0C;&#x6295;&#x8EAB;IT&#x884C;&#x4E1A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x804C;&#x4E1A;&#x6559;&#x80B2;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x7F16;&#x8FD9;&#x672C;&#x4E66;&#x65F6;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x3002;</p><p>&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7EDD;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5BF9;&#x4E8E;&#x96F6;&#x57FA;&#x7840;&#x7684;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#x3002;&#x5927;&#x5B66;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x6709;&#x56DB;&#x5E74;&#x65F6;&#x95F4;&#x4ECE;&#x96F6;&#x57FA;&#x7840;&#x5F00;&#x59CB;&#x57F9;&#x517B;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5FAE;&#x79EF;&#x5206;&#x3001;&#x7EBF;&#x4EE3;&#x3001;&#x968F;&#x673A;&#x3001;&#x79BB;&#x6563;&#x3001;&#x7EC4;&#x5408;&#x3001;&#x81EA;&#x52A8;&#x673A;&#x3001;&#x7F16;&#x8BD1;&#x539F;&#x7406;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x6210;&#x539F;&#x7406;&#x7B49;&#x7B49;&#x4E00;&#x5806;&#x57FA;&#x7840;&#x8BFE;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;C/C++&#x3001;Java&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x56FE;&#x5F62;&#x5B66;&#x7B49;&#x7B49;&#x4E00;&#x5806;&#x4E13;&#x4E1A;&#x8BFE;&#xFF0C;&#x6700;&#x540E;&#x57F9;&#x517B;&#x51FA;&#x4E00;&#x4E2A;&#x80FD;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x7684;&#x5B66;&#x751F;&#x3002;&#x5F88;&#x9057;&#x61BE;&#x8FD9;&#x6700;&#x540E;&#x4E00;&#x6761;&#x5F88;&#x591A;&#x5B66;&#x6821;&#x6CA1;&#x6709;&#x505A;&#x597D;&#xFF0C;&#x6765;&#x4E9A;&#x5D4C;&#x57F9;&#x8BAD;&#x7684;&#x5F88;&#x591A;&#x5B66;&#x751F;&#x5C31;&#x662F;&#x56DB;&#x5E74;&#x8FD9;&#x4E48;&#x5B66;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x4F46;&#x636E;&#x6211;&#x4EEC;&#x8003;&#x67E5;&#x4ED6;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x51E0;&#x4E4E;&#x4E3A;&#x96F6;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;&#x4E0E;&#x4E4B;&#x5F62;&#x6210;&#x9C9C;&#x660E;&#x5BF9;&#x6BD4;&#x7684;&#x662F;&#xFF0C;&#x53EA;&#x7ED9;&#x6211;&#x4EEC;&#x56DB;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x540C;&#x6837;&#x8981;&#x6C42;&#x4ECE;&#x96F6;&#x57FA;&#x7840;&#x5F00;&#x59CB;&#xFF0C;&#x6700;&#x540E;&#x57F9;&#x517B;&#x51FA;&#x4E00;&#x4E2A;&#x80FD;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x7684;&#x5B66;&#x751F;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x4FDD;&#x8BC1;&#x4ED6;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x804C;&#x4E1A;&#x6559;&#x80B2;&#x7684;&#x7279;&#x70B9;&#x3002;</p><p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8BF4;&#x201C;<span class="quote">&#x53EA;&#x7ED9;&#x6211;&#x4EEC;&#x56DB;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;</span>&#x201D;&#xFF1F;&#x6211;&#x4EEC;&#x5012;&#x662F;&#x60F3;&#x6559;&#x56DB;&#x5E74;&#x5462;&#xFF0C;&#x4F46;&#x5B66;&#x65F6;&#x7684;&#x957F;&#x77ED;&#x6211;&#x4EEC;&#x505A;&#x4E0D;&#x4E86;&#x4E3B;&#xFF0C;&#x662F;&#x7531;&#x5E02;&#x573A;&#x89C4;&#x5F8B;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x56DB;&#x5E74;&#x7684;&#x4EFB;&#x52A1;&#x8981;&#x6C42;&#x56DB;&#x4E2A;&#x6708;&#x505A;&#x597D;&#xFF0C;&#x8981;&#x600E;&#x4E48;&#x5B8C;&#x6210;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x4EFB;&#x52A1;&#xFF1F;&#x6709;&#x4E9B;&#x804C;&#x4E1A;&#x6559;&#x80B2;&#x7ED9;&#x51FA;&#x7684;&#x7B54;&#x6848;&#x662F;&#x201C;<span class="quote">&#x5B9E;&#x7528;&#x4E3B;&#x4E49;</span>&#x201D;&#xFF0C;&#x6253;&#x51FA;&#x4E86;&#x201C;<span class="quote">&#x6709;&#x7528;&#x5C31;&#x5B66;&#xFF0C;&#x6CA1;&#x6709;&#x7528;&#x5C31;&#x4E0D;&#x5B66;</span>&#x201D;&#x7684;&#x53E3;&#x53F7;&#xFF0C;&#x5927;&#x8086;&#x8D2C;&#x4F4E;&#x8BF4;&#x5927;&#x5B66;&#x91CC;&#x6559;&#x7684;&#x57FA;&#x7840;&#x8BFE;&#x90FD;&#x662F;&#x8FC7;&#x65F6;&#x7684;&#x3001;&#x65E0;&#x7528;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x4ED6;&#x4EEC;&#x6559;&#x7684;&#x6280;&#x672F;&#x624D;&#x662F;&#x5B9E;&#x7528;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x7092;&#x4F5C;&#x5F88;&#x4E0D;&#x597D;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5927;&#x5B66;&#x91CC;&#x6559;&#x7684;&#x6BCF;&#x4E00;&#x95E8;&#x8BFE;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x4E0D;&#x4F1A;&#x8FC7;&#x65F6;&#xFF0C;&#x5012;&#x662F;&#x90A3;&#x4E9B;&#x65F6;&#x9AE6;&#x7684;&#x201C;<span class="quote">&#x5B9E;&#x7528;&#x6280;&#x672F;</span>&#x201D;&#x6709;&#x53EF;&#x80FD;&#x5F88;&#x5FEB;&#x5C31;&#x8FC7;&#x65F6;&#x4E86;&#x3002;</p><p>&#x56DB;&#x5E74;&#x7684;&#x4EFB;&#x52A1;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x7528;&#x56DB;&#x4E2A;&#x6708;&#x505A;&#x597D;&#xFF1F;&#x6211;&#x4EEC;&#x7ED9;&#x51FA;&#x7684;&#x7B54;&#x6848;&#x662F;&#x201C;<span class="quote">&#x4F18;&#x5316;</span>&#x201D;&#x3002;&#x73B0;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x5B89;&#x6392;&#x7684;&#x8BFE;&#x7A0B;&#x4F53;&#x7CFB;&#x6700;&#x5927;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x6839;&#x672C;&#x4E0D;&#x8003;&#x8651;&#x4F18;&#x5316;&#x3002;&#x6BCF;&#x4E2A;&#x8FC7;&#x6765;&#x4EBA;&#x90FD;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x611F;&#x89C9;&#xFF1A;&#x5927;&#x4E00;&#x5927;&#x4E8C;&#x5B66;&#x4E86;&#x597D;&#x591A;&#x6570;&#x5B66;&#x8BFE;&#xFF0C;&#x5374;&#x4E0D;&#x77E5;&#x9053;&#x90FD;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7528;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B66;&#x3002;&#x8FDE;&#x5B83;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x80FD;&#x6709;&#x5174;&#x8DA3;&#x5B66;&#x597D;&#x5462;&#xFF1F;&#x7136;&#x540E;&#x5230;&#x5927;&#x4E09;&#x5927;&#x56DB;&#x5B66;&#x4E13;&#x4E1A;&#x8BFE;&#x65F6;&#xFF0C;&#x7528;&#x5230;&#x4EE5;&#x524D;&#x7684;&#x77E5;&#x8BC6;&#x4E86;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x4EE5;&#x524D;&#x5B66;&#x7684;&#x6570;&#x5B66;&#x662F;&#x591A;&#x4E48;&#x6709;&#x7528;&#xFF0C;&#x7136;&#x800C;&#x65E9;&#x5C31;&#x5FD8;&#x5F97;&#x4E00;&#x5E72;&#x4E8C;&#x51C0;&#x4E86;&#xFF0C;&#x8003;&#x5B8C;&#x8BD5;&#x90FD;&#x8FD8;&#x7ED9;&#x8001;&#x5E08;&#x4E86;&#xFF0C;&#x56DE;&#x5934;&#x91CD;&#x65B0;&#x5B66;&#x5427;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x624D;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x4EE5;&#x524D;&#x6839;&#x672C;&#x6CA1;&#x5B66;&#x660E;&#x767D;&#xFF0C;&#x73B0;&#x5728;&#x624D;&#x771F;&#x7684;&#x5B66;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x524D;&#x4E24;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x5C82;&#x4E0D;&#x662F;&#x90FD;&#x6D6A;&#x8D39;&#x4E86;&#xFF1F;&#x5927;&#x5B66;&#x91CC;&#x7684;&#x8BFE;&#x7A0B;&#x4F53;&#x7CFB;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x4E0D;&#x7075;&#x6D3B;&#xFF0C;&#x6BCF;&#x95E8;&#x8BFE;&#x5FC5;&#x987B;&#x5360;&#x4E00;&#x4E2A;&#x5B66;&#x671F;&#xFF0C;&#x5FC5;&#x987B;&#x7531;&#x4E00;&#x4E2A;&#x8001;&#x5E08;&#x6559;&#xFF0C;&#x4E0D;&#x540C;&#x8BFE;&#x7A0B;&#x7684;&#x8001;&#x5E08;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6C9F;&#x901A;&#x548C;&#x8854;&#x63A5;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E9B;&#x8BFE;&#x7A0B;&#x4E4B;&#x95F4;&#x662F;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x7684;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x5F3A;&#x884C;&#x62C6;&#x5F00;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x4EBA;&#x7684;&#x8BA4;&#x77E5;&#x89C4;&#x5F8B;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x521A;&#x4E0A;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x4E00;&#x4E0A;&#x534A;&#x5B66;&#x671F;&#x5C31;&#x88AB;&#x903C;&#x7740;&#x5B66;C&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x5B9E;C&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x95E8;&#x5F88;&#x96BE;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4E0D;&#x61C2;&#x7F16;&#x8BD1;&#x539F;&#x7406;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x5B66;&#x660E;&#x767D;&#xFF0C;&#x90A3;&#x534A;&#x4E2A;&#x5B66;&#x671F;&#x81EA;&#x7136;&#x5C31;&#x6D6A;&#x8D39;&#x6389;&#x4E86;&#x3002;&#x5F53;&#x65F6;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5B66;&#x6821;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x76F8;&#x5173;&#x4E13;&#x4E1A;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5927;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x5B66;C&#x8BED;&#x8A00;&#xFF0C;&#x6709;&#x7684;&#x5B66;&#x6821;&#x66F4;&#x75AF;&#x72C2;&#xFF0C;&#x4E0A;&#x6765;&#x5C31;&#x5B66;C++&#xFF0C;&#x5BFC;&#x81F4;&#x5927;&#x591A;&#x6570;&#x5B66;&#x751F;&#x90FD;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x4F1A;C&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x534A;&#x540A;&#x5B50;&#x6C34;&#x5E73;&#xFF0C;&#x5230;&#x771F;&#x6B63;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x7ECF;&#x5E38;&#x4E3A;&#x4E00;&#x4E2A;Bug&#x641E;&#x5F97;&#x7126;&#x5934;&#x70C2;&#x989D;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x518D;&#x7CFB;&#x7EDF;&#x5730;&#x5B66;&#x4E00;&#x904D;C&#x8BED;&#x8A00;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5B66;&#x6821;&#x770B;&#x6765;&#xFF0C;C&#x8BED;&#x8A00;&#x8BFE;&#x65E9;&#x5728;&#x5927;&#x4E00;&#x5C31;&#x7ED9;&#x4F60;&#x201C;<span class="quote">&#x4E0A;&#x5B8C;&#x4E86;</span>&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x987F;&#x996D;&#x5DF2;&#x7ECF;&#x5403;&#x5B8C;&#x4E86;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x5403;&#x9971;&#x6CA1;&#x5403;&#x9971;&#xFF0C;&#x4E0D;&#x4F1A;&#x518D;&#x8BA9;&#x4F60;&#x91CD;&#x5403;&#x4E00;&#x904D;&#x4E86;&#x3002;&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x8BA4;&#x771F;&#x5730;&#x5BF9;&#x8FD9;&#x4E9B;&#x8BFE;&#x7A0B;&#x505A;&#x4F18;&#x5316;&#xFF0C;&#x7684;&#x786E;&#x662F;&#x6709;&#x5F88;&#x591A;&#x6C34;&#x4EFD;&#x53EF;&#x4EE5;&#x6324;&#x7684;&#x3002;</p><p>&#x672C;&#x4E66;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x4E0D;&#x662F;&#x5B64;&#x7ACB;&#x5730;&#x8BB2;C&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x662F;&#x548C;&#x7F16;&#x8BD1;&#x539F;&#x7406;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x8BB2;&#x3002;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x672C;&#x4E66;&#x7684;&#x5185;&#x5BB9;&#x53EA;&#x662F;&#x4EE5;C&#x8BED;&#x8A00;&#x4E3A;&#x8F7D;&#x4F53;&#xFF0C;&#x771F;&#x6B63;&#x8BB2;&#x7684;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x539F;&#x7406;&#x548C;&#x7A0B;&#x5E8F;&#x7684;&#x539F;&#x7406;&#x3002;</p></li><li><p>&#x5F3A;&#x8C03;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x57FA;&#x672C;&#x539F;&#x7406;&#xFF0C;&#x5728;&#x7F16;&#x6392;&#x987A;&#x5E8F;&#x4E0A;&#x975E;&#x5E38;&#x91CD;&#x89C6;&#x6982;&#x5FF5;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x6BCF;&#x6B21;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x53EA;&#x4F9D;&#x8D56;&#x4E8E;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x5DF2;&#x7ECF;&#x8BB2;&#x8FC7;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x7EDD;&#x4E0D;&#x4F1A;&#x4F9D;&#x8D56;&#x540E;&#x9762;&#x7AE0;&#x8282;&#x8981;&#x8BB2;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x4E3A;&#x4E86;&#x53D9;&#x8FF0;&#x5F97;&#x5B8C;&#x6574;&#xFF0C;&#x4E5F;&#x4F1A;&#x5F15;&#x7528;&#x540E;&#x9762;&#x8981;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x201C;<span class="quote">&#x6709;&#x5173;XX&#x6211;&#x4EEC;&#x5230;XX&#x7AE0;&#x518D;&#x4ED4;&#x7EC6;&#x8BB2;&#x89E3;</span>&#x201D;&#xFF0C;&#x51E1;&#x662F;&#x8FD9;&#x79CD;&#x5F15;&#x7528;&#x90FD;&#x4E0D;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x53EF;&#x4EE5;&#x5F53;&#x5B83;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x53EA;&#x7BA1;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x770B;&#x5C31;&#x884C;&#x4E86;&#x3002;</p></li><li><p>&#x5C3D;&#x91CF;&#x505A;&#x5230;&#x6BCF;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x76F4;&#x5230;&#x8981;&#x7528;&#x7684;&#x65F6;&#x5019;&#x624D;&#x5F15;&#x5165;&#x3002;&#x8FC7;&#x65E9;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x8BB2;&#x5B8C;&#x4E86;&#x53C8;&#x4E0D;&#x7528;&#x5B83;&#xFF0C;&#x8BFB;&#x8005;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x9057;&#x5FD8;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x8BA4;&#x77E5;&#x89C4;&#x5F8B;&#x7684;&#x3002;</p></li></ul></div><p>&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x4ECE;&#x96F6;&#x57FA;&#x7840;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7684;&#x4E66;&#xFF0C;&#x4E0D;&#x8981;&#x6C42;&#x8BFB;&#x8005;&#x6709;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F46;&#x8BFB;&#x8005;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x7D20;&#x8D28;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>&#x719F;&#x6089;Linux&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5177;&#x5907;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x8BF7;&#x5148;&#x53C2;&#x8003;&#x5176;&#x5B83;&#x6559;&#x6750;&#x5B66;&#x4E60;Linux&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#xFF0C;&#x719F;&#x7EC3;&#x4E4B;&#x540E;&#x518D;&#x5B66;&#x4E60;&#x672C;&#x4E66;&#xFF0C;&#x300A;&#x9E1F;&#x54E5;&#x7684;Linux&#x79C1;&#x623F;&#x83DC;&#x300B;&#x636E;&#x8BF4;&#x662F;Linux&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x548C;&#x5E94;&#x7528;&#x65B9;&#x9762;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E00;&#x672C;&#x4E66;&#x3002;&#x4F46;&#x5B66;&#x4E60;&#x672C;&#x4E66;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4F1A;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x53EA;&#x8981;&#x4F1A;&#x7528;&#x57FA;&#x672C;&#x547D;&#x4EE4;&#xFF0C;&#x4F1A;&#x81EA;&#x5DF1;&#x5B89;&#x88C5;&#x7CFB;&#x7EDF;&#x548C;&#x8F6F;&#x4EF6;&#x5305;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p></li><li><p>&#x5177;&#x6709;&#x9AD8;&#x4E2D;&#x6BD5;&#x4E1A;&#x7684;&#x6570;&#x5B66;&#x6C34;&#x5E73;&#x3002;&#x672C;&#x4E66;&#x4F1A;&#x7528;&#x5230;&#x9AD8;&#x4E2D;&#x7684;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5177;&#x6709;&#x9AD8;&#x4E2D;&#x6BD5;&#x4E1A;&#x7684;&#x6570;&#x5B66;&#x6C34;&#x5E73;&#xFF0C;&#x4E5F;&#x4E0D;&#x5FC5;&#x8003;&#x8651;&#x505A;&#x7A0B;&#x5E8F;&#x5458;&#x4E86;&#x3002;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x53EA;&#x8981;&#x5177;&#x6709;&#x9AD8;&#x4E2D;&#x6BD5;&#x4E1A;&#x7684;&#x6570;&#x5B66;&#x6C34;&#x5E73;&#x5C31;&#x8DB3;&#x591F;&#x505A;&#x7A0B;&#x5E8F;&#x5458;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x8BF4;&#x770B;&#x8FD9;&#x672C;&#x4E66;&#x5E94;&#x8BE5;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x5B66;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4FEE;&#x517B;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6570;&#x5B66;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6570;&#x5B66;&#x529F;&#x5E95;&#x5F88;&#x5DEE;&#xFF0C;&#x65E5;&#x540E;&#x8FD8;&#x9700;&#x6076;&#x8865;&#x4E00;&#x4E0B;&#x3002;</p></li><li><p>&#x5177;&#x6709;&#x9AD8;&#x4E2D;&#x6BD5;&#x4E1A;&#x7684;&#x82F1;&#x6587;&#x6C34;&#x5E73;&#x3002;&#x7406;&#x7531;&#x540C;&#x4E0A;&#x3002;</p></li><li><p>&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x539F;&#x7406;&#x548C;&#x672C;&#x8D28;&#x6DF1;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E0D;&#x662F;&#x4E3A;&#x5C31;&#x4E1A;&#x800C;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x662F;&#x4E3A;&#x62FF;&#x9AD8;&#x85AA;&#x800C;&#x5B66;&#x4E60;&#xFF0C;&#x800C;&#x662F;&#x771F;&#x7684;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x60F3;&#x628A;&#x4E00;&#x5207;&#x6765;&#x9F99;&#x53BB;&#x8109;&#x641E;&#x5F97;&#x6E05;&#x6E05;&#x695A;&#x695A;&#x800C;&#x5B66;&#x4E60;&#x3002;</p></li><li><p>&#x52E4;&#x4E8E;&#x601D;&#x8003;&#x3002;&#x672C;&#x4E66;&#x5C3D;&#x6700;&#x5927;&#x52AA;&#x529B;&#x7406;&#x6E05;&#x6982;&#x5FF5;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x529B;&#x6C42;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;&#xFF0C;&#x8BFB;&#x8005;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x4E86;&#x627E;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x5B9A;&#x4E49;&#x53BB;&#x7FFB;&#x5176;&#x5B83;&#x4E66;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x4E86;&#x641E;&#x6E05;&#x695A;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x524D;&#x540E;&#x4E00;&#x901A;&#x4E71;&#x7FFB;&#xFF0C;&#x53EA;&#x9700;&#x4ECE;&#x524D;&#x5230;&#x540E;&#x6309;&#x987A;&#x5E8F;&#x5B66;&#x4E60;&#x5373;&#x53EF;&#x3002;&#x4F46;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;&#x5E76;&#x4E0D;&#x7B49;&#x4E8E;&#x50BB;&#x74DC;&#x5F0F;&#x5B66;&#x4E60;&#xFF0C;&#x6709;&#x4E9B;&#x7AE0;&#x8282;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x9700;&#x8981;&#x79EF;&#x6781;&#x601D;&#x8003;&#x624D;&#x80FD;&#x9886;&#x4F1A;&#x3002;&#x672C;&#x4E66;&#x53EF;&#x4EE5;&#x66FF;&#x4F60;&#x8282;&#x7701;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x66FF;&#x4F60;&#x601D;&#x8003;&#xFF0C;&#x4E0D;&#x8981;&#x6307;&#x671B;&#x50CF;&#x770B;&#x5C0F;&#x8BF4;&#x4E00;&#x6837;&#x8D70;&#x9A6C;&#x89C2;&#x82B1;&#x770B;&#x4E00;&#x904D;&#x5C31;&#x80FD;&#x5B66;&#x4F1A;&#x3002;</p></li></ul></div></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2702657"></a>&#x53C8;&#x662F;&#x4E00;&#x672C;C&#x8BED;&#x8A00;&#x4E66;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8981;&#x5B66;&#x8FD9;&#x672C;&#x4E66;&#x800C;&#x4E0D;&#x662F;&#x8C2D;&#x6D69;&#x5F3A;&#x6216;&#x8005;K&amp;R&#xFF1F;</h2></div></div></div><p>&#x8C2D;&#x6D69;&#x5F3A;&#x7684;&#x4E66;&#x6211;&#x5C31;&#x4E0D;&#x8BF4;&#x4EC0;&#x4E48;&#x4E86;&#x3002;&#x5C45;&#x7136;&#x6559;&#x5B66;&#x751F;<code class="literal">include</code>&#x4E00;&#x4E2A;<code class="literal">.c</code>&#x6587;&#x4EF6;&#x3002;</p><p>K&amp;R&#x662F;&#x516C;&#x8BA4;&#x7684;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x7ECF;&#x5178;&#x7684;C&#x8BED;&#x8A00;&#x6559;&#x7A0B;&#xFF0C;&#x8FD9;&#x70B9;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x3002;&#x5728;C&#x6807;&#x51C6;&#x51FA;&#x53F0;&#x4E4B;&#x524D;&#xFF0C;K&amp;R&#x7B2C;&#x4E00;&#x7248;&#x5C31;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x7684;C&#x6807;&#x51C6;&#x3002;C89&#x6807;&#x51C6;&#x51FA;&#x53F0;&#x4E4B;&#x540E;&#xFF0C;K&amp;R&#x8DDF;&#x7740;&#x6807;&#x51C6;&#x63A8;&#x51FA;&#x4E86;&#x7B2C;&#x4E8C;&#x7248;&#xFF0C;&#x53EF;&#x60DC;&#x6B64;&#x540E;&#x5C31;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#x8FC7;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x53CD;&#x6620;C89&#x4E4B;&#x540E;C&#x8BED;&#x8A00;&#x7684;&#x53D1;&#x5C55;&#x4EE5;&#x53CA;&#x6700;&#x65B0;&#x7684;C99&#x6807;&#x51C6;&#xFF0C;&#x672C;&#x4E66;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x8865;&#x5145;&#x3002;&#x4E0A;&#x9762;&#x6211;&#x8BF4;&#x8FC7;&#x4E86;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x4E0E;&#x5176;&#x8BF4;&#x662F;&#x8BB2;C&#x8BED;&#x8A00;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#x662F;&#x4EE5;C&#x8BED;&#x8A00;&#x4E3A;&#x8F7D;&#x4F53;&#x8BB2;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x800C;K&amp;R&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BB2;C&#x8BED;&#x8A00;&#x800C;&#x8BB2;C&#x8BED;&#x8A00;&#xFF0C;&#x4FA7;&#x91CD;&#x70B9;&#x4E0D;&#x540C;&#xFF0C;&#x5185;&#x5BB9;&#x7F16;&#x6392;&#x4E5F;&#x5F88;&#x4E0D;&#x76F8;&#x540C;&#x3002;K&amp;R&#x5199;&#x5F97;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x4EE3;&#x7801;&#x548C;&#x8BED;&#x8A00;&#x90FD;&#x975E;&#x5E38;&#x7B80;&#x6D01;&#xFF0C;&#x4F46;&#x5F88;&#x53EF;&#x60DC;&#xFF0C;&#x53EA;&#x6709;&#x4F1A;C&#x8BED;&#x8A00;&#x7684;&#x4EBA;&#x624D;&#x61C2;&#x5F97;&#x6B23;&#x8D4F;&#x5B83;&#xFF0C;K&amp;R&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x9002;&#x5408;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x4E0D;&#x9002;&#x5408;&#x96F6;&#x57FA;&#x7840;&#x7684;&#x5B66;&#x751F;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x3002;</p></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2702436"></a>&#x8FD9;&#x672C;&#x4E66;&#x201C;<span class="quote">&#x662F;&#x4EC0;&#x4E48;</span>&#x201D;&#x548C;&#x201C;<span class="quote">&#x4E0D;&#x662F;&#x4EC0;&#x4E48;</span>&#x201D;</h2></div></div></div><p>&#x672C;&#x4E66;&#x5305;&#x62EC;&#x4E09;&#x5927;&#x90E8;&#x5206;&#xFF1A;</p><div class="itemizedlist"><ul type="disc"><li><p>C&#x8BED;&#x8A00;&#x5165;&#x95E8;&#x3002;&#x4ECB;&#x7ECD;&#x57FA;&#x672C;&#x7684;C&#x8BED;&#x6CD5;&#xFF0C;&#x5E2E;&#x52A9;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x7684;&#x8BFB;&#x8005;&#x7406;&#x89E3;&#x4EC0;&#x4E48;&#x662F;&#x7A0B;&#x5E8F;&#xFF0C;&#x600E;&#x4E48;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x57F9;&#x517B;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#xFF0C;&#x627E;&#x5230;&#x7F16;&#x7A0B;&#x7684;&#x611F;&#x89C9;&#x3002;&#x524D;&#x534A;&#x90E8;&#x5206;&#x6539;&#x7F16;&#x81EA;<a class="xref" href="bi01.html#bibli.thinkcpp" title="How To Think Like A Computer Scientist: Learning with C++">[<abbr class="abbrev">ThinkCpp</abbr>]</a>&#x3002;</p></li><li><p>C&#x8BED;&#x8A00;&#x672C;&#x8D28;&#x3002;&#x7ED3;&#x5408;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x7406;&#x8BB2;&#x89E3;C&#x7A0B;&#x5E8F;&#x662F;&#x600E;&#x4E48;&#x7F16;&#x8BD1;&#x3001;&#x94FE;&#x63A5;&#x3001;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#x5168;&#x9762;&#x4ECB;&#x7ECD;C&#x7684;&#x8BED;&#x6CD5;&#x3002;&#x4F4D;&#x8FD0;&#x7B97;&#x7684;&#x7AE0;&#x8282;&#x6539;&#x7F16;&#x81EA;&#x4E9A;&#x5D4C;&#x6559;&#x80B2;&#x6797;&#x5C0F;&#x7AF9;&#x8001;&#x5E08;&#x7684;&#x8BB2;&#x4E49;&#xFF0C;&#x94FE;&#x8868;&#x548C;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x7AE0;&#x8282;&#x6539;&#x7F16;&#x81EA;&#x4E9A;&#x5D4C;&#x6559;&#x80B2;&#x6731;&#x8001;&#x5E08;&#x7684;&#x8BB2;&#x4E49;&#x3002;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7684;&#x7AE0;&#x8282;&#x6539;&#x7F16;&#x81EA;<a class="xref" href="bi01.html#bibli.groundup" title="Programming from the Ground Up: An Introduction to Programming using Linux Assembly Language">[<abbr class="abbrev">GroudUp</abbr>]</a>&#xFF0C;&#x5728;&#x8BE5;&#x4E66;&#x7684;&#x6700;&#x540E;&#x4E00;&#x7AE0;&#x63D0;&#x5230;&#xFF0C;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x6709;&#x4E24;&#x79CD;Approach&#xFF0C;&#x4E00;&#x79CD;&#x662F;Bottom Up&#xFF0C;&#x4E00;&#x79CD;&#x662F;Top Down&#xFF0C;&#x5404;&#x6709;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x9700;&#x8981;&#x4E24;&#x8005;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x7F16;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x7B2C;&#x4E00;&#x90E8;&#x5206;Top Down&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;Bottom Up&#xFF0C;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x7B97;&#x586B;&#x4E86;&#x4E2D;&#x95F4;&#x7684;&#x7A7A;&#x9699;&#xFF0C;&#x4E09;&#x90E8;&#x5206;&#x5168;&#x90FD;&#x56F4;&#x7ED5;C&#x8BED;&#x8A00;&#x5C55;&#x5F00;&#x3002;</p></li><li><p>Linux&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x3002;&#x4ECB;&#x7ECD;&#x5404;&#x79CD;Linux&#x7CFB;&#x7EDF;&#x51FD;&#x6570;&#x548C;&#x5185;&#x6838;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;Socket&#x7F16;&#x7A0B;&#x7684;&#x7AE0;&#x8282;&#x6539;&#x7F16;&#x81EA;&#x4E9A;&#x5D4C;&#x6559;&#x80B2;&#x536B;&#x5251;&#x9492;&#x8001;&#x5E08;&#x7684;&#x8BB2;&#x4E49;&#x3002;</p></li></ul></div><p>&#x8FD9;&#x672C;&#x4E66;&#x5B9A;&#x4F4D;&#x5728;&#x5165;&#x95E8;&#x7EA7;&#xFF0C;&#x867D;&#x7136;&#x5185;&#x5BB9;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x4E00;&#x672C;&#x767E;&#x79D1;&#x5168;&#x4E66;&#xFF0C;&#x9664;&#x4E86;C&#x8BED;&#x8A00;&#x57FA;&#x672C;&#x8981;&#x8BB2;&#x900F;&#x4E4B;&#x5916;&#x5176;&#x5B83;&#x5185;&#x5BB9;&#x90FD;&#x4E0D;&#x6DF1;&#x5165;&#xFF0C;&#x4E66;&#x4E2D;&#x5217;&#x51FA;&#x4E86;&#x5F88;&#x591A;&#x53C2;&#x8003;&#x8D44;&#x6599;&#xFF0C;&#x662F;&#x8BFB;&#x8005;&#x8FDB;&#x4E00;&#x6B65;&#x5B66;&#x4E60;&#x7684;&#x8D77;&#x70B9;&#x3002;K&amp;R&#x7684;&#x7B2C;&#x4E00;&#x7AE0;&#x662F;&#x4E00;&#x4E2A;Whirlwind Tour&#xFF0C;&#x628A;&#x5168;&#x4E66;&#x7684;&#x5185;&#x5BB9;&#x7B80;&#x5355;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x9010;&#x4E2A;&#x6DF1;&#x5165;&#x8FDB;&#x53BB;&#x8BB2;&#x89E3;&#x3002;&#x672C;&#x4E66;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x8BFE;&#x7A0B;&#x4F53;&#x7CFB;&#x7684;&#x4E00;&#x4E2A;Whirlwind Tour&#xFF0C;&#x5B66;&#x4E60;&#x5B8C;&#x672C;&#x4E66;&#x4E4B;&#x540E;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x89C2;&#xFF0C;&#x518D;&#x53BB;&#x5B66;&#x4E60;&#x90A3;&#x4E9B;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x5C31;&#x5E94;&#x8BE5;&#x5F88;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#x4E86;&#x3002;</p></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2702965"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5728;Linux&#x5E73;&#x53F0;&#x4E0A;&#x5B66;C&#x8BED;&#x8A00;&#xFF1F;&#x7528;Windows&#x5B66;C&#x8BED;&#x8A00;&#x4E0D;&#x597D;&#x5417;&#xFF1F;</h2></div></div></div><p>&#x7528;Windows&#x8FD8;&#x771F;&#x7684;&#x662F;&#x5B66;&#x4E0D;&#x597D;C&#x8BED;&#x8A00;&#x3002;C&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x79CD;&#x9762;&#x5411;&#x5E95;&#x5C42;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x8981;&#x5199;&#x597D;C&#x7A0B;&#x5E8F;&#xFF0C;&#x5FC5;&#x987B;&#x5BF9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x975E;&#x5E38;&#x6E05;&#x695A;&#xFF0C;&#x56E0;&#x4E3A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E5F;&#x662F;&#x7528;C&#x5199;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7528;C&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x65E2;&#x7136;&#x4F60;&#x9009;&#x62E9;&#x4E86;&#x770B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#xFF1A;Linux&#x662F;&#x4E00;&#x79CD;&#x5F00;&#x6E90;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x6709;&#x4EFB;&#x4F55;&#x7591;&#x95EE;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x6587;&#x6863;&#x4E2D;&#x627E;&#x5230;&#x7B54;&#x6848;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x770B;&#x4E0D;&#x61C2;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x627E;&#x4E0D;&#x5230;&#x6587;&#x6863;&#xFF0C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x4E2A;&#x9AD8;&#x624B;&#x6559;&#x4F60;&#xFF0C;&#x5404;&#x79CD;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x3001;&#x65B0;&#x95FB;&#x7EC4;&#x548C;&#x8BBA;&#x575B;&#x4E0A;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x7F3A;&#x4E50;&#x4E8E;&#x52A9;&#x4EBA;&#x7684;&#x9AD8;&#x624B;&#xFF1B;&#x800C;Windows&#x662F;&#x4E00;&#x79CD;&#x5C01;&#x95ED;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x9664;&#x4E86;&#x5FAE;&#x8F6F;&#x7684;&#x5458;&#x5DE5;&#x522B;&#x4EBA;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#x5B83;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x6587;&#x6863;&#x53BB;&#x731C;&#x6D4B;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x5FAE;&#x8F6F;&#x5411;&#x6765;&#x559C;&#x6B22;&#x85CF;&#x7740;&#x63F6;&#x7740;&#xFF0C;&#x597D;&#x7528;&#x7684;&#x529F;&#x80FD;&#x7559;&#x7740;&#x81EA;&#x5DF1;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5199;&#x5230;&#x6587;&#x6863;&#x91CC;&#x516C;&#x5F00;&#x3002;&#x672C;&#x4E66;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x5728;Linux&#x6216;Windows&#x5E73;&#x53F0;&#x4E0A;&#x5B66;&#x4E60;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x548C;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x4ECB;&#x7ECD;&#x4E86;&#x5F88;&#x591A;Linux&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x7406;&#x4EE5;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x7406;&#x89E3;C&#x8BED;&#x8A00;&#xFF0C;&#x53EA;&#x80FD;&#x5728;Linux&#x5E73;&#x53F0;&#x4E0A;&#x5B66;&#x4E60;&#x3002;</p><p>Windows&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x5F80;&#x5F80;&#x548C;&#x5404;&#x79CD;&#x96C6;&#x6210;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF08;IDE&#xFF0C;Integrated Development Environment&#xFF09;<a id="id2703000" class="indexterm"></a>&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F8B;&#x5982;Visual Studio&#x3001;Eclipse&#x7B49;&#x3002;&#x4F7F;&#x7528;IDE&#x786E;&#x5B9E;&#x5F88;&#x4FBF;&#x6377;&#xFF0C;&#x4F46;IDE&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x597D;&#x4E1C;&#x897F;&#x3002;&#x5FAE;&#x8F6F;&#x559C;&#x6B22;&#x5BA3;&#x626C;&#x50BB;&#x74DC;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x7528;&#x9F20;&#x6807;&#x62D6;&#x51E0;&#x4E2A;&#x63A7;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1;&#x51FA;&#x7A0B;&#x5E8F;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x6709;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x6709;&#x54EA;&#x4E2A;&#x662F;&#x8FD9;&#x4E48;&#x62D6;&#x51FA;&#x6765;&#x7684;&#xFF1F;&#x5F88;&#x591A;&#x4ECE;Windows&#x5E73;&#x53F0;&#x5165;&#x95E8;&#x5B66;&#x7F16;&#x7A0B;&#x7684;&#x4EBA;&#xFF0C;&#x7F16;&#x4E86;&#x597D;&#x51E0;&#x5E74;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD8;&#x662F;&#x53EA;&#x77E5;&#x9053;&#x7F16;&#x5B8C;&#x7A0B;&#x5E8F;&#x70B9;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x8DD1;&#x4E86;&#xFF0C;&#x628A;&#x51E0;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x62D6;&#x5230;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x91CC;&#x5C31;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1;&#x5230;&#x4E00;&#x8D77;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x66F4;&#x590D;&#x6742;&#x7684;&#x9700;&#x6C42;&#x4ED6;&#x4EEC;&#x5C31;&#x50BB;&#x773C;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x8111;&#x5B50;&#x91CC;&#x53EA;&#x6709;&#x6309;&#x94AE;&#x3001;&#x83DC;&#x5355;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x94FE;&#x63A5;&#x5668;&#x3001;Makefile&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x547D;&#x4EE4;&#x884C;&#x90FD;&#x6CA1;&#x7528;&#x8FC7;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x521D;&#x5B66;&#x7F16;&#x7A0B;&#x5C31;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x94FE;&#x63A5;&#x5668;&#x548C;C&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x6CD5;&#x6709;&#x5BC6;&#x5207;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4E0D;&#x4E86;&#x89E3;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x94FE;&#x63A5;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x771F;&#x6B63;&#x638C;&#x63E1;C&#x7684;&#x8BED;&#x6CD5;&#x3002;&#x6240;&#x4EE5;&#xFF0C;IDE&#x5E76;&#x6CA1;&#x6709;&#x5E2E;&#x52A9;&#x4F60;&#x5B66;&#x4E60;&#xFF0C;&#x800C;&#x662F;&#x963B;&#x788D;&#x4E86;&#x4F60;&#x5B66;&#x4E60;&#xFF0C;&#x672C;&#x6765;&#x8981;&#x5B66;&#x597D;C&#x7F16;&#x7A0B;&#x53EA;&#x8981;&#x628A;&#x8BED;&#x6CD5;&#x548C;&#x7F16;&#x8BD1;&#x547D;&#x4EE4;&#x5B66;&#x4F1A;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6709;&#x4E86;IDE&#xFF0C;&#x9664;&#x4E86;&#x5B66;&#x4F1A;&#x8BED;&#x6CD5;&#x548C;&#x7F16;&#x8BD1;&#x547D;&#x4EE4;&#xFF0C;&#x4F60;&#x8FD8;&#x5F97;&#x5F04;&#x6E05;&#x695A;&#x7F16;&#x8BD1;&#x547D;&#x4EE4;&#x548C;IDE&#x662F;&#x600E;&#x4E48;&#x96C6;&#x6210;&#x7684;&#xFF0C;&#x8FD9;&#x624D;&#x7B97;&#x5B66;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x590D;&#x6742;&#x7684;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x88AB;IDE&#x641E;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x4E86;&#x3002;Linux&#x7528;&#x6237;&#x7684;&#x4F7F;&#x7528;&#x4E60;&#x60EF;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x4EE5;&#x6572;&#x547D;&#x4EE4;&#x4E3A;&#x4E3B;&#xFF0C;&#x4EE5;&#x9F20;&#x6807;&#x64CD;&#x4F5C;&#x4E3A;&#x8F85;&#xFF0C;&#x4ECE;&#x5B66;&#x7F16;&#x7A0B;&#x7684;&#x7B2C;&#x4E00;&#x5929;&#x8D77;&#x5C31;&#x8981;&#x6572;&#x547D;&#x4EE4;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#xFF0C;&#x7B49;&#x5230;&#x4F60;&#x628A;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x90FD;&#x641E;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x54EA;&#x4E2A;IDE&#x597D;&#x7528;&#x4F60;&#x518D;&#x53BB;&#x7528;&#xFF0C;&#x4E0D;&#x8FC7;&#x5230;&#x90A3;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x559C;&#x6B22;<code class="literal">vi</code>&#x6216;<code class="literal">emacs</code>&#x800C;&#x4E0D;&#x662F;IDE&#x4E86;&#x3002;</p></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2703070"></a>&#x81F4;&#x8C22;</h2></div></div></div><p>&#x672C;&#x4E66;&#x7684;&#x5199;&#x4F5C;&#x5F97;&#x5230;&#x5317;&#x4EAC;&#x4E9A;&#x5D4C;&#x6559;&#x80B2;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x7684;&#x5168;&#x529B;&#x652F;&#x6301;&#xFF0C;&#x5C24;&#x5176;&#x611F;&#x8C22;&#x674E;&#x660E;&#x8001;&#x5E08;&#x548C;&#x4F55;&#x5BB6;&#x80DC;&#x8001;&#x5E08;&#xFF0C;&#x6CA1;&#x6709;&#x516C;&#x53F8;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6211;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x65F6;&#x95F4;&#x6709;&#x6761;&#x4EF6;&#x5199;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x673A;&#x4F1A;&#x5C06;&#x8FD9;&#x672C;&#x4E66;&#x516C;&#x5F00;&#x5728;&#x7F51;&#x4E0A;&#x3002;</p><p>&#x7136;&#x540E;&#x8981;&#x611F;&#x8C22;&#x4E9A;&#x5D4C;&#x6559;&#x80B2;&#x7684;&#x5386;&#x5C4A;&#x5B66;&#x5458;&#x548C;&#x5404;&#x4F4D;&#x8001;&#x5E08;&#xFF0C;&#x5728;&#x6559;&#x5B66;&#x548C;&#x8BA8;&#x8BBA;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x7ECF;&#x5E38;&#x4F1A;&#x5F97;&#x5230;&#x6709;&#x76CA;&#x7684;&#x542F;&#x53D1;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x4FC3;&#x4F7F;&#x8FD9;&#x672C;&#x4E66;&#x66F4;&#x52A0;&#x5B8C;&#x5584;&#x3002;&#x5728;&#x672C;&#x4E66;&#x7684;&#x5199;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x8BFB;&#x8005;&#x4E3A;&#x672C;&#x4E66;&#x63D0;&#x51FA;&#x5F88;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x5F88;&#x591A;&#x5EFA;&#x8BAE;&#x662F;&#x70ED;&#x5FC3;&#x7F51;&#x53CB;&#x901A;&#x8FC7;&#x5728;&#x7EBF;&#x8BC4;&#x8BBA;&#x63D0;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x7F51;&#x53CB;&#x6211;&#x53EA;&#x77E5;&#x9053;id&#x6216;email&#x3002;&#x90FD;&#x5217;&#x5728;&#x4E0B;&#x9762;&#xFF0C;&#x6392;&#x540D;&#x4E0D;&#x5206;&#x5148;&#x540E;&#x3002;</p><p>&#x611F;&#x8C22;&#x5317;&#x4EAC;&#x4E9A;&#x5D4C;&#x6559;&#x80B2;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x7684;&#x8001;&#x5E08;&#x4EEC;&#xFF1A;&#x674E;&#x660E;&#xFF0C;&#x4F55;&#x5BB6;&#x80DC;&#xFF0C;&#x90B8;&#x6D77;&#x971E;&#xFF0C;&#x90CE;&#x94C1;&#x5C71;&#xFF0C;&#x6731;&#x4EF2;&#x6D9B;&#xFF0C;&#x5ED6;&#x6587;&#x6C5F;&#xFF0C;&#x97E9;&#x8D85;&#xFF0C;&#x5434;&#x5CB3;&#xFF0C;&#x90A2;&#x6587;&#x9E4F;&#xFF0C;&#x4F55;&#x6653;&#x9F99;&#xFF0C;&#x6797;&#x5C0F;&#x7AF9;&#xFF0C;&#x536B;&#x5251;&#x9492;&#x3002;</p><p>&#x611F;&#x8C22;&#x70ED;&#x5FC3;&#x7F51;&#x53CB;&#xFF1A;ddd&#xFF08;ddd@clf.net&#xFF09;&#xFF0C;wuyulei&#xFF08;wuyulei0210@163.com&#xFF09;&#xFF0C;comma&#xFF08;commapopo@hotmail.com&#xFF09;&#xFF0C;&#x7530;&#x4F1F;&#xFF08;sioungiep@zzxy.org&#xFF09;&#xFF0C;&#x7530;&#x96E8;&#xFF08;tianyu_1123@hotmail.com &#xFF09;&#xFF0C;daidai&#xFF08;daidai0628@sina.com&#xFF09;&#xFF0C;&#x9093;&#x6960;&#xFF08;monnand@gmail.com&#xFF09;&#xFF0C;&#x675C;&#x6734;&#x98CE;&#xFF08;cplusplus@zzxy.org&#xFF09;&#xFF0C;Zoom.Quiet&#xFF08;zoom.quiet@gmail.com&#xFF09;&#xFF0C;&#x9648;&#x8001;&#x5E08;&#xFF08;cljcore@gmail.com&#xFF09;&#xFF0C;&#x6768;&#x666F;&#xFF08;yangbajing@gmail.com&#xFF09;&#xFF0C;&#x7AE0;&#x94B0;&#xFF08;buptzhangyu@163.com&#xFF09;&#xFF0C;chen&#xFF08;cry2133@gmail.com&#xFF09;&#xFF0C;Jiawei Zhang&#xFF08;rhythm.zhang@gmail.com&#xFF09;&#xFF0C;waterloo&#xFF08;waterloo2005@gmail.com&#xFF09;&#xFF0C;&#x5F20;&#x73B0;&#x8D85;&#xFF08;zxqianrong@gmail.com&#xFF0C;http://zxqianrong.is-programmer.com/&#xFF09;&#xFF0C;&#x66FE;&#x5B87;&#xFF08;uyucn@163.com&#xFF09;&#xFF0C;&#x8463;&#x4FCA;&#x6CE2;&#xFF08;dongjunbo@gmail.com&#xFF09;&#xFF0C;RobinXiang&#xFF08;dancelinux@gmail.com&#xFF09;&#xFF0C;&#x5218;&#x8273;&#x660E;&#xFF08;lonny_liu@hotmail.com&#xFF09;&#xFF0C;&#x4ED8;&#xFF08;been2100@163.com&#xFF09;&#xFF0C;cleverd&#xFF08;crossie@qq.com&#xFF09;&#xFF0C;orange&#xFF08;juicerococo@hotmail.com&#xFF09;&#xFF0C;&#x5F90;&#x658C;&#xFF08;simlink_xub@163.com&#xFF09;&#xFF0C;cyy&#xFF08;cyy198767@hotmail.com&#xFF09;&#xFF0C;Linux_Xfce&#xFF08;coodycody23@gmail.com&#xFF09;&#xFF0C;&#x51AF;&#x6D77;&#x4E91;&#xFF08;906702745@qq.com&#xFF09;&#xFF0C;&#x4FAF;&#x5EF6;&#x7965;&#xFF08;houyx2008@163.com&#xFF09;&#xFF0C;churchmice&#xFF08;firefoxelectric@gmail.com&#xFF09;&#xFF0C;linux&#x2014;&#x2014;00xx00xxooxx&#xFF08;codycody23@gmail.com&#xFF09;&#xFF0C;syfeagle&#xFF08;syfeagle@hotmail.com&#xFF09;&#xFF0C;&#x738B;&#x516C;&#x4EC6;&#xFF08;wanggongpu@gmail.com&#xFF09;&#xFF0C;&#x5218;&#x654F;&#xFF08;liuminchinese@163.com&#xFF09;&#xFF0C;Laciq&#xFF08;dd@qq.com&#xFF09;&#x3002;</p><p>&#x5728;&#x5199;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x9047;&#x5230;&#x8FC7;&#x5F88;&#x591A;&#x56F0;&#x96BE;&#xFF0C;&#x5DE5;&#x4F5C;&#x7E41;&#x5FD9;&#xFF0C;&#x5BF9;&#x672A;&#x6765;&#x8FF7;&#x832B;&#xFF0C;&#x751F;&#x6D3B;&#x538B;&#x529B;&#x5927;&#xFF0C;&#x7F3A;&#x4E4F;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x4E2A;&#x4EBA;&#x7410;&#x4E8B;&#x7B49;&#x7B49;&#x3002;&#x7136;&#x800C;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x70ED;&#x5FC3;&#x7684;&#x540C;&#x5B66;&#x3001;&#x8001;&#x5E08;&#x3001;&#x670B;&#x53CB;&#x3001;&#x7F51;&#x53CB;&#x5728;&#x7B49;&#x7740;&#x770B;&#x6211;&#x7684;&#x4E66;&#x66F4;&#x65B0;&#xFF0C;&#x7ED9;&#x6211;&#x63D0;&#x5EFA;&#x8BAE;&#x5E0C;&#x671B;&#x6211;&#x628A;&#x4E66;&#x6539;&#x5F97;&#x66F4;&#x5B8C;&#x5584;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x575A;&#x6301;&#x5199;&#x4E0B;&#x53BB;&#x7684;&#x6700;&#x5927;&#x7684;&#x52A8;&#x529B;&#x3002;&#x8C22;&#x8C22;&#x4F60;&#x4EEC;&#xFF01;</p></div><div class="simplesect" lang="zh-cn" xml:lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="id2702714"></a>&#x6700;&#x540E;&#x51E0;&#x53E5;&#x8BDD;</h2></div></div></div><p>&#x548C;&#x5927;&#x591A;&#x6570;&#x4F5C;&#x8005;&#x4E00;&#x6837;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x8981;&#x8BF4;&#x7684;&#x662F;&#x6211;&#x6C34;&#x5E73;&#x5341;&#x5206;&#x6709;&#x9650;&#xFF0C;&#x6CA1;&#x5199;&#x8FC7;C&#x7F16;&#x8BD1;&#x5668;&#x548C;C&#x6807;&#x51C6;&#x5E93;&#xFF0C;&#x6211;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4E66;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5168;&#x90E8;&#x6B63;&#x786E;&#xFF0C;&#x5982;&#x6709;&#x9519;&#x8BEF;&#x6B22;&#x8FCE;&#x6279;&#x8BC4;&#x6307;&#x6B63;&#x3002;&#x9057;&#x61BE;&#x7684;&#x662F;&#x5F88;&#x591A;&#x4F5C;&#x8005;&#x628A;&#x8FD9;&#x53E5;&#x8BDD;&#x5F53;&#x6210;&#x4E86;&#x6321;&#x7BAD;&#x724C;&#xFF0C;&#x5F53;&#x6210;&#x4E86;&#x81EA;&#x5DF1;&#x4E0D;&#x5FC5;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x4FDD;&#x8BC1;&#x5185;&#x5BB9;&#x6B63;&#x786E;&#x6027;&#x7684;&#x501F;&#x53E3;&#x3002;&#x5199;&#x4E66;&#x662F;&#x4E00;&#x4EF6;&#x4E25;&#x8083;&#x7684;&#x4E8B;&#xFF0C;&#x4E66;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x770B;&#x5F97;&#x89C1;&#xFF0C;&#x767D;&#x7EB8;&#x9ED1;&#x5B57;&#x8D56;&#x4E0D;&#x6389;&#x7684;&#x3002;&#x6211;&#x6559;&#x8FC7;&#x7684;&#x5F88;&#x591A;&#x5B66;&#x751F;&#x90FD;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x5B66;&#x8FC7;C&#x8BED;&#x8A00;&#xFF0C;&#x751A;&#x81F3;&#x8003;&#x8FC7;&#x4E8C;&#x7EA7;&#xFF0C;&#x4F46;&#x7A0B;&#x5E8F;&#x5199;&#x5F97;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#xFF0C;&#x8FDE;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6982;&#x5FF5;&#x90FD;&#x641E;&#x9519;&#x4E86;&#xFF0C;&#x4EE5;&#x524D;&#x5B66;&#x8FC7;&#x7684;C&#x8BED;&#x8A00;&#x6559;&#x6750;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x5728;&#x4ED6;&#x4EEC;&#x8111;&#x5B50;&#x91CC;&#x6839;&#x6DF1;&#x8482;&#x56FA;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x7EA0;&#x6B63;&#x591A;&#x6B21;&#xFF0C;&#x4ED6;&#x4EEC;&#x4ECD;&#x7136;&#x53EA;&#x8BB0;&#x5F97;&#x4EE5;&#x524D;&#x5B66;&#x8FC7;&#x7684;&#x9519;&#x8BEF;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x79CD;&#x6709;&#x57FA;&#x7840;&#x7684;&#x5B66;&#x751F;&#x8FD8;&#x4E0D;&#x5982;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x57FA;&#x7840;&#x7684;&#x5B66;&#x751F;&#x6559;&#x8D77;&#x6765;&#x5BB9;&#x6613;&#x3002;&#x6211;&#x975E;&#x5E38;&#x5BB3;&#x6015;&#x6211;&#x6559;&#x7ED9;&#x522B;&#x4EBA;&#x7684;&#x4ECD;&#x7136;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4ED4;&#x7EC6;&#x7814;&#x7A76;&#x4E86;C99&#x4E4B;&#x540E;&#x624D;&#x6562;&#x52A8;&#x7B14;&#x5199;&#x4E66;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x6DB5;&#x76D6;&#x7684;&#x8BDD;&#x9898;&#x6BD4;&#x8F83;&#x5E7F;&#x6CDB;&#xFF0C;&#x6211;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x4E5F;&#x4E0D;&#x8DB3;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E66;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5168;&#x90E8;&#x6B63;&#x786E;&#xFF0C;&#x8FD8;&#x8981;&#x4F9D;&#x9760;&#x793E;&#x533A;&#x7684;&#x529B;&#x91CF;&#x4E00;&#x8D77;&#x6765;&#x5B8C;&#x5584;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x5BF9;&#x8BFB;&#x8005;&#x8D1F;&#x8D23;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x9009;&#x62E9;&#x5C06;&#x8FD9;&#x672C;&#x4E66;&#x5F00;&#x6E90;&#x3002;</p><p>&#x5E0C;&#x671B;&#x672C;&#x4E66;&#x6210;&#x4E3A;&#x4F60;&#x6C42;&#x5B66;&#x9053;&#x8DEF;&#x4E0A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4F19;&#x4F34;&#x3002;</p><p><span class="author"><span class="firstname">&#x5B8B;&#x52B2;&#x6749;</span></span>
&#x5317;&#x4EAC; 2008&#x5E74;11&#x6708;27&#x65E5;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="pr01.html">&#x4E0A;&#x4E00;&#x9875;</a>&#xA0;</td><td width="20%" align="center">&#xA0;</td><td width="40%" align="right">&#xA0;<a accesskey="n" href="pt01.html">&#x4E0B;&#x4E00;&#x9875;</a></td></tr><tr><td width="40%" align="left" valign="top">&#x5386;&#x53F2;&#xA0;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#x8D77;&#x59CB;&#x9875;</a></td><td width="40%" align="right" valign="top">&#xA0;&#x90E8;&#x5206;&#xA0;I.&#xA0;C&#x8BED;&#x8A00;&#x5165;&#x95E8;</td></tr></tbody></table></div>
</body></html>